daviskung/PIC16F1579_HM.X_2019_0524/mcc_generated_files/pic16f1579_ref.h
// Register: PWM1TMRL
#define PWM1TMRL PWM1TMRL
extern volatile unsigned char           PWM1TMRL            @ 0xD99;
#ifndef _LIB_BUILD
asm("PWM1TMRL equ 0D99h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned PWM1TMRL0              :1;
        unsigned PWM1TMRL1              :1;
        unsigned PWM1TMRL2              :1;
        unsigned PWM1TMRL3              :1;
        unsigned PWM1TMRL4              :1;
        unsigned PWM1TMRL5              :1;
        unsigned PWM1TMRL6              :1;
        unsigned PWM1TMRL7              :1;
    };
    struct {
        unsigned PWM1TMRL               :8;
    };
} PWM1TMRLbits_t;
extern volatile PWM1TMRLbits_t PWM1TMRLbits @ 0xD99;
// bitfield macros
#define _PWM1TMRL_TMR_POSN                                  0x0
#define _PWM1TMRL_TMR_POSITION                              0x0
#define _PWM1TMRL_TMR_SIZE                                  0x8
#define _PWM1TMRL_TMR_LENGTH                                0x8
#define _PWM1TMRL_TMR_MASK                                  0xFF
#define _PWM1TMRL_PWM1TMRL0_POSN                            0x0
#define _PWM1TMRL_PWM1TMRL0_POSITION                        0x0
#define _PWM1TMRL_PWM1TMRL0_SIZE                            0x1
#define _PWM1TMRL_PWM1TMRL0_LENGTH                          0x1
#define _PWM1TMRL_PWM1TMRL0_MASK                            0x1
#define _PWM1TMRL_PWM1TMRL1_POSN                            0x1
#define _PWM1TMRL_PWM1TMRL1_POSITION                        0x1
#define _PWM1TMRL_PWM1TMRL1_SIZE                            0x1
#define _PWM1TMRL_PWM1TMRL1_LENGTH                          0x1
#define _PWM1TMRL_PWM1TMRL1_MASK                            0x2
#define _PWM1TMRL_PWM1TMRL2_POSN                            0x2
#define _PWM1TMRL_PWM1TMRL2_POSITION                        0x2
#define _PWM1TMRL_PWM1TMRL2_SIZE                            0x1
#define _PWM1TMRL_PWM1TMRL2_LENGTH                          0x1
#define _PWM1TMRL_PWM1TMRL2_MASK                            0x4
#define _PWM1TMRL_PWM1TMRL3_POSN                            0x3
#define _PWM1TMRL_PWM1TMRL3_POSITION                        0x3
#define _PWM1TMRL_PWM1TMRL3_SIZE                            0x1
#define _PWM1TMRL_PWM1TMRL3_LENGTH                          0x1
#define _PWM1TMRL_PWM1TMRL3_MASK                            0x8
#define _PWM1TMRL_PWM1TMRL4_POSN                            0x4
#define _PWM1TMRL_PWM1TMRL4_POSITION                        0x4
#define _PWM1TMRL_PWM1TMRL4_SIZE                            0x1
#define _PWM1TMRL_PWM1TMRL4_LENGTH                          0x1
#define _PWM1TMRL_PWM1TMRL4_MASK                            0x10
#define _PWM1TMRL_PWM1TMRL5_POSN                            0x5
#define _PWM1TMRL_PWM1TMRL5_POSITION                        0x5
#define _PWM1TMRL_PWM1TMRL5_SIZE                            0x1
#define _PWM1TMRL_PWM1TMRL5_LENGTH                          0x1
#define _PWM1TMRL_PWM1TMRL5_MASK                            0x20
#define _PWM1TMRL_PWM1TMRL6_POSN                            0x6
#define _PWM1TMRL_PWM1TMRL6_POSITION                        0x6
#define _PWM1TMRL_PWM1TMRL6_SIZE                            0x1
#define _PWM1TMRL_PWM1TMRL6_LENGTH                          0x1
#define _PWM1TMRL_PWM1TMRL6_MASK                            0x40
#define _PWM1TMRL_PWM1TMRL7_POSN                            0x7
#define _PWM1TMRL_PWM1TMRL7_POSITION                        0x7
#define _PWM1TMRL_PWM1TMRL7_SIZE                            0x1
#define _PWM1TMRL_PWM1TMRL7_LENGTH                          0x1
#define _PWM1TMRL_PWM1TMRL7_MASK                            0x80
#define _PWM1TMRL_PWM1TMRL_POSN                             0x0
#define _PWM1TMRL_PWM1TMRL_POSITION                         0x0
#define _PWM1TMRL_PWM1TMRL_SIZE                             0x8
#define _PWM1TMRL_PWM1TMRL_LENGTH                           0x8
#define _PWM1TMRL_PWM1TMRL_MASK                             0xFF

// Register: PWM1TMRH
#define PWM1TMRH PWM1TMRH
extern volatile unsigned char           PWM1TMRH            @ 0xD9A;
#ifndef _LIB_BUILD
asm("PWM1TMRH equ 0D9Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned PWM1TMRH0              :1;
        unsigned PWM1TMRH1              :1;
        unsigned PWM1TMRH2              :1;
        unsigned PWM1TMRH3              :1;
        unsigned PWM1TMRH4              :1;
        unsigned PWM1TMRH5              :1;
        unsigned PWM1TMRH6              :1;
        unsigned PWM1TMRH7              :1;
    };
    struct {
        unsigned PWM1TMRH               :8;
    };
} PWM1TMRHbits_t;
extern volatile PWM1TMRHbits_t PWM1TMRHbits @ 0xD9A;
// bitfield macros
#define _PWM1TMRH_TMR_POSN                                  0x0
#define _PWM1TMRH_TMR_POSITION                              0x0
#define _PWM1TMRH_TMR_SIZE                                  0x8
#define _PWM1TMRH_TMR_LENGTH                                0x8
#define _PWM1TMRH_TMR_MASK                                  0xFF
#define _PWM1TMRH_PWM1TMRH0_POSN                            0x0
#define _PWM1TMRH_PWM1TMRH0_POSITION                        0x0
#define _PWM1TMRH_PWM1TMRH0_SIZE                            0x1
#define _PWM1TMRH_PWM1TMRH0_LENGTH                          0x1
#define _PWM1TMRH_PWM1TMRH0_MASK                            0x1
#define _PWM1TMRH_PWM1TMRH1_POSN                            0x1
#define _PWM1TMRH_PWM1TMRH1_POSITION                        0x1
#define _PWM1TMRH_PWM1TMRH1_SIZE                            0x1
#define _PWM1TMRH_PWM1TMRH1_LENGTH                          0x1
#define _PWM1TMRH_PWM1TMRH1_MASK                            0x2
#define _PWM1TMRH_PWM1TMRH2_POSN                            0x2
#define _PWM1TMRH_PWM1TMRH2_POSITION                        0x2
#define _PWM1TMRH_PWM1TMRH2_SIZE                            0x1
#define _PWM1TMRH_PWM1TMRH2_LENGTH                          0x1
#define _PWM1TMRH_PWM1TMRH2_MASK                            0x4
#define _PWM1TMRH_PWM1TMRH3_POSN                            0x3
#define _PWM1TMRH_PWM1TMRH3_POSITION                        0x3
#define _PWM1TMRH_PWM1TMRH3_SIZE                            0x1
#define _PWM1TMRH_PWM1TMRH3_LENGTH                          0x1
#define _PWM1TMRH_PWM1TMRH3_MASK                            0x8
#define _PWM1TMRH_PWM1TMRH4_POSN                            0x4
#define _PWM1TMRH_PWM1TMRH4_POSITION                        0x4
#define _PWM1TMRH_PWM1TMRH4_SIZE                            0x1
#define _PWM1TMRH_PWM1TMRH4_LENGTH                          0x1
#define _PWM1TMRH_PWM1TMRH4_MASK                            0x10
#define _PWM1TMRH_PWM1TMRH5_POSN                            0x5
#define _PWM1TMRH_PWM1TMRH5_POSITION                        0x5
#define _PWM1TMRH_PWM1TMRH5_SIZE                            0x1
#define _PWM1TMRH_PWM1TMRH5_LENGTH                          0x1
#define _PWM1TMRH_PWM1TMRH5_MASK                            0x20
#define _PWM1TMRH_PWM1TMRH6_POSN                            0x6
#define _PWM1TMRH_PWM1TMRH6_POSITION                        0x6
#define _PWM1TMRH_PWM1TMRH6_SIZE                            0x1
#define _PWM1TMRH_PWM1TMRH6_LENGTH                          0x1
#define _PWM1TMRH_PWM1TMRH6_MASK                            0x40
#define _PWM1TMRH_PWM1TMRH7_POSN                            0x7
#define _PWM1TMRH_PWM1TMRH7_POSITION                        0x7
#define _PWM1TMRH_PWM1TMRH7_SIZE                            0x1
#define _PWM1TMRH_PWM1TMRH7_LENGTH                          0x1
#define _PWM1TMRH_PWM1TMRH7_MASK                            0x80
#define _PWM1TMRH_PWM1TMRH_POSN                             0x0
#define _PWM1TMRH_PWM1TMRH_POSITION                         0x0
#define _PWM1TMRH_PWM1TMRH_SIZE                             0x8
#define _PWM1TMRH_PWM1TMRH_LENGTH                           0x8
#define _PWM1TMRH_PWM1TMRH_MASK                             0xFF

// Register: PWM1CON
#define PWM1CON PWM1CON
extern volatile unsigned char           PWM1CON             @ 0xD9B;
#ifndef _LIB_BUILD
asm("PWM1CON equ 0D9Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned MODE                   :2;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned OE                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned PWM1MODE0              :1;
        unsigned PWM1MODE1              :1;
    };
    struct {
        unsigned                        :2;
        unsigned PWM1MODE               :2;
        unsigned PWM1POL                :1;
        unsigned PWM1OUT                :1;
        unsigned PWM1OE                 :1;
        unsigned PWM1EN                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
    };
} PWM1CONbits_t;
