daviskung/PIC16F1579_HM.X_2019_0524/mcc_generated_files/pic16f1579_ref.h
extern volatile PWM1CONbits_t PWM1CONbits @ 0xD9B;
// bitfield macros
#define _PWM1CON_MODE_POSN                                  0x2
#define _PWM1CON_MODE_POSITION                              0x2
#define _PWM1CON_MODE_SIZE                                  0x2
#define _PWM1CON_MODE_LENGTH                                0x2
#define _PWM1CON_MODE_MASK                                  0xC
#define _PWM1CON_POL_POSN                                   0x4
#define _PWM1CON_POL_POSITION                               0x4
#define _PWM1CON_POL_SIZE                                   0x1
#define _PWM1CON_POL_LENGTH                                 0x1
#define _PWM1CON_POL_MASK                                   0x10
#define _PWM1CON_OUT_POSN                                   0x5
#define _PWM1CON_OUT_POSITION                               0x5
#define _PWM1CON_OUT_SIZE                                   0x1
#define _PWM1CON_OUT_LENGTH                                 0x1
#define _PWM1CON_OUT_MASK                                   0x20
#define _PWM1CON_OE_POSN                                    0x6
#define _PWM1CON_OE_POSITION                                0x6
#define _PWM1CON_OE_SIZE                                    0x1
#define _PWM1CON_OE_LENGTH                                  0x1
#define _PWM1CON_OE_MASK                                    0x40
#define _PWM1CON_EN_POSN                                    0x7
#define _PWM1CON_EN_POSITION                                0x7
#define _PWM1CON_EN_SIZE                                    0x1
#define _PWM1CON_EN_LENGTH                                  0x1
#define _PWM1CON_EN_MASK                                    0x80
#define _PWM1CON_PWM1MODE0_POSN                             0x2
#define _PWM1CON_PWM1MODE0_POSITION                         0x2
#define _PWM1CON_PWM1MODE0_SIZE                             0x1
#define _PWM1CON_PWM1MODE0_LENGTH                           0x1
#define _PWM1CON_PWM1MODE0_MASK                             0x4
#define _PWM1CON_PWM1MODE1_POSN                             0x3
#define _PWM1CON_PWM1MODE1_POSITION                         0x3
#define _PWM1CON_PWM1MODE1_SIZE                             0x1
#define _PWM1CON_PWM1MODE1_LENGTH                           0x1
#define _PWM1CON_PWM1MODE1_MASK                             0x8
#define _PWM1CON_PWM1MODE_POSN                              0x2
#define _PWM1CON_PWM1MODE_POSITION                          0x2
#define _PWM1CON_PWM1MODE_SIZE                              0x2
#define _PWM1CON_PWM1MODE_LENGTH                            0x2
#define _PWM1CON_PWM1MODE_MASK                              0xC
#define _PWM1CON_PWM1POL_POSN                               0x4
#define _PWM1CON_PWM1POL_POSITION                           0x4
#define _PWM1CON_PWM1POL_SIZE                               0x1
#define _PWM1CON_PWM1POL_LENGTH                             0x1
#define _PWM1CON_PWM1POL_MASK                               0x10
#define _PWM1CON_PWM1OUT_POSN                               0x5
#define _PWM1CON_PWM1OUT_POSITION                           0x5
#define _PWM1CON_PWM1OUT_SIZE                               0x1
#define _PWM1CON_PWM1OUT_LENGTH                             0x1
#define _PWM1CON_PWM1OUT_MASK                               0x20
#define _PWM1CON_PWM1OE_POSN                                0x6
#define _PWM1CON_PWM1OE_POSITION                            0x6
#define _PWM1CON_PWM1OE_SIZE                                0x1
#define _PWM1CON_PWM1OE_LENGTH                              0x1
#define _PWM1CON_PWM1OE_MASK                                0x40
#define _PWM1CON_PWM1EN_POSN                                0x7
#define _PWM1CON_PWM1EN_POSITION                            0x7
#define _PWM1CON_PWM1EN_SIZE                                0x1
#define _PWM1CON_PWM1EN_LENGTH                              0x1
#define _PWM1CON_PWM1EN_MASK                                0x80
#define _PWM1CON_MODE0_POSN                                 0x2
#define _PWM1CON_MODE0_POSITION                             0x2
#define _PWM1CON_MODE0_SIZE                                 0x1
#define _PWM1CON_MODE0_LENGTH                               0x1
#define _PWM1CON_MODE0_MASK                                 0x4
#define _PWM1CON_MODE1_POSN                                 0x3
#define _PWM1CON_MODE1_POSITION                             0x3
#define _PWM1CON_MODE1_SIZE                                 0x1
#define _PWM1CON_MODE1_LENGTH                               0x1
#define _PWM1CON_MODE1_MASK                                 0x8

// Register: PWM1INTE
#define PWM1INTE PWM1INTE
extern volatile unsigned char           PWM1INTE            @ 0xD9C;
#ifndef _LIB_BUILD
asm("PWM1INTE equ 0D9Ch");
#endif
// aliases
extern volatile unsigned char           PWM1INTCON          @ 0xD9C;
#ifndef _LIB_BUILD
asm("PWM1INTCON equ 0D9Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM1PRIE               :1;
        unsigned PWM1DCIE               :1;
        unsigned PWM1PHIE               :1;
        unsigned PWM1OFIE               :1;
    };
} PWM1INTEbits_t;
extern volatile PWM1INTEbits_t PWM1INTEbits @ 0xD9C;
// bitfield macros
#define _PWM1INTE_PRIE_POSN                                 0x0
#define _PWM1INTE_PRIE_POSITION                             0x0
#define _PWM1INTE_PRIE_SIZE                                 0x1
#define _PWM1INTE_PRIE_LENGTH                               0x1
#define _PWM1INTE_PRIE_MASK                                 0x1
#define _PWM1INTE_DCIE_POSN                                 0x1
#define _PWM1INTE_DCIE_POSITION                             0x1
#define _PWM1INTE_DCIE_SIZE                                 0x1
#define _PWM1INTE_DCIE_LENGTH                               0x1
#define _PWM1INTE_DCIE_MASK                                 0x2
#define _PWM1INTE_PHIE_POSN                                 0x2
#define _PWM1INTE_PHIE_POSITION                             0x2
#define _PWM1INTE_PHIE_SIZE                                 0x1
#define _PWM1INTE_PHIE_LENGTH                               0x1
#define _PWM1INTE_PHIE_MASK                                 0x4
#define _PWM1INTE_OFIE_POSN                                 0x3
#define _PWM1INTE_OFIE_POSITION                             0x3
#define _PWM1INTE_OFIE_SIZE                                 0x1
#define _PWM1INTE_OFIE_LENGTH                               0x1
#define _PWM1INTE_OFIE_MASK                                 0x8
#define _PWM1INTE_PWM1PRIE_POSN                             0x0
#define _PWM1INTE_PWM1PRIE_POSITION                         0x0
#define _PWM1INTE_PWM1PRIE_SIZE                             0x1
#define _PWM1INTE_PWM1PRIE_LENGTH                           0x1
#define _PWM1INTE_PWM1PRIE_MASK                             0x1
#define _PWM1INTE_PWM1DCIE_POSN                             0x1
#define _PWM1INTE_PWM1DCIE_POSITION                         0x1
#define _PWM1INTE_PWM1DCIE_SIZE                             0x1
#define _PWM1INTE_PWM1DCIE_LENGTH                           0x1
#define _PWM1INTE_PWM1DCIE_MASK                             0x2
#define _PWM1INTE_PWM1PHIE_POSN                             0x2
#define _PWM1INTE_PWM1PHIE_POSITION                         0x2
#define _PWM1INTE_PWM1PHIE_SIZE                             0x1
#define _PWM1INTE_PWM1PHIE_LENGTH                           0x1
#define _PWM1INTE_PWM1PHIE_MASK                             0x4
#define _PWM1INTE_PWM1OFIE_POSN                             0x3
#define _PWM1INTE_PWM1OFIE_POSITION                         0x3
#define _PWM1INTE_PWM1OFIE_SIZE                             0x1
#define _PWM1INTE_PWM1OFIE_LENGTH                           0x1
#define _PWM1INTE_PWM1OFIE_MASK                             0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM1PRIE               :1;
        unsigned PWM1DCIE               :1;
        unsigned PWM1PHIE               :1;
        unsigned PWM1OFIE               :1;
    };
} PWM1INTCONbits_t;
