daviskung/PIC16F1579_HM.X_2019_0524/mcc_generated_files/pic16f1579_ref.h
extern volatile PWM1INTCONbits_t PWM1INTCONbits @ 0xD9C;
// bitfield macros
#define _PWM1INTCON_PRIE_POSN                               0x0
#define _PWM1INTCON_PRIE_POSITION                           0x0
#define _PWM1INTCON_PRIE_SIZE                               0x1
#define _PWM1INTCON_PRIE_LENGTH                             0x1
#define _PWM1INTCON_PRIE_MASK                               0x1
#define _PWM1INTCON_DCIE_POSN                               0x1
#define _PWM1INTCON_DCIE_POSITION                           0x1
#define _PWM1INTCON_DCIE_SIZE                               0x1
#define _PWM1INTCON_DCIE_LENGTH                             0x1
#define _PWM1INTCON_DCIE_MASK                               0x2
#define _PWM1INTCON_PHIE_POSN                               0x2
#define _PWM1INTCON_PHIE_POSITION                           0x2
#define _PWM1INTCON_PHIE_SIZE                               0x1
#define _PWM1INTCON_PHIE_LENGTH                             0x1
#define _PWM1INTCON_PHIE_MASK                               0x4
#define _PWM1INTCON_OFIE_POSN                               0x3
#define _PWM1INTCON_OFIE_POSITION                           0x3
#define _PWM1INTCON_OFIE_SIZE                               0x1
#define _PWM1INTCON_OFIE_LENGTH                             0x1
#define _PWM1INTCON_OFIE_MASK                               0x8
#define _PWM1INTCON_PWM1PRIE_POSN                           0x0
#define _PWM1INTCON_PWM1PRIE_POSITION                       0x0
#define _PWM1INTCON_PWM1PRIE_SIZE                           0x1
#define _PWM1INTCON_PWM1PRIE_LENGTH                         0x1
#define _PWM1INTCON_PWM1PRIE_MASK                           0x1
#define _PWM1INTCON_PWM1DCIE_POSN                           0x1
#define _PWM1INTCON_PWM1DCIE_POSITION                       0x1
#define _PWM1INTCON_PWM1DCIE_SIZE                           0x1
#define _PWM1INTCON_PWM1DCIE_LENGTH                         0x1
#define _PWM1INTCON_PWM1DCIE_MASK                           0x2
#define _PWM1INTCON_PWM1PHIE_POSN                           0x2
#define _PWM1INTCON_PWM1PHIE_POSITION                       0x2
#define _PWM1INTCON_PWM1PHIE_SIZE                           0x1
#define _PWM1INTCON_PWM1PHIE_LENGTH                         0x1
#define _PWM1INTCON_PWM1PHIE_MASK                           0x4
#define _PWM1INTCON_PWM1OFIE_POSN                           0x3
#define _PWM1INTCON_PWM1OFIE_POSITION                       0x3
#define _PWM1INTCON_PWM1OFIE_SIZE                           0x1
#define _PWM1INTCON_PWM1OFIE_LENGTH                         0x1
#define _PWM1INTCON_PWM1OFIE_MASK                           0x8

// Register: PWM1INTF
#define PWM1INTF PWM1INTF
extern volatile unsigned char           PWM1INTF            @ 0xD9D;
#ifndef _LIB_BUILD
asm("PWM1INTF equ 0D9Dh");
#endif
// aliases
extern volatile unsigned char           PWM1INTFLG          @ 0xD9D;
#ifndef _LIB_BUILD
asm("PWM1INTFLG equ 0D9Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM1PRIF               :1;
        unsigned PWM1DCIF               :1;
        unsigned PWM1PHIF               :1;
        unsigned PWM1OFIF               :1;
    };
} PWM1INTFbits_t;
extern volatile PWM1INTFbits_t PWM1INTFbits @ 0xD9D;
// bitfield macros
#define _PWM1INTF_PRIF_POSN                                 0x0
#define _PWM1INTF_PRIF_POSITION                             0x0
#define _PWM1INTF_PRIF_SIZE                                 0x1
#define _PWM1INTF_PRIF_LENGTH                               0x1
#define _PWM1INTF_PRIF_MASK                                 0x1
#define _PWM1INTF_DCIF_POSN                                 0x1
#define _PWM1INTF_DCIF_POSITION                             0x1
#define _PWM1INTF_DCIF_SIZE                                 0x1
#define _PWM1INTF_DCIF_LENGTH                               0x1
#define _PWM1INTF_DCIF_MASK                                 0x2
#define _PWM1INTF_PHIF_POSN                                 0x2
#define _PWM1INTF_PHIF_POSITION                             0x2
#define _PWM1INTF_PHIF_SIZE                                 0x1
#define _PWM1INTF_PHIF_LENGTH                               0x1
#define _PWM1INTF_PHIF_MASK                                 0x4
#define _PWM1INTF_OFIF_POSN                                 0x3
#define _PWM1INTF_OFIF_POSITION                             0x3
#define _PWM1INTF_OFIF_SIZE                                 0x1
#define _PWM1INTF_OFIF_LENGTH                               0x1
#define _PWM1INTF_OFIF_MASK                                 0x8
#define _PWM1INTF_PWM1PRIF_POSN                             0x0
#define _PWM1INTF_PWM1PRIF_POSITION                         0x0
#define _PWM1INTF_PWM1PRIF_SIZE                             0x1
#define _PWM1INTF_PWM1PRIF_LENGTH                           0x1
#define _PWM1INTF_PWM1PRIF_MASK                             0x1
#define _PWM1INTF_PWM1DCIF_POSN                             0x1
#define _PWM1INTF_PWM1DCIF_POSITION                         0x1
#define _PWM1INTF_PWM1DCIF_SIZE                             0x1
#define _PWM1INTF_PWM1DCIF_LENGTH                           0x1
#define _PWM1INTF_PWM1DCIF_MASK                             0x2
#define _PWM1INTF_PWM1PHIF_POSN                             0x2
#define _PWM1INTF_PWM1PHIF_POSITION                         0x2
#define _PWM1INTF_PWM1PHIF_SIZE                             0x1
#define _PWM1INTF_PWM1PHIF_LENGTH                           0x1
#define _PWM1INTF_PWM1PHIF_MASK                             0x4
#define _PWM1INTF_PWM1OFIF_POSN                             0x3
#define _PWM1INTF_PWM1OFIF_POSITION                         0x3
#define _PWM1INTF_PWM1OFIF_SIZE                             0x1
#define _PWM1INTF_PWM1OFIF_LENGTH                           0x1
#define _PWM1INTF_PWM1OFIF_MASK                             0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM1PRIF               :1;
        unsigned PWM1DCIF               :1;
        unsigned PWM1PHIF               :1;
        unsigned PWM1OFIF               :1;
    };
} PWM1INTFLGbits_t;
extern volatile PWM1INTFLGbits_t PWM1INTFLGbits @ 0xD9D;
// bitfield macros
#define _PWM1INTFLG_PRIF_POSN                               0x0
#define _PWM1INTFLG_PRIF_POSITION                           0x0
#define _PWM1INTFLG_PRIF_SIZE                               0x1
#define _PWM1INTFLG_PRIF_LENGTH                             0x1
#define _PWM1INTFLG_PRIF_MASK                               0x1
#define _PWM1INTFLG_DCIF_POSN                               0x1
#define _PWM1INTFLG_DCIF_POSITION                           0x1
#define _PWM1INTFLG_DCIF_SIZE                               0x1
#define _PWM1INTFLG_DCIF_LENGTH                             0x1
#define _PWM1INTFLG_DCIF_MASK                               0x2
#define _PWM1INTFLG_PHIF_POSN                               0x2
#define _PWM1INTFLG_PHIF_POSITION                           0x2
#define _PWM1INTFLG_PHIF_SIZE                               0x1
#define _PWM1INTFLG_PHIF_LENGTH                             0x1
#define _PWM1INTFLG_PHIF_MASK                               0x4
#define _PWM1INTFLG_OFIF_POSN                               0x3
#define _PWM1INTFLG_OFIF_POSITION                           0x3
#define _PWM1INTFLG_OFIF_SIZE                               0x1
#define _PWM1INTFLG_OFIF_LENGTH                             0x1
#define _PWM1INTFLG_OFIF_MASK                               0x8
#define _PWM1INTFLG_PWM1PRIF_POSN                           0x0
#define _PWM1INTFLG_PWM1PRIF_POSITION                       0x0
#define _PWM1INTFLG_PWM1PRIF_SIZE                           0x1
#define _PWM1INTFLG_PWM1PRIF_LENGTH                         0x1
#define _PWM1INTFLG_PWM1PRIF_MASK                           0x1
#define _PWM1INTFLG_PWM1DCIF_POSN                           0x1
#define _PWM1INTFLG_PWM1DCIF_POSITION                       0x1
#define _PWM1INTFLG_PWM1DCIF_SIZE                           0x1
#define _PWM1INTFLG_PWM1DCIF_LENGTH                         0x1
#define _PWM1INTFLG_PWM1DCIF_MASK                           0x2
#define _PWM1INTFLG_PWM1PHIF_POSN                           0x2
#define _PWM1INTFLG_PWM1PHIF_POSITION                       0x2
#define _PWM1INTFLG_PWM1PHIF_SIZE                           0x1
#define _PWM1INTFLG_PWM1PHIF_LENGTH                         0x1
#define _PWM1INTFLG_PWM1PHIF_MASK                           0x4
#define _PWM1INTFLG_PWM1OFIF_POSN                           0x3
#define _PWM1INTFLG_PWM1OFIF_POSITION                       0x3
#define _PWM1INTFLG_PWM1OFIF_SIZE                           0x1
#define _PWM1INTFLG_PWM1OFIF_LENGTH                         0x1
#define _PWM1INTFLG_PWM1OFIF_MASK                           0x8

// Register: PWM1CLKCON
#define PWM1CLKCON PWM1CLKCON
extern volatile unsigned char           PWM1CLKCON          @ 0xD9E;
#ifndef _LIB_BUILD
asm("PWM1CLKCON equ 0D9Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :2;
        unsigned                        :2;
        unsigned PS                     :3;
    };
    struct {
        unsigned PWM1CS0                :1;
        unsigned PWM1CS1                :1;
        unsigned                        :2;
        unsigned PWM1PS0                :1;
        unsigned PWM1PS1                :1;
        unsigned PWM1PS2                :1;
    };
    struct {
        unsigned PWM1CS                 :3;
        unsigned                        :1;
        unsigned PWM1PS                 :3;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned                        :2;
        unsigned PS0                    :1;
        unsigned PS1                    :1;
        unsigned PS2                    :1;
    };
} PWM1CLKCONbits_t;
extern volatile PWM1CLKCONbits_t PWM1CLKCONbits @ 0xD9E;
// bitfield macros
#define _PWM1CLKCON_CS_POSN                                 0x0
#define _PWM1CLKCON_CS_POSITION                             0x0
#define _PWM1CLKCON_CS_SIZE                                 0x2
#define _PWM1CLKCON_CS_LENGTH                               0x2
#define _PWM1CLKCON_CS_MASK                                 0x3
#define _PWM1CLKCON_PS_POSN                                 0x4
#define _PWM1CLKCON_PS_POSITION                             0x4
#define _PWM1CLKCON_PS_SIZE                                 0x3
#define _PWM1CLKCON_PS_LENGTH                               0x3
#define _PWM1CLKCON_PS_MASK                                 0x70
#define _PWM1CLKCON_PWM1CS0_POSN                            0x0
#define _PWM1CLKCON_PWM1CS0_POSITION                        0x0
#define _PWM1CLKCON_PWM1CS0_SIZE                            0x1
#define _PWM1CLKCON_PWM1CS0_LENGTH                          0x1
#define _PWM1CLKCON_PWM1CS0_MASK                            0x1
#define _PWM1CLKCON_PWM1CS1_POSN                            0x1
#define _PWM1CLKCON_PWM1CS1_POSITION                        0x1
#define _PWM1CLKCON_PWM1CS1_SIZE                            0x1
#define _PWM1CLKCON_PWM1CS1_LENGTH                          0x1
#define _PWM1CLKCON_PWM1CS1_MASK                            0x2
#define _PWM1CLKCON_PWM1PS0_POSN                            0x4
#define _PWM1CLKCON_PWM1PS0_POSITION                        0x4
#define _PWM1CLKCON_PWM1PS0_SIZE                            0x1
#define _PWM1CLKCON_PWM1PS0_LENGTH                          0x1
#define _PWM1CLKCON_PWM1PS0_MASK                            0x10
#define _PWM1CLKCON_PWM1PS1_POSN                            0x5
#define _PWM1CLKCON_PWM1PS1_POSITION                        0x5
#define _PWM1CLKCON_PWM1PS1_SIZE                            0x1
#define _PWM1CLKCON_PWM1PS1_LENGTH                          0x1
#define _PWM1CLKCON_PWM1PS1_MASK                            0x20
#define _PWM1CLKCON_PWM1PS2_POSN                            0x6
#define _PWM1CLKCON_PWM1PS2_POSITION                        0x6
#define _PWM1CLKCON_PWM1PS2_SIZE                            0x1
#define _PWM1CLKCON_PWM1PS2_LENGTH                          0x1
#define _PWM1CLKCON_PWM1PS2_MASK                            0x40
#define _PWM1CLKCON_PWM1CS_POSN                             0x0
#define _PWM1CLKCON_PWM1CS_POSITION                         0x0
#define _PWM1CLKCON_PWM1CS_SIZE                             0x3
#define _PWM1CLKCON_PWM1CS_LENGTH                           0x3
#define _PWM1CLKCON_PWM1CS_MASK                             0x7
#define _PWM1CLKCON_PWM1PS_POSN                             0x4
#define _PWM1CLKCON_PWM1PS_POSITION                         0x4
#define _PWM1CLKCON_PWM1PS_SIZE                             0x3
#define _PWM1CLKCON_PWM1PS_LENGTH                           0x3
#define _PWM1CLKCON_PWM1PS_MASK                             0x70
#define _PWM1CLKCON_CS0_POSN                                0x0
#define _PWM1CLKCON_CS0_POSITION                            0x0
#define _PWM1CLKCON_CS0_SIZE                                0x1
#define _PWM1CLKCON_CS0_LENGTH                              0x1
#define _PWM1CLKCON_CS0_MASK                                0x1
#define _PWM1CLKCON_CS1_POSN                                0x1
#define _PWM1CLKCON_CS1_POSITION                            0x1
#define _PWM1CLKCON_CS1_SIZE                                0x1
#define _PWM1CLKCON_CS1_LENGTH                              0x1
#define _PWM1CLKCON_CS1_MASK                                0x2
#define _PWM1CLKCON_PS0_POSN                                0x4
#define _PWM1CLKCON_PS0_POSITION                            0x4
#define _PWM1CLKCON_PS0_SIZE                                0x1
#define _PWM1CLKCON_PS0_LENGTH                              0x1
#define _PWM1CLKCON_PS0_MASK                                0x10
#define _PWM1CLKCON_PS1_POSN                                0x5
#define _PWM1CLKCON_PS1_POSITION                            0x5
#define _PWM1CLKCON_PS1_SIZE                                0x1
#define _PWM1CLKCON_PS1_LENGTH                              0x1
#define _PWM1CLKCON_PS1_MASK                                0x20
#define _PWM1CLKCON_PS2_POSN                                0x6
#define _PWM1CLKCON_PS2_POSITION                            0x6
#define _PWM1CLKCON_PS2_SIZE                                0x1
#define _PWM1CLKCON_PS2_LENGTH                              0x1
#define _PWM1CLKCON_PS2_MASK                                0x40

// Register: PWM1LDCON
#define PWM1LDCON PWM1LDCON
extern volatile unsigned char           PWM1LDCON           @ 0xD9F;
#ifndef _LIB_BUILD
asm("PWM1LDCON equ 0D9Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :2;
        unsigned                        :4;
        unsigned LDT                    :1;
        unsigned LDA                    :1;
    };
    struct {
        unsigned PWM1LDS0               :1;
        unsigned PWM1LDS1               :1;
    };
    struct {
        unsigned PWM1LDS                :2;
        unsigned                        :4;
        unsigned PWM1LDM                :1;
        unsigned PWM1LD                 :1;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
    };
} PWM1LDCONbits_t;
extern volatile PWM1LDCONbits_t PWM1LDCONbits @ 0xD9F;
// bitfield macros
#define _PWM1LDCON_LDS_POSN                                 0x0
#define _PWM1LDCON_LDS_POSITION                             0x0
#define _PWM1LDCON_LDS_SIZE                                 0x2
#define _PWM1LDCON_LDS_LENGTH                               0x2
#define _PWM1LDCON_LDS_MASK                                 0x3
#define _PWM1LDCON_LDT_POSN                                 0x6
#define _PWM1LDCON_LDT_POSITION                             0x6
#define _PWM1LDCON_LDT_SIZE                                 0x1
#define _PWM1LDCON_LDT_LENGTH                               0x1
#define _PWM1LDCON_LDT_MASK                                 0x40
#define _PWM1LDCON_LDA_POSN                                 0x7
#define _PWM1LDCON_LDA_POSITION                             0x7
#define _PWM1LDCON_LDA_SIZE                                 0x1
#define _PWM1LDCON_LDA_LENGTH                               0x1
#define _PWM1LDCON_LDA_MASK                                 0x80
#define _PWM1LDCON_PWM1LDS0_POSN                            0x0
#define _PWM1LDCON_PWM1LDS0_POSITION                        0x0
#define _PWM1LDCON_PWM1LDS0_SIZE                            0x1
#define _PWM1LDCON_PWM1LDS0_LENGTH                          0x1
#define _PWM1LDCON_PWM1LDS0_MASK                            0x1
#define _PWM1LDCON_PWM1LDS1_POSN                            0x1
#define _PWM1LDCON_PWM1LDS1_POSITION                        0x1
#define _PWM1LDCON_PWM1LDS1_SIZE                            0x1
#define _PWM1LDCON_PWM1LDS1_LENGTH                          0x1
#define _PWM1LDCON_PWM1LDS1_MASK                            0x2
#define _PWM1LDCON_PWM1LDS_POSN                             0x0
#define _PWM1LDCON_PWM1LDS_POSITION                         0x0
#define _PWM1LDCON_PWM1LDS_SIZE                             0x2
#define _PWM1LDCON_PWM1LDS_LENGTH                           0x2
#define _PWM1LDCON_PWM1LDS_MASK                             0x3
#define _PWM1LDCON_PWM1LDM_POSN                             0x6
#define _PWM1LDCON_PWM1LDM_POSITION                         0x6
#define _PWM1LDCON_PWM1LDM_SIZE                             0x1
#define _PWM1LDCON_PWM1LDM_LENGTH                           0x1
#define _PWM1LDCON_PWM1LDM_MASK                             0x40
#define _PWM1LDCON_PWM1LD_POSN                              0x7
#define _PWM1LDCON_PWM1LD_POSITION                          0x7
#define _PWM1LDCON_PWM1LD_SIZE                              0x1
#define _PWM1LDCON_PWM1LD_LENGTH                            0x1
#define _PWM1LDCON_PWM1LD_MASK                              0x80
#define _PWM1LDCON_LDS0_POSN                                0x0
#define _PWM1LDCON_LDS0_POSITION                            0x0
#define _PWM1LDCON_LDS0_SIZE                                0x1
#define _PWM1LDCON_LDS0_LENGTH                              0x1
#define _PWM1LDCON_LDS0_MASK                                0x1
#define _PWM1LDCON_LDS1_POSN                                0x1
#define _PWM1LDCON_LDS1_POSITION                            0x1
#define _PWM1LDCON_LDS1_SIZE                                0x1
#define _PWM1LDCON_LDS1_LENGTH                              0x1
#define _PWM1LDCON_LDS1_MASK                                0x2

// Register: PWM1OFCON
#define PWM1OFCON PWM1OFCON
extern volatile unsigned char           PWM1OFCON           @ 0xDA0;
#ifndef _LIB_BUILD
asm("PWM1OFCON equ 0DA0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OFS                    :2;
        unsigned                        :2;
        unsigned OFO                    :1;
        unsigned OFM                    :2;
    };
    struct {
        unsigned PWM1OFS0               :1;
        unsigned PWM1OFS1               :1;
        unsigned                        :3;
        unsigned PWM1OFM0               :1;
        unsigned PWM1OFM1               :1;
    };
    struct {
        unsigned PWM1OFS                :2;
        unsigned                        :2;
        unsigned PWM1OFMC               :1;
        unsigned PWM1OFM                :2;
    };
    struct {
        unsigned OFS0                   :1;
        unsigned OFS1                   :1;
        unsigned                        :3;
        unsigned OFM0                   :1;
        unsigned OFM1                   :1;
    };
} PWM1OFCONbits_t;
