daviskung/PIC16F1579_HM.X_2019_0524/mcc_generated_files/pic16f1579_ref.h
extern volatile PWM2PHHbits_t PWM2PHHbits @ 0xDA2;
// bitfield macros
#define _PWM2PHH_PH_POSN                                    0x0
#define _PWM2PHH_PH_POSITION                                0x0
#define _PWM2PHH_PH_SIZE                                    0x8
#define _PWM2PHH_PH_LENGTH                                  0x8
#define _PWM2PHH_PH_MASK                                    0xFF
#define _PWM2PHH_PWM2PHH0_POSN                              0x0
#define _PWM2PHH_PWM2PHH0_POSITION                          0x0
#define _PWM2PHH_PWM2PHH0_SIZE                              0x1
#define _PWM2PHH_PWM2PHH0_LENGTH                            0x1
#define _PWM2PHH_PWM2PHH0_MASK                              0x1
#define _PWM2PHH_PWM2PHH1_POSN                              0x1
#define _PWM2PHH_PWM2PHH1_POSITION                          0x1
#define _PWM2PHH_PWM2PHH1_SIZE                              0x1
#define _PWM2PHH_PWM2PHH1_LENGTH                            0x1
#define _PWM2PHH_PWM2PHH1_MASK                              0x2
#define _PWM2PHH_PWM2PHH2_POSN                              0x2
#define _PWM2PHH_PWM2PHH2_POSITION                          0x2
#define _PWM2PHH_PWM2PHH2_SIZE                              0x1
#define _PWM2PHH_PWM2PHH2_LENGTH                            0x1
#define _PWM2PHH_PWM2PHH2_MASK                              0x4
#define _PWM2PHH_PWM2PHH3_POSN                              0x3
#define _PWM2PHH_PWM2PHH3_POSITION                          0x3
#define _PWM2PHH_PWM2PHH3_SIZE                              0x1
#define _PWM2PHH_PWM2PHH3_LENGTH                            0x1
#define _PWM2PHH_PWM2PHH3_MASK                              0x8
#define _PWM2PHH_PWM2PHH4_POSN                              0x4
#define _PWM2PHH_PWM2PHH4_POSITION                          0x4
#define _PWM2PHH_PWM2PHH4_SIZE                              0x1
#define _PWM2PHH_PWM2PHH4_LENGTH                            0x1
#define _PWM2PHH_PWM2PHH4_MASK                              0x10
#define _PWM2PHH_PWM2PHH5_POSN                              0x5
#define _PWM2PHH_PWM2PHH5_POSITION                          0x5
#define _PWM2PHH_PWM2PHH5_SIZE                              0x1
#define _PWM2PHH_PWM2PHH5_LENGTH                            0x1
#define _PWM2PHH_PWM2PHH5_MASK                              0x20
#define _PWM2PHH_PWM2PHH6_POSN                              0x6
#define _PWM2PHH_PWM2PHH6_POSITION                          0x6
#define _PWM2PHH_PWM2PHH6_SIZE                              0x1
#define _PWM2PHH_PWM2PHH6_LENGTH                            0x1
#define _PWM2PHH_PWM2PHH6_MASK                              0x40
#define _PWM2PHH_PWM2PHH7_POSN                              0x7
#define _PWM2PHH_PWM2PHH7_POSITION                          0x7
#define _PWM2PHH_PWM2PHH7_SIZE                              0x1
#define _PWM2PHH_PWM2PHH7_LENGTH                            0x1
#define _PWM2PHH_PWM2PHH7_MASK                              0x80
#define _PWM2PHH_PWM2PHH_POSN                               0x0
#define _PWM2PHH_PWM2PHH_POSITION                           0x0
#define _PWM2PHH_PWM2PHH_SIZE                               0x8
#define _PWM2PHH_PWM2PHH_LENGTH                             0x8
#define _PWM2PHH_PWM2PHH_MASK                               0xFF

// Register: PWM2DC
#define PWM2DC PWM2DC
extern volatile unsigned short          PWM2DC              @ 0xDA3;
#ifndef _LIB_BUILD
asm("PWM2DC equ 0DA3h");
#endif

// Register: PWM2DCL
#define PWM2DCL PWM2DCL
extern volatile unsigned char           PWM2DCL             @ 0xDA3;
#ifndef _LIB_BUILD
asm("PWM2DCL equ 0DA3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned PWM2DCL0               :1;
        unsigned PWM2DCL1               :1;
        unsigned PWM2DCL2               :1;
        unsigned PWM2DCL3               :1;
        unsigned PWM2DCL4               :1;
        unsigned PWM2DCL5               :1;
        unsigned PWM2DCL6               :1;
        unsigned PWM2DCL7               :1;
    };
    struct {
        unsigned PWM2DCL                :8;
    };
} PWM2DCLbits_t;
extern volatile PWM2DCLbits_t PWM2DCLbits @ 0xDA3;
// bitfield macros
#define _PWM2DCL_DC_POSN                                    0x0
#define _PWM2DCL_DC_POSITION                                0x0
#define _PWM2DCL_DC_SIZE                                    0x8
#define _PWM2DCL_DC_LENGTH                                  0x8
#define _PWM2DCL_DC_MASK                                    0xFF
#define _PWM2DCL_PWM2DCL0_POSN                              0x0
#define _PWM2DCL_PWM2DCL0_POSITION                          0x0
#define _PWM2DCL_PWM2DCL0_SIZE                              0x1
#define _PWM2DCL_PWM2DCL0_LENGTH                            0x1
#define _PWM2DCL_PWM2DCL0_MASK                              0x1
#define _PWM2DCL_PWM2DCL1_POSN                              0x1
#define _PWM2DCL_PWM2DCL1_POSITION                          0x1
#define _PWM2DCL_PWM2DCL1_SIZE                              0x1
#define _PWM2DCL_PWM2DCL1_LENGTH                            0x1
#define _PWM2DCL_PWM2DCL1_MASK                              0x2
#define _PWM2DCL_PWM2DCL2_POSN                              0x2
#define _PWM2DCL_PWM2DCL2_POSITION                          0x2
#define _PWM2DCL_PWM2DCL2_SIZE                              0x1
#define _PWM2DCL_PWM2DCL2_LENGTH                            0x1
#define _PWM2DCL_PWM2DCL2_MASK                              0x4
#define _PWM2DCL_PWM2DCL3_POSN                              0x3
#define _PWM2DCL_PWM2DCL3_POSITION                          0x3
#define _PWM2DCL_PWM2DCL3_SIZE                              0x1
#define _PWM2DCL_PWM2DCL3_LENGTH                            0x1
#define _PWM2DCL_PWM2DCL3_MASK                              0x8
#define _PWM2DCL_PWM2DCL4_POSN                              0x4
#define _PWM2DCL_PWM2DCL4_POSITION                          0x4
#define _PWM2DCL_PWM2DCL4_SIZE                              0x1
#define _PWM2DCL_PWM2DCL4_LENGTH                            0x1
#define _PWM2DCL_PWM2DCL4_MASK                              0x10
#define _PWM2DCL_PWM2DCL5_POSN                              0x5
#define _PWM2DCL_PWM2DCL5_POSITION                          0x5
#define _PWM2DCL_PWM2DCL5_SIZE                              0x1
#define _PWM2DCL_PWM2DCL5_LENGTH                            0x1
#define _PWM2DCL_PWM2DCL5_MASK                              0x20
#define _PWM2DCL_PWM2DCL6_POSN                              0x6
#define _PWM2DCL_PWM2DCL6_POSITION                          0x6
#define _PWM2DCL_PWM2DCL6_SIZE                              0x1
#define _PWM2DCL_PWM2DCL6_LENGTH                            0x1
#define _PWM2DCL_PWM2DCL6_MASK                              0x40
#define _PWM2DCL_PWM2DCL7_POSN                              0x7
#define _PWM2DCL_PWM2DCL7_POSITION                          0x7
#define _PWM2DCL_PWM2DCL7_SIZE                              0x1
#define _PWM2DCL_PWM2DCL7_LENGTH                            0x1
#define _PWM2DCL_PWM2DCL7_MASK                              0x80
#define _PWM2DCL_PWM2DCL_POSN                               0x0
#define _PWM2DCL_PWM2DCL_POSITION                           0x0
#define _PWM2DCL_PWM2DCL_SIZE                               0x8
#define _PWM2DCL_PWM2DCL_LENGTH                             0x8
#define _PWM2DCL_PWM2DCL_MASK                               0xFF

