daviskung/PIC16F1579_HM.X_2019_0524/mcc_generated_files/pic16f1579_ref.h
// Register: PWM2OFCON
#define PWM2OFCON PWM2OFCON
extern volatile unsigned char           PWM2OFCON           @ 0xDB0;
#ifndef _LIB_BUILD
asm("PWM2OFCON equ 0DB0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OFS                    :2;
        unsigned                        :2;
        unsigned OFO                    :1;
        unsigned OFM                    :2;
    };
    struct {
        unsigned PWM2OFS0               :1;
        unsigned PWM2OFS1               :1;
        unsigned                        :3;
        unsigned PWM2OFM0               :1;
        unsigned PWM2OFM1               :1;
    };
    struct {
        unsigned PWM2OFS                :2;
        unsigned                        :2;
        unsigned PWM2OFMC               :1;
        unsigned PWM2OFM                :2;
    };
    struct {
        unsigned OFS0                   :1;
        unsigned OFS1                   :1;
        unsigned                        :3;
        unsigned OFM0                   :1;
        unsigned OFM1                   :1;
    };
} PWM2OFCONbits_t;
extern volatile PWM2OFCONbits_t PWM2OFCONbits @ 0xDB0;
// bitfield macros
#define _PWM2OFCON_OFS_POSN                                 0x0
#define _PWM2OFCON_OFS_POSITION                             0x0
#define _PWM2OFCON_OFS_SIZE                                 0x2
#define _PWM2OFCON_OFS_LENGTH                               0x2
#define _PWM2OFCON_OFS_MASK                                 0x3
#define _PWM2OFCON_OFO_POSN                                 0x4
#define _PWM2OFCON_OFO_POSITION                             0x4
#define _PWM2OFCON_OFO_SIZE                                 0x1
#define _PWM2OFCON_OFO_LENGTH                               0x1
#define _PWM2OFCON_OFO_MASK                                 0x10
#define _PWM2OFCON_OFM_POSN                                 0x5
#define _PWM2OFCON_OFM_POSITION                             0x5
#define _PWM2OFCON_OFM_SIZE                                 0x2
#define _PWM2OFCON_OFM_LENGTH                               0x2
#define _PWM2OFCON_OFM_MASK                                 0x60
#define _PWM2OFCON_PWM2OFS0_POSN                            0x0
#define _PWM2OFCON_PWM2OFS0_POSITION                        0x0
#define _PWM2OFCON_PWM2OFS0_SIZE                            0x1
#define _PWM2OFCON_PWM2OFS0_LENGTH                          0x1
#define _PWM2OFCON_PWM2OFS0_MASK                            0x1
#define _PWM2OFCON_PWM2OFS1_POSN                            0x1
#define _PWM2OFCON_PWM2OFS1_POSITION                        0x1
#define _PWM2OFCON_PWM2OFS1_SIZE                            0x1
#define _PWM2OFCON_PWM2OFS1_LENGTH                          0x1
#define _PWM2OFCON_PWM2OFS1_MASK                            0x2
#define _PWM2OFCON_PWM2OFM0_POSN                            0x5
#define _PWM2OFCON_PWM2OFM0_POSITION                        0x5
#define _PWM2OFCON_PWM2OFM0_SIZE                            0x1
#define _PWM2OFCON_PWM2OFM0_LENGTH                          0x1
#define _PWM2OFCON_PWM2OFM0_MASK                            0x20
#define _PWM2OFCON_PWM2OFM1_POSN                            0x6
#define _PWM2OFCON_PWM2OFM1_POSITION                        0x6
#define _PWM2OFCON_PWM2OFM1_SIZE                            0x1
#define _PWM2OFCON_PWM2OFM1_LENGTH                          0x1
#define _PWM2OFCON_PWM2OFM1_MASK                            0x40
#define _PWM2OFCON_PWM2OFS_POSN                             0x0
#define _PWM2OFCON_PWM2OFS_POSITION                         0x0
#define _PWM2OFCON_PWM2OFS_SIZE                             0x2
#define _PWM2OFCON_PWM2OFS_LENGTH                           0x2
#define _PWM2OFCON_PWM2OFS_MASK                             0x3
#define _PWM2OFCON_PWM2OFMC_POSN                            0x4
#define _PWM2OFCON_PWM2OFMC_POSITION                        0x4
#define _PWM2OFCON_PWM2OFMC_SIZE                            0x1
#define _PWM2OFCON_PWM2OFMC_LENGTH                          0x1
#define _PWM2OFCON_PWM2OFMC_MASK                            0x10
#define _PWM2OFCON_PWM2OFM_POSN                             0x5
#define _PWM2OFCON_PWM2OFM_POSITION                         0x5
#define _PWM2OFCON_PWM2OFM_SIZE                             0x2
#define _PWM2OFCON_PWM2OFM_LENGTH                           0x2
#define _PWM2OFCON_PWM2OFM_MASK                             0x60
#define _PWM2OFCON_OFS0_POSN                                0x0
#define _PWM2OFCON_OFS0_POSITION                            0x0
#define _PWM2OFCON_OFS0_SIZE                                0x1
#define _PWM2OFCON_OFS0_LENGTH                              0x1
#define _PWM2OFCON_OFS0_MASK                                0x1
#define _PWM2OFCON_OFS1_POSN                                0x1
#define _PWM2OFCON_OFS1_POSITION                            0x1
#define _PWM2OFCON_OFS1_SIZE                                0x1
#define _PWM2OFCON_OFS1_LENGTH                              0x1
#define _PWM2OFCON_OFS1_MASK                                0x2
#define _PWM2OFCON_OFM0_POSN                                0x5
#define _PWM2OFCON_OFM0_POSITION                            0x5
#define _PWM2OFCON_OFM0_SIZE                                0x1
#define _PWM2OFCON_OFM0_LENGTH                              0x1
#define _PWM2OFCON_OFM0_MASK                                0x20
#define _PWM2OFCON_OFM1_POSN                                0x6
#define _PWM2OFCON_OFM1_POSITION                            0x6
#define _PWM2OFCON_OFM1_SIZE                                0x1
#define _PWM2OFCON_OFM1_LENGTH                              0x1
#define _PWM2OFCON_OFM1_MASK                                0x40

// Register: PWM3PH
#define PWM3PH PWM3PH
extern volatile unsigned short          PWM3PH              @ 0xDB1;
#ifndef _LIB_BUILD
asm("PWM3PH equ 0DB1h");
#endif

// Register: PWM3PHL
#define PWM3PHL PWM3PHL
extern volatile unsigned char           PWM3PHL             @ 0xDB1;
#ifndef _LIB_BUILD
asm("PWM3PHL equ 0DB1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM3PHL0               :1;
        unsigned PWM3PHL1               :1;
        unsigned PWM3PHL2               :1;
        unsigned PWM3PHL3               :1;
        unsigned PWM3PHL4               :1;
        unsigned PWM3PHL5               :1;
        unsigned PWM3PHL6               :1;
        unsigned PWM3PHL7               :1;
    };
    struct {
        unsigned PWM3PHL                :8;
    };
} PWM3PHLbits_t;
extern volatile PWM3PHLbits_t PWM3PHLbits @ 0xDB1;
// bitfield macros
#define _PWM3PHL_PH_POSN                                    0x0
#define _PWM3PHL_PH_POSITION                                0x0
#define _PWM3PHL_PH_SIZE                                    0x8
#define _PWM3PHL_PH_LENGTH                                  0x8
#define _PWM3PHL_PH_MASK                                    0xFF
#define _PWM3PHL_PWM3PHL0_POSN                              0x0
#define _PWM3PHL_PWM3PHL0_POSITION                          0x0
#define _PWM3PHL_PWM3PHL0_SIZE                              0x1
#define _PWM3PHL_PWM3PHL0_LENGTH                            0x1
#define _PWM3PHL_PWM3PHL0_MASK                              0x1
#define _PWM3PHL_PWM3PHL1_POSN                              0x1
#define _PWM3PHL_PWM3PHL1_POSITION                          0x1
#define _PWM3PHL_PWM3PHL1_SIZE                              0x1
#define _PWM3PHL_PWM3PHL1_LENGTH                            0x1
#define _PWM3PHL_PWM3PHL1_MASK                              0x2
#define _PWM3PHL_PWM3PHL2_POSN                              0x2
#define _PWM3PHL_PWM3PHL2_POSITION                          0x2
#define _PWM3PHL_PWM3PHL2_SIZE                              0x1
#define _PWM3PHL_PWM3PHL2_LENGTH                            0x1
#define _PWM3PHL_PWM3PHL2_MASK                              0x4
#define _PWM3PHL_PWM3PHL3_POSN                              0x3
#define _PWM3PHL_PWM3PHL3_POSITION                          0x3
#define _PWM3PHL_PWM3PHL3_SIZE                              0x1
#define _PWM3PHL_PWM3PHL3_LENGTH                            0x1
#define _PWM3PHL_PWM3PHL3_MASK                              0x8
#define _PWM3PHL_PWM3PHL4_POSN                              0x4
#define _PWM3PHL_PWM3PHL4_POSITION                          0x4
#define _PWM3PHL_PWM3PHL4_SIZE                              0x1
#define _PWM3PHL_PWM3PHL4_LENGTH                            0x1
#define _PWM3PHL_PWM3PHL4_MASK                              0x10
#define _PWM3PHL_PWM3PHL5_POSN                              0x5
#define _PWM3PHL_PWM3PHL5_POSITION                          0x5
#define _PWM3PHL_PWM3PHL5_SIZE                              0x1
#define _PWM3PHL_PWM3PHL5_LENGTH                            0x1
#define _PWM3PHL_PWM3PHL5_MASK                              0x20
#define _PWM3PHL_PWM3PHL6_POSN                              0x6
#define _PWM3PHL_PWM3PHL6_POSITION                          0x6
#define _PWM3PHL_PWM3PHL6_SIZE                              0x1
#define _PWM3PHL_PWM3PHL6_LENGTH                            0x1
#define _PWM3PHL_PWM3PHL6_MASK                              0x40
#define _PWM3PHL_PWM3PHL7_POSN                              0x7
#define _PWM3PHL_PWM3PHL7_POSITION                          0x7
#define _PWM3PHL_PWM3PHL7_SIZE                              0x1
#define _PWM3PHL_PWM3PHL7_LENGTH                            0x1
#define _PWM3PHL_PWM3PHL7_MASK                              0x80
#define _PWM3PHL_PWM3PHL_POSN                               0x0
#define _PWM3PHL_PWM3PHL_POSITION                           0x0
#define _PWM3PHL_PWM3PHL_SIZE                               0x8
#define _PWM3PHL_PWM3PHL_LENGTH                             0x8
#define _PWM3PHL_PWM3PHL_MASK                               0xFF

// Register: PWM3PHH
#define PWM3PHH PWM3PHH
extern volatile unsigned char           PWM3PHH             @ 0xDB2;
#ifndef _LIB_BUILD
asm("PWM3PHH equ 0DB2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM3PHH0               :1;
        unsigned PWM3PHH1               :1;
        unsigned PWM3PHH2               :1;
        unsigned PWM3PHH3               :1;
        unsigned PWM3PHH4               :1;
        unsigned PWM3PHH5               :1;
        unsigned PWM3PHH6               :1;
        unsigned PWM3PHH7               :1;
    };
    struct {
        unsigned PWM3PHH                :8;
    };
} PWM3PHHbits_t;
extern volatile PWM3PHHbits_t PWM3PHHbits @ 0xDB2;
// bitfield macros
#define _PWM3PHH_PH_POSN                                    0x0
#define _PWM3PHH_PH_POSITION                                0x0
#define _PWM3PHH_PH_SIZE                                    0x8
#define _PWM3PHH_PH_LENGTH                                  0x8
#define _PWM3PHH_PH_MASK                                    0xFF
#define _PWM3PHH_PWM3PHH0_POSN                              0x0
#define _PWM3PHH_PWM3PHH0_POSITION                          0x0
#define _PWM3PHH_PWM3PHH0_SIZE                              0x1
#define _PWM3PHH_PWM3PHH0_LENGTH                            0x1
#define _PWM3PHH_PWM3PHH0_MASK                              0x1
#define _PWM3PHH_PWM3PHH1_POSN                              0x1
#define _PWM3PHH_PWM3PHH1_POSITION                          0x1
#define _PWM3PHH_PWM3PHH1_SIZE                              0x1
#define _PWM3PHH_PWM3PHH1_LENGTH                            0x1
#define _PWM3PHH_PWM3PHH1_MASK                              0x2
#define _PWM3PHH_PWM3PHH2_POSN                              0x2
#define _PWM3PHH_PWM3PHH2_POSITION                          0x2
#define _PWM3PHH_PWM3PHH2_SIZE                              0x1
#define _PWM3PHH_PWM3PHH2_LENGTH                            0x1
#define _PWM3PHH_PWM3PHH2_MASK                              0x4
#define _PWM3PHH_PWM3PHH3_POSN                              0x3
#define _PWM3PHH_PWM3PHH3_POSITION                          0x3
#define _PWM3PHH_PWM3PHH3_SIZE                              0x1
#define _PWM3PHH_PWM3PHH3_LENGTH                            0x1
#define _PWM3PHH_PWM3PHH3_MASK                              0x8
#define _PWM3PHH_PWM3PHH4_POSN                              0x4
#define _PWM3PHH_PWM3PHH4_POSITION                          0x4
#define _PWM3PHH_PWM3PHH4_SIZE                              0x1
#define _PWM3PHH_PWM3PHH4_LENGTH                            0x1
#define _PWM3PHH_PWM3PHH4_MASK                              0x10
#define _PWM3PHH_PWM3PHH5_POSN                              0x5
#define _PWM3PHH_PWM3PHH5_POSITION                          0x5
#define _PWM3PHH_PWM3PHH5_SIZE                              0x1
#define _PWM3PHH_PWM3PHH5_LENGTH                            0x1
#define _PWM3PHH_PWM3PHH5_MASK                              0x20
#define _PWM3PHH_PWM3PHH6_POSN                              0x6
#define _PWM3PHH_PWM3PHH6_POSITION                          0x6
#define _PWM3PHH_PWM3PHH6_SIZE                              0x1
#define _PWM3PHH_PWM3PHH6_LENGTH                            0x1
#define _PWM3PHH_PWM3PHH6_MASK                              0x40
#define _PWM3PHH_PWM3PHH7_POSN                              0x7
#define _PWM3PHH_PWM3PHH7_POSITION                          0x7
#define _PWM3PHH_PWM3PHH7_SIZE                              0x1
#define _PWM3PHH_PWM3PHH7_LENGTH                            0x1
#define _PWM3PHH_PWM3PHH7_MASK                              0x80
#define _PWM3PHH_PWM3PHH_POSN                               0x0
#define _PWM3PHH_PWM3PHH_POSITION                           0x0
#define _PWM3PHH_PWM3PHH_SIZE                               0x8
#define _PWM3PHH_PWM3PHH_LENGTH                             0x8
#define _PWM3PHH_PWM3PHH_MASK                               0xFF

// Register: PWM3DC
#define PWM3DC PWM3DC
extern volatile unsigned short          PWM3DC              @ 0xDB3;
#ifndef _LIB_BUILD
asm("PWM3DC equ 0DB3h");
#endif

