daviskung/PIC16F1579_HM.X_2019_0524/mcc_generated_files/pic16f1579_ref.h
extern volatile PWM3CONbits_t PWM3CONbits @ 0xDBB;
// bitfield macros
#define _PWM3CON_MODE_POSN                                  0x2
#define _PWM3CON_MODE_POSITION                              0x2
#define _PWM3CON_MODE_SIZE                                  0x2
#define _PWM3CON_MODE_LENGTH                                0x2
#define _PWM3CON_MODE_MASK                                  0xC
#define _PWM3CON_POL_POSN                                   0x4
#define _PWM3CON_POL_POSITION                               0x4
#define _PWM3CON_POL_SIZE                                   0x1
#define _PWM3CON_POL_LENGTH                                 0x1
#define _PWM3CON_POL_MASK                                   0x10
#define _PWM3CON_OUT_POSN                                   0x5
#define _PWM3CON_OUT_POSITION                               0x5
#define _PWM3CON_OUT_SIZE                                   0x1
#define _PWM3CON_OUT_LENGTH                                 0x1
#define _PWM3CON_OUT_MASK                                   0x20
#define _PWM3CON_OE_POSN                                    0x6
#define _PWM3CON_OE_POSITION                                0x6
#define _PWM3CON_OE_SIZE                                    0x1
#define _PWM3CON_OE_LENGTH                                  0x1
#define _PWM3CON_OE_MASK                                    0x40
#define _PWM3CON_EN_POSN                                    0x7
#define _PWM3CON_EN_POSITION                                0x7
#define _PWM3CON_EN_SIZE                                    0x1
#define _PWM3CON_EN_LENGTH                                  0x1
#define _PWM3CON_EN_MASK                                    0x80
#define _PWM3CON_PWM3MODE0_POSN                             0x2
#define _PWM3CON_PWM3MODE0_POSITION                         0x2
#define _PWM3CON_PWM3MODE0_SIZE                             0x1
#define _PWM3CON_PWM3MODE0_LENGTH                           0x1
#define _PWM3CON_PWM3MODE0_MASK                             0x4
#define _PWM3CON_PWM3MODE1_POSN                             0x3
#define _PWM3CON_PWM3MODE1_POSITION                         0x3
#define _PWM3CON_PWM3MODE1_SIZE                             0x1
#define _PWM3CON_PWM3MODE1_LENGTH                           0x1
#define _PWM3CON_PWM3MODE1_MASK                             0x8
#define _PWM3CON_PWM3MODE_POSN                              0x2
#define _PWM3CON_PWM3MODE_POSITION                          0x2
#define _PWM3CON_PWM3MODE_SIZE                              0x2
#define _PWM3CON_PWM3MODE_LENGTH                            0x2
#define _PWM3CON_PWM3MODE_MASK                              0xC
#define _PWM3CON_PWM3POL_POSN                               0x4
#define _PWM3CON_PWM3POL_POSITION                           0x4
#define _PWM3CON_PWM3POL_SIZE                               0x1
#define _PWM3CON_PWM3POL_LENGTH                             0x1
#define _PWM3CON_PWM3POL_MASK                               0x10
#define _PWM3CON_PWM3OUT_POSN                               0x5
#define _PWM3CON_PWM3OUT_POSITION                           0x5
#define _PWM3CON_PWM3OUT_SIZE                               0x1
#define _PWM3CON_PWM3OUT_LENGTH                             0x1
#define _PWM3CON_PWM3OUT_MASK                               0x20
#define _PWM3CON_PWM3OE_POSN                                0x6
#define _PWM3CON_PWM3OE_POSITION                            0x6
#define _PWM3CON_PWM3OE_SIZE                                0x1
#define _PWM3CON_PWM3OE_LENGTH                              0x1
#define _PWM3CON_PWM3OE_MASK                                0x40
#define _PWM3CON_PWM3EN_POSN                                0x7
#define _PWM3CON_PWM3EN_POSITION                            0x7
#define _PWM3CON_PWM3EN_SIZE                                0x1
#define _PWM3CON_PWM3EN_LENGTH                              0x1
#define _PWM3CON_PWM3EN_MASK                                0x80
#define _PWM3CON_MODE0_POSN                                 0x2
#define _PWM3CON_MODE0_POSITION                             0x2
#define _PWM3CON_MODE0_SIZE                                 0x1
#define _PWM3CON_MODE0_LENGTH                               0x1
#define _PWM3CON_MODE0_MASK                                 0x4
#define _PWM3CON_MODE1_POSN                                 0x3
#define _PWM3CON_MODE1_POSITION                             0x3
#define _PWM3CON_MODE1_SIZE                                 0x1
#define _PWM3CON_MODE1_LENGTH                               0x1
#define _PWM3CON_MODE1_MASK                                 0x8

// Register: PWM3INTE
#define PWM3INTE PWM3INTE
extern volatile unsigned char           PWM3INTE            @ 0xDBC;
#ifndef _LIB_BUILD
asm("PWM3INTE equ 0DBCh");
#endif
// aliases
extern volatile unsigned char           PWM3INTCON          @ 0xDBC;
#ifndef _LIB_BUILD
asm("PWM3INTCON equ 0DBCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM3PRIE               :1;
        unsigned PWM3DCIE               :1;
        unsigned PWM3PHIE               :1;
        unsigned PWM3OFIE               :1;
    };
} PWM3INTEbits_t;
extern volatile PWM3INTEbits_t PWM3INTEbits @ 0xDBC;
// bitfield macros
#define _PWM3INTE_PRIE_POSN                                 0x0
#define _PWM3INTE_PRIE_POSITION                             0x0
#define _PWM3INTE_PRIE_SIZE                                 0x1
#define _PWM3INTE_PRIE_LENGTH                               0x1
#define _PWM3INTE_PRIE_MASK                                 0x1
#define _PWM3INTE_DCIE_POSN                                 0x1
#define _PWM3INTE_DCIE_POSITION                             0x1
#define _PWM3INTE_DCIE_SIZE                                 0x1
#define _PWM3INTE_DCIE_LENGTH                               0x1
#define _PWM3INTE_DCIE_MASK                                 0x2
#define _PWM3INTE_PHIE_POSN                                 0x2
#define _PWM3INTE_PHIE_POSITION                             0x2
#define _PWM3INTE_PHIE_SIZE                                 0x1
#define _PWM3INTE_PHIE_LENGTH                               0x1
#define _PWM3INTE_PHIE_MASK                                 0x4
#define _PWM3INTE_OFIE_POSN                                 0x3
#define _PWM3INTE_OFIE_POSITION                             0x3
#define _PWM3INTE_OFIE_SIZE                                 0x1
#define _PWM3INTE_OFIE_LENGTH                               0x1
#define _PWM3INTE_OFIE_MASK                                 0x8
#define _PWM3INTE_PWM3PRIE_POSN                             0x0
#define _PWM3INTE_PWM3PRIE_POSITION                         0x0
#define _PWM3INTE_PWM3PRIE_SIZE                             0x1
#define _PWM3INTE_PWM3PRIE_LENGTH                           0x1
#define _PWM3INTE_PWM3PRIE_MASK                             0x1
#define _PWM3INTE_PWM3DCIE_POSN                             0x1
#define _PWM3INTE_PWM3DCIE_POSITION                         0x1
#define _PWM3INTE_PWM3DCIE_SIZE                             0x1
#define _PWM3INTE_PWM3DCIE_LENGTH                           0x1
#define _PWM3INTE_PWM3DCIE_MASK                             0x2
#define _PWM3INTE_PWM3PHIE_POSN                             0x2
#define _PWM3INTE_PWM3PHIE_POSITION                         0x2
#define _PWM3INTE_PWM3PHIE_SIZE                             0x1
#define _PWM3INTE_PWM3PHIE_LENGTH                           0x1
#define _PWM3INTE_PWM3PHIE_MASK                             0x4
#define _PWM3INTE_PWM3OFIE_POSN                             0x3
#define _PWM3INTE_PWM3OFIE_POSITION                         0x3
#define _PWM3INTE_PWM3OFIE_SIZE                             0x1
#define _PWM3INTE_PWM3OFIE_LENGTH                           0x1
#define _PWM3INTE_PWM3OFIE_MASK                             0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM3PRIE               :1;
        unsigned PWM3DCIE               :1;
        unsigned PWM3PHIE               :1;
        unsigned PWM3OFIE               :1;
    };
} PWM3INTCONbits_t;
extern volatile PWM3INTCONbits_t PWM3INTCONbits @ 0xDBC;
// bitfield macros
#define _PWM3INTCON_PRIE_POSN                               0x0
#define _PWM3INTCON_PRIE_POSITION                           0x0
#define _PWM3INTCON_PRIE_SIZE                               0x1
#define _PWM3INTCON_PRIE_LENGTH                             0x1
#define _PWM3INTCON_PRIE_MASK                               0x1
#define _PWM3INTCON_DCIE_POSN                               0x1
#define _PWM3INTCON_DCIE_POSITION                           0x1
#define _PWM3INTCON_DCIE_SIZE                               0x1
#define _PWM3INTCON_DCIE_LENGTH                             0x1
#define _PWM3INTCON_DCIE_MASK                               0x2
#define _PWM3INTCON_PHIE_POSN                               0x2
#define _PWM3INTCON_PHIE_POSITION                           0x2
#define _PWM3INTCON_PHIE_SIZE                               0x1
#define _PWM3INTCON_PHIE_LENGTH                             0x1
#define _PWM3INTCON_PHIE_MASK                               0x4
#define _PWM3INTCON_OFIE_POSN                               0x3
#define _PWM3INTCON_OFIE_POSITION                           0x3
#define _PWM3INTCON_OFIE_SIZE                               0x1
#define _PWM3INTCON_OFIE_LENGTH                             0x1
#define _PWM3INTCON_OFIE_MASK                               0x8
#define _PWM3INTCON_PWM3PRIE_POSN                           0x0
#define _PWM3INTCON_PWM3PRIE_POSITION                       0x0
#define _PWM3INTCON_PWM3PRIE_SIZE                           0x1
#define _PWM3INTCON_PWM3PRIE_LENGTH                         0x1
#define _PWM3INTCON_PWM3PRIE_MASK                           0x1
#define _PWM3INTCON_PWM3DCIE_POSN                           0x1
#define _PWM3INTCON_PWM3DCIE_POSITION                       0x1
#define _PWM3INTCON_PWM3DCIE_SIZE                           0x1
#define _PWM3INTCON_PWM3DCIE_LENGTH                         0x1
#define _PWM3INTCON_PWM3DCIE_MASK                           0x2
#define _PWM3INTCON_PWM3PHIE_POSN                           0x2
#define _PWM3INTCON_PWM3PHIE_POSITION                       0x2
#define _PWM3INTCON_PWM3PHIE_SIZE                           0x1
#define _PWM3INTCON_PWM3PHIE_LENGTH                         0x1
#define _PWM3INTCON_PWM3PHIE_MASK                           0x4
#define _PWM3INTCON_PWM3OFIE_POSN                           0x3
#define _PWM3INTCON_PWM3OFIE_POSITION                       0x3
#define _PWM3INTCON_PWM3OFIE_SIZE                           0x1
#define _PWM3INTCON_PWM3OFIE_LENGTH                         0x1
#define _PWM3INTCON_PWM3OFIE_MASK                           0x8

// Register: PWM3INTF
#define PWM3INTF PWM3INTF
extern volatile unsigned char           PWM3INTF            @ 0xDBD;
#ifndef _LIB_BUILD
asm("PWM3INTF equ 0DBDh");
#endif
// aliases
extern volatile unsigned char           PWM3INTFLG          @ 0xDBD;
#ifndef _LIB_BUILD
asm("PWM3INTFLG equ 0DBDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM3PRIF               :1;
        unsigned PWM3DCIF               :1;
        unsigned PWM3PHIF               :1;
        unsigned PWM3OFIF               :1;
    };
} PWM3INTFbits_t;
