daviskung/PIC16F1579_HM.X_2019_0524/mcc_generated_files/pic16f1579_ref.h
extern volatile PWM3INTFbits_t PWM3INTFbits @ 0xDBD;
// bitfield macros
#define _PWM3INTF_PRIF_POSN                                 0x0
#define _PWM3INTF_PRIF_POSITION                             0x0
#define _PWM3INTF_PRIF_SIZE                                 0x1
#define _PWM3INTF_PRIF_LENGTH                               0x1
#define _PWM3INTF_PRIF_MASK                                 0x1
#define _PWM3INTF_DCIF_POSN                                 0x1
#define _PWM3INTF_DCIF_POSITION                             0x1
#define _PWM3INTF_DCIF_SIZE                                 0x1
#define _PWM3INTF_DCIF_LENGTH                               0x1
#define _PWM3INTF_DCIF_MASK                                 0x2
#define _PWM3INTF_PHIF_POSN                                 0x2
#define _PWM3INTF_PHIF_POSITION                             0x2
#define _PWM3INTF_PHIF_SIZE                                 0x1
#define _PWM3INTF_PHIF_LENGTH                               0x1
#define _PWM3INTF_PHIF_MASK                                 0x4
#define _PWM3INTF_OFIF_POSN                                 0x3
#define _PWM3INTF_OFIF_POSITION                             0x3
#define _PWM3INTF_OFIF_SIZE                                 0x1
#define _PWM3INTF_OFIF_LENGTH                               0x1
#define _PWM3INTF_OFIF_MASK                                 0x8
#define _PWM3INTF_PWM3PRIF_POSN                             0x0
#define _PWM3INTF_PWM3PRIF_POSITION                         0x0
#define _PWM3INTF_PWM3PRIF_SIZE                             0x1
#define _PWM3INTF_PWM3PRIF_LENGTH                           0x1
#define _PWM3INTF_PWM3PRIF_MASK                             0x1
#define _PWM3INTF_PWM3DCIF_POSN                             0x1
#define _PWM3INTF_PWM3DCIF_POSITION                         0x1
#define _PWM3INTF_PWM3DCIF_SIZE                             0x1
#define _PWM3INTF_PWM3DCIF_LENGTH                           0x1
#define _PWM3INTF_PWM3DCIF_MASK                             0x2
#define _PWM3INTF_PWM3PHIF_POSN                             0x2
#define _PWM3INTF_PWM3PHIF_POSITION                         0x2
#define _PWM3INTF_PWM3PHIF_SIZE                             0x1
#define _PWM3INTF_PWM3PHIF_LENGTH                           0x1
#define _PWM3INTF_PWM3PHIF_MASK                             0x4
#define _PWM3INTF_PWM3OFIF_POSN                             0x3
#define _PWM3INTF_PWM3OFIF_POSITION                         0x3
#define _PWM3INTF_PWM3OFIF_SIZE                             0x1
#define _PWM3INTF_PWM3OFIF_LENGTH                           0x1
#define _PWM3INTF_PWM3OFIF_MASK                             0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM3PRIF               :1;
        unsigned PWM3DCIF               :1;
        unsigned PWM3PHIF               :1;
        unsigned PWM3OFIF               :1;
    };
} PWM3INTFLGbits_t;
extern volatile PWM3INTFLGbits_t PWM3INTFLGbits @ 0xDBD;
// bitfield macros
#define _PWM3INTFLG_PRIF_POSN                               0x0
#define _PWM3INTFLG_PRIF_POSITION                           0x0
#define _PWM3INTFLG_PRIF_SIZE                               0x1
#define _PWM3INTFLG_PRIF_LENGTH                             0x1
#define _PWM3INTFLG_PRIF_MASK                               0x1
#define _PWM3INTFLG_DCIF_POSN                               0x1
#define _PWM3INTFLG_DCIF_POSITION                           0x1
#define _PWM3INTFLG_DCIF_SIZE                               0x1
#define _PWM3INTFLG_DCIF_LENGTH                             0x1
#define _PWM3INTFLG_DCIF_MASK                               0x2
#define _PWM3INTFLG_PHIF_POSN                               0x2
#define _PWM3INTFLG_PHIF_POSITION                           0x2
#define _PWM3INTFLG_PHIF_SIZE                               0x1
#define _PWM3INTFLG_PHIF_LENGTH                             0x1
#define _PWM3INTFLG_PHIF_MASK                               0x4
#define _PWM3INTFLG_OFIF_POSN                               0x3
#define _PWM3INTFLG_OFIF_POSITION                           0x3
#define _PWM3INTFLG_OFIF_SIZE                               0x1
#define _PWM3INTFLG_OFIF_LENGTH                             0x1
#define _PWM3INTFLG_OFIF_MASK                               0x8
#define _PWM3INTFLG_PWM3PRIF_POSN                           0x0
#define _PWM3INTFLG_PWM3PRIF_POSITION                       0x0
#define _PWM3INTFLG_PWM3PRIF_SIZE                           0x1
#define _PWM3INTFLG_PWM3PRIF_LENGTH                         0x1
#define _PWM3INTFLG_PWM3PRIF_MASK                           0x1
#define _PWM3INTFLG_PWM3DCIF_POSN                           0x1
#define _PWM3INTFLG_PWM3DCIF_POSITION                       0x1
#define _PWM3INTFLG_PWM3DCIF_SIZE                           0x1
#define _PWM3INTFLG_PWM3DCIF_LENGTH                         0x1
#define _PWM3INTFLG_PWM3DCIF_MASK                           0x2
#define _PWM3INTFLG_PWM3PHIF_POSN                           0x2
#define _PWM3INTFLG_PWM3PHIF_POSITION                       0x2
#define _PWM3INTFLG_PWM3PHIF_SIZE                           0x1
#define _PWM3INTFLG_PWM3PHIF_LENGTH                         0x1
#define _PWM3INTFLG_PWM3PHIF_MASK                           0x4
#define _PWM3INTFLG_PWM3OFIF_POSN                           0x3
#define _PWM3INTFLG_PWM3OFIF_POSITION                       0x3
#define _PWM3INTFLG_PWM3OFIF_SIZE                           0x1
#define _PWM3INTFLG_PWM3OFIF_LENGTH                         0x1
#define _PWM3INTFLG_PWM3OFIF_MASK                           0x8

// Register: PWM3CLKCON
#define PWM3CLKCON PWM3CLKCON
extern volatile unsigned char           PWM3CLKCON          @ 0xDBE;
#ifndef _LIB_BUILD
asm("PWM3CLKCON equ 0DBEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :2;
        unsigned                        :2;
        unsigned PS                     :3;
    };
    struct {
        unsigned PWM3CS0                :1;
        unsigned PWM3CS1                :1;
        unsigned                        :2;
        unsigned PWM3PS0                :1;
        unsigned PWM3PS1                :1;
        unsigned PWM3PS2                :1;
    };
    struct {
        unsigned PWM3CS                 :3;
        unsigned                        :1;
        unsigned PWM3PS                 :3;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned                        :2;
        unsigned PS0                    :1;
        unsigned PS1                    :1;
        unsigned PS2                    :1;
    };
} PWM3CLKCONbits_t;
extern volatile PWM3CLKCONbits_t PWM3CLKCONbits @ 0xDBE;
// bitfield macros
#define _PWM3CLKCON_CS_POSN                                 0x0
#define _PWM3CLKCON_CS_POSITION                             0x0
#define _PWM3CLKCON_CS_SIZE                                 0x2
#define _PWM3CLKCON_CS_LENGTH                               0x2
#define _PWM3CLKCON_CS_MASK                                 0x3
#define _PWM3CLKCON_PS_POSN                                 0x4
#define _PWM3CLKCON_PS_POSITION                             0x4
#define _PWM3CLKCON_PS_SIZE                                 0x3
#define _PWM3CLKCON_PS_LENGTH                               0x3
#define _PWM3CLKCON_PS_MASK                                 0x70
#define _PWM3CLKCON_PWM3CS0_POSN                            0x0
#define _PWM3CLKCON_PWM3CS0_POSITION                        0x0
#define _PWM3CLKCON_PWM3CS0_SIZE                            0x1
#define _PWM3CLKCON_PWM3CS0_LENGTH                          0x1
#define _PWM3CLKCON_PWM3CS0_MASK                            0x1
#define _PWM3CLKCON_PWM3CS1_POSN                            0x1
#define _PWM3CLKCON_PWM3CS1_POSITION                        0x1
#define _PWM3CLKCON_PWM3CS1_SIZE                            0x1
#define _PWM3CLKCON_PWM3CS1_LENGTH                          0x1
#define _PWM3CLKCON_PWM3CS1_MASK                            0x2
#define _PWM3CLKCON_PWM3PS0_POSN                            0x4
#define _PWM3CLKCON_PWM3PS0_POSITION                        0x4
#define _PWM3CLKCON_PWM3PS0_SIZE                            0x1
#define _PWM3CLKCON_PWM3PS0_LENGTH                          0x1
#define _PWM3CLKCON_PWM3PS0_MASK                            0x10
#define _PWM3CLKCON_PWM3PS1_POSN                            0x5
#define _PWM3CLKCON_PWM3PS1_POSITION                        0x5
#define _PWM3CLKCON_PWM3PS1_SIZE                            0x1
#define _PWM3CLKCON_PWM3PS1_LENGTH                          0x1
#define _PWM3CLKCON_PWM3PS1_MASK                            0x20
#define _PWM3CLKCON_PWM3PS2_POSN                            0x6
#define _PWM3CLKCON_PWM3PS2_POSITION                        0x6
#define _PWM3CLKCON_PWM3PS2_SIZE                            0x1
#define _PWM3CLKCON_PWM3PS2_LENGTH                          0x1
#define _PWM3CLKCON_PWM3PS2_MASK                            0x40
#define _PWM3CLKCON_PWM3CS_POSN                             0x0
#define _PWM3CLKCON_PWM3CS_POSITION                         0x0
#define _PWM3CLKCON_PWM3CS_SIZE                             0x3
#define _PWM3CLKCON_PWM3CS_LENGTH                           0x3
#define _PWM3CLKCON_PWM3CS_MASK                             0x7
#define _PWM3CLKCON_PWM3PS_POSN                             0x4
#define _PWM3CLKCON_PWM3PS_POSITION                         0x4
#define _PWM3CLKCON_PWM3PS_SIZE                             0x3
#define _PWM3CLKCON_PWM3PS_LENGTH                           0x3
#define _PWM3CLKCON_PWM3PS_MASK                             0x70
#define _PWM3CLKCON_CS0_POSN                                0x0
#define _PWM3CLKCON_CS0_POSITION                            0x0
#define _PWM3CLKCON_CS0_SIZE                                0x1
#define _PWM3CLKCON_CS0_LENGTH                              0x1
#define _PWM3CLKCON_CS0_MASK                                0x1
#define _PWM3CLKCON_CS1_POSN                                0x1
#define _PWM3CLKCON_CS1_POSITION                            0x1
#define _PWM3CLKCON_CS1_SIZE                                0x1
#define _PWM3CLKCON_CS1_LENGTH                              0x1
#define _PWM3CLKCON_CS1_MASK                                0x2
#define _PWM3CLKCON_PS0_POSN                                0x4
#define _PWM3CLKCON_PS0_POSITION                            0x4
#define _PWM3CLKCON_PS0_SIZE                                0x1
#define _PWM3CLKCON_PS0_LENGTH                              0x1
#define _PWM3CLKCON_PS0_MASK                                0x10
#define _PWM3CLKCON_PS1_POSN                                0x5
#define _PWM3CLKCON_PS1_POSITION                            0x5
#define _PWM3CLKCON_PS1_SIZE                                0x1
#define _PWM3CLKCON_PS1_LENGTH                              0x1
#define _PWM3CLKCON_PS1_MASK                                0x20
#define _PWM3CLKCON_PS2_POSN                                0x6
#define _PWM3CLKCON_PS2_POSITION                            0x6
#define _PWM3CLKCON_PS2_SIZE                                0x1
#define _PWM3CLKCON_PS2_LENGTH                              0x1
#define _PWM3CLKCON_PS2_MASK                                0x40

// Register: PWM3LDCON
#define PWM3LDCON PWM3LDCON
extern volatile unsigned char           PWM3LDCON           @ 0xDBF;
#ifndef _LIB_BUILD
asm("PWM3LDCON equ 0DBFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :2;
        unsigned                        :4;
        unsigned LDT                    :1;
        unsigned LDA                    :1;
    };
    struct {
        unsigned PWM3LDS0               :1;
        unsigned PWM3LDS1               :1;
    };
    struct {
        unsigned PWM3LDS                :2;
        unsigned                        :4;
        unsigned PWM3LDM                :1;
        unsigned PWM3LD                 :1;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
    };
} PWM3LDCONbits_t;
extern volatile PWM3LDCONbits_t PWM3LDCONbits @ 0xDBF;
// bitfield macros
#define _PWM3LDCON_LDS_POSN                                 0x0
#define _PWM3LDCON_LDS_POSITION                             0x0
#define _PWM3LDCON_LDS_SIZE                                 0x2
#define _PWM3LDCON_LDS_LENGTH                               0x2
#define _PWM3LDCON_LDS_MASK                                 0x3
#define _PWM3LDCON_LDT_POSN                                 0x6
#define _PWM3LDCON_LDT_POSITION                             0x6
#define _PWM3LDCON_LDT_SIZE                                 0x1
#define _PWM3LDCON_LDT_LENGTH                               0x1
#define _PWM3LDCON_LDT_MASK                                 0x40
#define _PWM3LDCON_LDA_POSN                                 0x7
#define _PWM3LDCON_LDA_POSITION                             0x7
#define _PWM3LDCON_LDA_SIZE                                 0x1
#define _PWM3LDCON_LDA_LENGTH                               0x1
#define _PWM3LDCON_LDA_MASK                                 0x80
#define _PWM3LDCON_PWM3LDS0_POSN                            0x0
#define _PWM3LDCON_PWM3LDS0_POSITION                        0x0
#define _PWM3LDCON_PWM3LDS0_SIZE                            0x1
#define _PWM3LDCON_PWM3LDS0_LENGTH                          0x1
#define _PWM3LDCON_PWM3LDS0_MASK                            0x1
#define _PWM3LDCON_PWM3LDS1_POSN                            0x1
#define _PWM3LDCON_PWM3LDS1_POSITION                        0x1
#define _PWM3LDCON_PWM3LDS1_SIZE                            0x1
#define _PWM3LDCON_PWM3LDS1_LENGTH                          0x1
#define _PWM3LDCON_PWM3LDS1_MASK                            0x2
#define _PWM3LDCON_PWM3LDS_POSN                             0x0
#define _PWM3LDCON_PWM3LDS_POSITION                         0x0
#define _PWM3LDCON_PWM3LDS_SIZE                             0x2
#define _PWM3LDCON_PWM3LDS_LENGTH                           0x2
#define _PWM3LDCON_PWM3LDS_MASK                             0x3
#define _PWM3LDCON_PWM3LDM_POSN                             0x6
#define _PWM3LDCON_PWM3LDM_POSITION                         0x6
#define _PWM3LDCON_PWM3LDM_SIZE                             0x1
#define _PWM3LDCON_PWM3LDM_LENGTH                           0x1
#define _PWM3LDCON_PWM3LDM_MASK                             0x40
#define _PWM3LDCON_PWM3LD_POSN                              0x7
#define _PWM3LDCON_PWM3LD_POSITION                          0x7
#define _PWM3LDCON_PWM3LD_SIZE                              0x1
#define _PWM3LDCON_PWM3LD_LENGTH                            0x1
#define _PWM3LDCON_PWM3LD_MASK                              0x80
#define _PWM3LDCON_LDS0_POSN                                0x0
#define _PWM3LDCON_LDS0_POSITION                            0x0
#define _PWM3LDCON_LDS0_SIZE                                0x1
#define _PWM3LDCON_LDS0_LENGTH                              0x1
#define _PWM3LDCON_LDS0_MASK                                0x1
#define _PWM3LDCON_LDS1_POSN                                0x1
#define _PWM3LDCON_LDS1_POSITION                            0x1
#define _PWM3LDCON_LDS1_SIZE                                0x1
#define _PWM3LDCON_LDS1_LENGTH                              0x1
#define _PWM3LDCON_LDS1_MASK                                0x2

// Register: PWM3OFCON
#define PWM3OFCON PWM3OFCON
extern volatile unsigned char           PWM3OFCON           @ 0xDC0;
#ifndef _LIB_BUILD
asm("PWM3OFCON equ 0DC0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OFS                    :2;
        unsigned                        :2;
        unsigned OFO                    :1;
        unsigned OFM                    :2;
    };
    struct {
        unsigned PWM3OFS0               :1;
        unsigned PWM3OFS1               :1;
        unsigned                        :3;
        unsigned PWM3OFM0               :1;
        unsigned PWM3OFM1               :1;
    };
    struct {
        unsigned PWM3OFS                :2;
        unsigned                        :2;
        unsigned PWM3OFMC               :1;
        unsigned PWM3OFM                :2;
    };
    struct {
        unsigned OFS0                   :1;
        unsigned OFS1                   :1;
        unsigned                        :3;
        unsigned OFM0                   :1;
        unsigned OFM1                   :1;
    };
} PWM3OFCONbits_t;
extern volatile PWM3OFCONbits_t PWM3OFCONbits @ 0xDC0;
// bitfield macros
#define _PWM3OFCON_OFS_POSN                                 0x0
#define _PWM3OFCON_OFS_POSITION                             0x0
#define _PWM3OFCON_OFS_SIZE                                 0x2
#define _PWM3OFCON_OFS_LENGTH                               0x2
#define _PWM3OFCON_OFS_MASK                                 0x3
#define _PWM3OFCON_OFO_POSN                                 0x4
#define _PWM3OFCON_OFO_POSITION                             0x4
#define _PWM3OFCON_OFO_SIZE                                 0x1
#define _PWM3OFCON_OFO_LENGTH                               0x1
#define _PWM3OFCON_OFO_MASK                                 0x10
#define _PWM3OFCON_OFM_POSN                                 0x5
#define _PWM3OFCON_OFM_POSITION                             0x5
#define _PWM3OFCON_OFM_SIZE                                 0x2
#define _PWM3OFCON_OFM_LENGTH                               0x2
#define _PWM3OFCON_OFM_MASK                                 0x60
#define _PWM3OFCON_PWM3OFS0_POSN                            0x0
#define _PWM3OFCON_PWM3OFS0_POSITION                        0x0
#define _PWM3OFCON_PWM3OFS0_SIZE                            0x1
#define _PWM3OFCON_PWM3OFS0_LENGTH                          0x1
#define _PWM3OFCON_PWM3OFS0_MASK                            0x1
#define _PWM3OFCON_PWM3OFS1_POSN                            0x1
#define _PWM3OFCON_PWM3OFS1_POSITION                        0x1
#define _PWM3OFCON_PWM3OFS1_SIZE                            0x1
#define _PWM3OFCON_PWM3OFS1_LENGTH                          0x1
#define _PWM3OFCON_PWM3OFS1_MASK                            0x2
#define _PWM3OFCON_PWM3OFM0_POSN                            0x5
#define _PWM3OFCON_PWM3OFM0_POSITION                        0x5
#define _PWM3OFCON_PWM3OFM0_SIZE                            0x1
#define _PWM3OFCON_PWM3OFM0_LENGTH                          0x1
#define _PWM3OFCON_PWM3OFM0_MASK                            0x20
#define _PWM3OFCON_PWM3OFM1_POSN                            0x6
#define _PWM3OFCON_PWM3OFM1_POSITION                        0x6
#define _PWM3OFCON_PWM3OFM1_SIZE                            0x1
#define _PWM3OFCON_PWM3OFM1_LENGTH                          0x1
#define _PWM3OFCON_PWM3OFM1_MASK                            0x40
#define _PWM3OFCON_PWM3OFS_POSN                             0x0
#define _PWM3OFCON_PWM3OFS_POSITION                         0x0
#define _PWM3OFCON_PWM3OFS_SIZE                             0x2
#define _PWM3OFCON_PWM3OFS_LENGTH                           0x2
#define _PWM3OFCON_PWM3OFS_MASK                             0x3
#define _PWM3OFCON_PWM3OFMC_POSN                            0x4
#define _PWM3OFCON_PWM3OFMC_POSITION                        0x4
#define _PWM3OFCON_PWM3OFMC_SIZE                            0x1
#define _PWM3OFCON_PWM3OFMC_LENGTH                          0x1
#define _PWM3OFCON_PWM3OFMC_MASK                            0x10
#define _PWM3OFCON_PWM3OFM_POSN                             0x5
#define _PWM3OFCON_PWM3OFM_POSITION                         0x5
#define _PWM3OFCON_PWM3OFM_SIZE                             0x2
#define _PWM3OFCON_PWM3OFM_LENGTH                           0x2
#define _PWM3OFCON_PWM3OFM_MASK                             0x60
#define _PWM3OFCON_OFS0_POSN                                0x0
#define _PWM3OFCON_OFS0_POSITION                            0x0
#define _PWM3OFCON_OFS0_SIZE                                0x1
#define _PWM3OFCON_OFS0_LENGTH                              0x1
#define _PWM3OFCON_OFS0_MASK                                0x1
#define _PWM3OFCON_OFS1_POSN                                0x1
#define _PWM3OFCON_OFS1_POSITION                            0x1
#define _PWM3OFCON_OFS1_SIZE                                0x1
#define _PWM3OFCON_OFS1_LENGTH                              0x1
#define _PWM3OFCON_OFS1_MASK                                0x2
#define _PWM3OFCON_OFM0_POSN                                0x5
#define _PWM3OFCON_OFM0_POSITION                            0x5
#define _PWM3OFCON_OFM0_SIZE                                0x1
#define _PWM3OFCON_OFM0_LENGTH                              0x1
#define _PWM3OFCON_OFM0_MASK                                0x20
#define _PWM3OFCON_OFM1_POSN                                0x6
#define _PWM3OFCON_OFM1_POSITION                            0x6
#define _PWM3OFCON_OFM1_SIZE                                0x1
#define _PWM3OFCON_OFM1_LENGTH                              0x1
#define _PWM3OFCON_OFM1_MASK                                0x40

// Register: PWM4PH
#define PWM4PH PWM4PH
extern volatile unsigned short          PWM4PH              @ 0xDC1;
#ifndef _LIB_BUILD
asm("PWM4PH equ 0DC1h");
#endif

// Register: PWM4PHL
#define PWM4PHL PWM4PHL
extern volatile unsigned char           PWM4PHL             @ 0xDC1;
#ifndef _LIB_BUILD
asm("PWM4PHL equ 0DC1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM4PHL0               :1;
        unsigned PWM4PHL1               :1;
        unsigned PWM4PHL2               :1;
        unsigned PWM4PHL3               :1;
        unsigned PWM4PHL4               :1;
        unsigned PWM4PHL5               :1;
        unsigned PWM4PHL6               :1;
        unsigned PWM4PHL7               :1;
    };
    struct {
        unsigned PWM4PHL                :8;
    };
} PWM4PHLbits_t;
