daviskung/PIC16F1579_HM.X_2019_0524/mcc_generated_files/pic16f1579_ref.h
// Register: PWM4PRH
#define PWM4PRH PWM4PRH
extern volatile unsigned char           PWM4PRH             @ 0xDC6;
#ifndef _LIB_BUILD
asm("PWM4PRH equ 0DC6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PWM4PRH0               :1;
        unsigned PWM4PRH1               :1;
        unsigned PWM4PRH2               :1;
        unsigned PWM4PRH3               :1;
        unsigned PWM4PRH4               :1;
        unsigned PWM4PRH5               :1;
        unsigned PWM4PRH6               :1;
        unsigned PWM4PRH7               :1;
    };
    struct {
        unsigned PWM4PRH                :8;
    };
} PWM4PRHbits_t;
extern volatile PWM4PRHbits_t PWM4PRHbits @ 0xDC6;
// bitfield macros
#define _PWM4PRH_PR_POSN                                    0x0
#define _PWM4PRH_PR_POSITION                                0x0
#define _PWM4PRH_PR_SIZE                                    0x8
#define _PWM4PRH_PR_LENGTH                                  0x8
#define _PWM4PRH_PR_MASK                                    0xFF
#define _PWM4PRH_PWM4PRH0_POSN                              0x0
#define _PWM4PRH_PWM4PRH0_POSITION                          0x0
#define _PWM4PRH_PWM4PRH0_SIZE                              0x1
#define _PWM4PRH_PWM4PRH0_LENGTH                            0x1
#define _PWM4PRH_PWM4PRH0_MASK                              0x1
#define _PWM4PRH_PWM4PRH1_POSN                              0x1
#define _PWM4PRH_PWM4PRH1_POSITION                          0x1
#define _PWM4PRH_PWM4PRH1_SIZE                              0x1
#define _PWM4PRH_PWM4PRH1_LENGTH                            0x1
#define _PWM4PRH_PWM4PRH1_MASK                              0x2
#define _PWM4PRH_PWM4PRH2_POSN                              0x2
#define _PWM4PRH_PWM4PRH2_POSITION                          0x2
#define _PWM4PRH_PWM4PRH2_SIZE                              0x1
#define _PWM4PRH_PWM4PRH2_LENGTH                            0x1
#define _PWM4PRH_PWM4PRH2_MASK                              0x4
#define _PWM4PRH_PWM4PRH3_POSN                              0x3
#define _PWM4PRH_PWM4PRH3_POSITION                          0x3
#define _PWM4PRH_PWM4PRH3_SIZE                              0x1
#define _PWM4PRH_PWM4PRH3_LENGTH                            0x1
#define _PWM4PRH_PWM4PRH3_MASK                              0x8
#define _PWM4PRH_PWM4PRH4_POSN                              0x4
#define _PWM4PRH_PWM4PRH4_POSITION                          0x4
#define _PWM4PRH_PWM4PRH4_SIZE                              0x1
#define _PWM4PRH_PWM4PRH4_LENGTH                            0x1
#define _PWM4PRH_PWM4PRH4_MASK                              0x10
#define _PWM4PRH_PWM4PRH5_POSN                              0x5
#define _PWM4PRH_PWM4PRH5_POSITION                          0x5
#define _PWM4PRH_PWM4PRH5_SIZE                              0x1
#define _PWM4PRH_PWM4PRH5_LENGTH                            0x1
#define _PWM4PRH_PWM4PRH5_MASK                              0x20
#define _PWM4PRH_PWM4PRH6_POSN                              0x6
#define _PWM4PRH_PWM4PRH6_POSITION                          0x6
#define _PWM4PRH_PWM4PRH6_SIZE                              0x1
#define _PWM4PRH_PWM4PRH6_LENGTH                            0x1
#define _PWM4PRH_PWM4PRH6_MASK                              0x40
#define _PWM4PRH_PWM4PRH7_POSN                              0x7
#define _PWM4PRH_PWM4PRH7_POSITION                          0x7
#define _PWM4PRH_PWM4PRH7_SIZE                              0x1
#define _PWM4PRH_PWM4PRH7_LENGTH                            0x1
#define _PWM4PRH_PWM4PRH7_MASK                              0x80
#define _PWM4PRH_PWM4PRH_POSN                               0x0
#define _PWM4PRH_PWM4PRH_POSITION                           0x0
#define _PWM4PRH_PWM4PRH_SIZE                               0x8
#define _PWM4PRH_PWM4PRH_LENGTH                             0x8
#define _PWM4PRH_PWM4PRH_MASK                               0xFF

// Register: PWM4OF
#define PWM4OF PWM4OF
extern volatile unsigned short          PWM4OF              @ 0xDC7;
#ifndef _LIB_BUILD
asm("PWM4OF equ 0DC7h");
#endif

// Register: PWM4OFL
#define PWM4OFL PWM4OFL
extern volatile unsigned char           PWM4OFL             @ 0xDC7;
#ifndef _LIB_BUILD
asm("PWM4OFL equ 0DC7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OF                     :8;
    };
    struct {
        unsigned PWM4OFL0               :1;
        unsigned PWM4OFL1               :1;
        unsigned PWM4OFL2               :1;
        unsigned PWM4OFL3               :1;
        unsigned PWM4OFL4               :1;
        unsigned PWM4OFL5               :1;
        unsigned PWM4OFL6               :1;
        unsigned PWM4OFL7               :1;
    };
    struct {
        unsigned PWM4OFL                :8;
    };
} PWM4OFLbits_t;
extern volatile PWM4OFLbits_t PWM4OFLbits @ 0xDC7;
// bitfield macros
#define _PWM4OFL_OF_POSN                                    0x0
#define _PWM4OFL_OF_POSITION                                0x0
#define _PWM4OFL_OF_SIZE                                    0x8
#define _PWM4OFL_OF_LENGTH                                  0x8
#define _PWM4OFL_OF_MASK                                    0xFF
#define _PWM4OFL_PWM4OFL0_POSN                              0x0
#define _PWM4OFL_PWM4OFL0_POSITION                          0x0
#define _PWM4OFL_PWM4OFL0_SIZE                              0x1
#define _PWM4OFL_PWM4OFL0_LENGTH                            0x1
#define _PWM4OFL_PWM4OFL0_MASK                              0x1
#define _PWM4OFL_PWM4OFL1_POSN                              0x1
#define _PWM4OFL_PWM4OFL1_POSITION                          0x1
#define _PWM4OFL_PWM4OFL1_SIZE                              0x1
#define _PWM4OFL_PWM4OFL1_LENGTH                            0x1
#define _PWM4OFL_PWM4OFL1_MASK                              0x2
#define _PWM4OFL_PWM4OFL2_POSN                              0x2
#define _PWM4OFL_PWM4OFL2_POSITION                          0x2
#define _PWM4OFL_PWM4OFL2_SIZE                              0x1
#define _PWM4OFL_PWM4OFL2_LENGTH                            0x1
#define _PWM4OFL_PWM4OFL2_MASK                              0x4
#define _PWM4OFL_PWM4OFL3_POSN                              0x3
#define _PWM4OFL_PWM4OFL3_POSITION                          0x3
#define _PWM4OFL_PWM4OFL3_SIZE                              0x1
#define _PWM4OFL_PWM4OFL3_LENGTH                            0x1
#define _PWM4OFL_PWM4OFL3_MASK                              0x8
#define _PWM4OFL_PWM4OFL4_POSN                              0x4
#define _PWM4OFL_PWM4OFL4_POSITION                          0x4
#define _PWM4OFL_PWM4OFL4_SIZE                              0x1
#define _PWM4OFL_PWM4OFL4_LENGTH                            0x1
#define _PWM4OFL_PWM4OFL4_MASK                              0x10
#define _PWM4OFL_PWM4OFL5_POSN                              0x5
#define _PWM4OFL_PWM4OFL5_POSITION                          0x5
#define _PWM4OFL_PWM4OFL5_SIZE                              0x1
#define _PWM4OFL_PWM4OFL5_LENGTH                            0x1
#define _PWM4OFL_PWM4OFL5_MASK                              0x20
#define _PWM4OFL_PWM4OFL6_POSN                              0x6
#define _PWM4OFL_PWM4OFL6_POSITION                          0x6
#define _PWM4OFL_PWM4OFL6_SIZE                              0x1
#define _PWM4OFL_PWM4OFL6_LENGTH                            0x1
#define _PWM4OFL_PWM4OFL6_MASK                              0x40
#define _PWM4OFL_PWM4OFL7_POSN                              0x7
#define _PWM4OFL_PWM4OFL7_POSITION                          0x7
#define _PWM4OFL_PWM4OFL7_SIZE                              0x1
#define _PWM4OFL_PWM4OFL7_LENGTH                            0x1
#define _PWM4OFL_PWM4OFL7_MASK                              0x80
#define _PWM4OFL_PWM4OFL_POSN                               0x0
#define _PWM4OFL_PWM4OFL_POSITION                           0x0
#define _PWM4OFL_PWM4OFL_SIZE                               0x8
#define _PWM4OFL_PWM4OFL_LENGTH                             0x8
#define _PWM4OFL_PWM4OFL_MASK                               0xFF

