daviskung/PIC16F1579_HM.X_2019_0524/mcc_generated_files/pic16f1579_ref.h
// Register: PWM4CON
#define PWM4CON PWM4CON
extern volatile unsigned char           PWM4CON             @ 0xDCB;
#ifndef _LIB_BUILD
asm("PWM4CON equ 0DCBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned MODE                   :2;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned OE                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned PWM4MODE0              :1;
        unsigned PWM4MODE1              :1;
    };
    struct {
        unsigned                        :2;
        unsigned PWM4MODE               :2;
        unsigned PWM4POL                :1;
        unsigned PWM4OUT                :1;
        unsigned PWM4OE                 :1;
        unsigned PWM4EN                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
    };
} PWM4CONbits_t;
extern volatile PWM4CONbits_t PWM4CONbits @ 0xDCB;
// bitfield macros
#define _PWM4CON_MODE_POSN                                  0x2
#define _PWM4CON_MODE_POSITION                              0x2
#define _PWM4CON_MODE_SIZE                                  0x2
#define _PWM4CON_MODE_LENGTH                                0x2
#define _PWM4CON_MODE_MASK                                  0xC
#define _PWM4CON_POL_POSN                                   0x4
#define _PWM4CON_POL_POSITION                               0x4
#define _PWM4CON_POL_SIZE                                   0x1
#define _PWM4CON_POL_LENGTH                                 0x1
#define _PWM4CON_POL_MASK                                   0x10
#define _PWM4CON_OUT_POSN                                   0x5
#define _PWM4CON_OUT_POSITION                               0x5
#define _PWM4CON_OUT_SIZE                                   0x1
#define _PWM4CON_OUT_LENGTH                                 0x1
#define _PWM4CON_OUT_MASK                                   0x20
#define _PWM4CON_OE_POSN                                    0x6
#define _PWM4CON_OE_POSITION                                0x6
#define _PWM4CON_OE_SIZE                                    0x1
#define _PWM4CON_OE_LENGTH                                  0x1
#define _PWM4CON_OE_MASK                                    0x40
#define _PWM4CON_EN_POSN                                    0x7
#define _PWM4CON_EN_POSITION                                0x7
#define _PWM4CON_EN_SIZE                                    0x1
#define _PWM4CON_EN_LENGTH                                  0x1
#define _PWM4CON_EN_MASK                                    0x80
#define _PWM4CON_PWM4MODE0_POSN                             0x2
#define _PWM4CON_PWM4MODE0_POSITION                         0x2
#define _PWM4CON_PWM4MODE0_SIZE                             0x1
#define _PWM4CON_PWM4MODE0_LENGTH                           0x1
#define _PWM4CON_PWM4MODE0_MASK                             0x4
#define _PWM4CON_PWM4MODE1_POSN                             0x3
#define _PWM4CON_PWM4MODE1_POSITION                         0x3
#define _PWM4CON_PWM4MODE1_SIZE                             0x1
#define _PWM4CON_PWM4MODE1_LENGTH                           0x1
#define _PWM4CON_PWM4MODE1_MASK                             0x8
#define _PWM4CON_PWM4MODE_POSN                              0x2
#define _PWM4CON_PWM4MODE_POSITION                          0x2
#define _PWM4CON_PWM4MODE_SIZE                              0x2
#define _PWM4CON_PWM4MODE_LENGTH                            0x2
#define _PWM4CON_PWM4MODE_MASK                              0xC
#define _PWM4CON_PWM4POL_POSN                               0x4
#define _PWM4CON_PWM4POL_POSITION                           0x4
#define _PWM4CON_PWM4POL_SIZE                               0x1
#define _PWM4CON_PWM4POL_LENGTH                             0x1
#define _PWM4CON_PWM4POL_MASK                               0x10
#define _PWM4CON_PWM4OUT_POSN                               0x5
#define _PWM4CON_PWM4OUT_POSITION                           0x5
#define _PWM4CON_PWM4OUT_SIZE                               0x1
#define _PWM4CON_PWM4OUT_LENGTH                             0x1
#define _PWM4CON_PWM4OUT_MASK                               0x20
#define _PWM4CON_PWM4OE_POSN                                0x6
#define _PWM4CON_PWM4OE_POSITION                            0x6
#define _PWM4CON_PWM4OE_SIZE                                0x1
#define _PWM4CON_PWM4OE_LENGTH                              0x1
#define _PWM4CON_PWM4OE_MASK                                0x40
#define _PWM4CON_PWM4EN_POSN                                0x7
#define _PWM4CON_PWM4EN_POSITION                            0x7
#define _PWM4CON_PWM4EN_SIZE                                0x1
#define _PWM4CON_PWM4EN_LENGTH                              0x1
#define _PWM4CON_PWM4EN_MASK                                0x80
#define _PWM4CON_MODE0_POSN                                 0x2
#define _PWM4CON_MODE0_POSITION                             0x2
#define _PWM4CON_MODE0_SIZE                                 0x1
#define _PWM4CON_MODE0_LENGTH                               0x1
#define _PWM4CON_MODE0_MASK                                 0x4
#define _PWM4CON_MODE1_POSN                                 0x3
#define _PWM4CON_MODE1_POSITION                             0x3
#define _PWM4CON_MODE1_SIZE                                 0x1
#define _PWM4CON_MODE1_LENGTH                               0x1
#define _PWM4CON_MODE1_MASK                                 0x8

// Register: PWM4INTE
#define PWM4INTE PWM4INTE
extern volatile unsigned char           PWM4INTE            @ 0xDCC;
#ifndef _LIB_BUILD
asm("PWM4INTE equ 0DCCh");
#endif
// aliases
extern volatile unsigned char           PWM4INTCON          @ 0xDCC;
#ifndef _LIB_BUILD
asm("PWM4INTCON equ 0DCCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM4PRIE               :1;
        unsigned PWM4DCIE               :1;
        unsigned PWM4PHIE               :1;
        unsigned PWM4OFIE               :1;
    };
} PWM4INTEbits_t;
extern volatile PWM4INTEbits_t PWM4INTEbits @ 0xDCC;
// bitfield macros
#define _PWM4INTE_PRIE_POSN                                 0x0
#define _PWM4INTE_PRIE_POSITION                             0x0
#define _PWM4INTE_PRIE_SIZE                                 0x1
#define _PWM4INTE_PRIE_LENGTH                               0x1
#define _PWM4INTE_PRIE_MASK                                 0x1
#define _PWM4INTE_DCIE_POSN                                 0x1
#define _PWM4INTE_DCIE_POSITION                             0x1
#define _PWM4INTE_DCIE_SIZE                                 0x1
#define _PWM4INTE_DCIE_LENGTH                               0x1
#define _PWM4INTE_DCIE_MASK                                 0x2
#define _PWM4INTE_PHIE_POSN                                 0x2
#define _PWM4INTE_PHIE_POSITION                             0x2
#define _PWM4INTE_PHIE_SIZE                                 0x1
#define _PWM4INTE_PHIE_LENGTH                               0x1
#define _PWM4INTE_PHIE_MASK                                 0x4
#define _PWM4INTE_OFIE_POSN                                 0x3
#define _PWM4INTE_OFIE_POSITION                             0x3
#define _PWM4INTE_OFIE_SIZE                                 0x1
#define _PWM4INTE_OFIE_LENGTH                               0x1
#define _PWM4INTE_OFIE_MASK                                 0x8
#define _PWM4INTE_PWM4PRIE_POSN                             0x0
#define _PWM4INTE_PWM4PRIE_POSITION                         0x0
#define _PWM4INTE_PWM4PRIE_SIZE                             0x1
#define _PWM4INTE_PWM4PRIE_LENGTH                           0x1
#define _PWM4INTE_PWM4PRIE_MASK                             0x1
#define _PWM4INTE_PWM4DCIE_POSN                             0x1
#define _PWM4INTE_PWM4DCIE_POSITION                         0x1
#define _PWM4INTE_PWM4DCIE_SIZE                             0x1
#define _PWM4INTE_PWM4DCIE_LENGTH                           0x1
#define _PWM4INTE_PWM4DCIE_MASK                             0x2
#define _PWM4INTE_PWM4PHIE_POSN                             0x2
#define _PWM4INTE_PWM4PHIE_POSITION                         0x2
#define _PWM4INTE_PWM4PHIE_SIZE                             0x1
#define _PWM4INTE_PWM4PHIE_LENGTH                           0x1
#define _PWM4INTE_PWM4PHIE_MASK                             0x4
#define _PWM4INTE_PWM4OFIE_POSN                             0x3
#define _PWM4INTE_PWM4OFIE_POSITION                         0x3
#define _PWM4INTE_PWM4OFIE_SIZE                             0x1
#define _PWM4INTE_PWM4OFIE_LENGTH                           0x1
#define _PWM4INTE_PWM4OFIE_MASK                             0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM4PRIE               :1;
        unsigned PWM4DCIE               :1;
        unsigned PWM4PHIE               :1;
        unsigned PWM4OFIE               :1;
    };
} PWM4INTCONbits_t;
extern volatile PWM4INTCONbits_t PWM4INTCONbits @ 0xDCC;
// bitfield macros
#define _PWM4INTCON_PRIE_POSN                               0x0
#define _PWM4INTCON_PRIE_POSITION                           0x0
#define _PWM4INTCON_PRIE_SIZE                               0x1
#define _PWM4INTCON_PRIE_LENGTH                             0x1
#define _PWM4INTCON_PRIE_MASK                               0x1
#define _PWM4INTCON_DCIE_POSN                               0x1
#define _PWM4INTCON_DCIE_POSITION                           0x1
#define _PWM4INTCON_DCIE_SIZE                               0x1
#define _PWM4INTCON_DCIE_LENGTH                             0x1
#define _PWM4INTCON_DCIE_MASK                               0x2
#define _PWM4INTCON_PHIE_POSN                               0x2
#define _PWM4INTCON_PHIE_POSITION                           0x2
#define _PWM4INTCON_PHIE_SIZE                               0x1
#define _PWM4INTCON_PHIE_LENGTH                             0x1
#define _PWM4INTCON_PHIE_MASK                               0x4
#define _PWM4INTCON_OFIE_POSN                               0x3
#define _PWM4INTCON_OFIE_POSITION                           0x3
#define _PWM4INTCON_OFIE_SIZE                               0x1
#define _PWM4INTCON_OFIE_LENGTH                             0x1
#define _PWM4INTCON_OFIE_MASK                               0x8
#define _PWM4INTCON_PWM4PRIE_POSN                           0x0
#define _PWM4INTCON_PWM4PRIE_POSITION                       0x0
#define _PWM4INTCON_PWM4PRIE_SIZE                           0x1
#define _PWM4INTCON_PWM4PRIE_LENGTH                         0x1
#define _PWM4INTCON_PWM4PRIE_MASK                           0x1
#define _PWM4INTCON_PWM4DCIE_POSN                           0x1
#define _PWM4INTCON_PWM4DCIE_POSITION                       0x1
#define _PWM4INTCON_PWM4DCIE_SIZE                           0x1
#define _PWM4INTCON_PWM4DCIE_LENGTH                         0x1
#define _PWM4INTCON_PWM4DCIE_MASK                           0x2
#define _PWM4INTCON_PWM4PHIE_POSN                           0x2
#define _PWM4INTCON_PWM4PHIE_POSITION                       0x2
#define _PWM4INTCON_PWM4PHIE_SIZE                           0x1
#define _PWM4INTCON_PWM4PHIE_LENGTH                         0x1
#define _PWM4INTCON_PWM4PHIE_MASK                           0x4
#define _PWM4INTCON_PWM4OFIE_POSN                           0x3
#define _PWM4INTCON_PWM4OFIE_POSITION                       0x3
#define _PWM4INTCON_PWM4OFIE_SIZE                           0x1
#define _PWM4INTCON_PWM4OFIE_LENGTH                         0x1
#define _PWM4INTCON_PWM4OFIE_MASK                           0x8

// Register: PWM4INTF
#define PWM4INTF PWM4INTF
extern volatile unsigned char           PWM4INTF            @ 0xDCD;
#ifndef _LIB_BUILD
asm("PWM4INTF equ 0DCDh");
#endif
// aliases
extern volatile unsigned char           PWM4INTFLG          @ 0xDCD;
#ifndef _LIB_BUILD
asm("PWM4INTFLG equ 0DCDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM4PRIF               :1;
        unsigned PWM4DCIF               :1;
        unsigned PWM4PHIF               :1;
        unsigned PWM4OFIF               :1;
    };
} PWM4INTFbits_t;
extern volatile PWM4INTFbits_t PWM4INTFbits @ 0xDCD;
// bitfield macros
#define _PWM4INTF_PRIF_POSN                                 0x0
#define _PWM4INTF_PRIF_POSITION                             0x0
#define _PWM4INTF_PRIF_SIZE                                 0x1
#define _PWM4INTF_PRIF_LENGTH                               0x1
#define _PWM4INTF_PRIF_MASK                                 0x1
#define _PWM4INTF_DCIF_POSN                                 0x1
#define _PWM4INTF_DCIF_POSITION                             0x1
#define _PWM4INTF_DCIF_SIZE                                 0x1
#define _PWM4INTF_DCIF_LENGTH                               0x1
#define _PWM4INTF_DCIF_MASK                                 0x2
#define _PWM4INTF_PHIF_POSN                                 0x2
#define _PWM4INTF_PHIF_POSITION                             0x2
#define _PWM4INTF_PHIF_SIZE                                 0x1
#define _PWM4INTF_PHIF_LENGTH                               0x1
#define _PWM4INTF_PHIF_MASK                                 0x4
#define _PWM4INTF_OFIF_POSN                                 0x3
#define _PWM4INTF_OFIF_POSITION                             0x3
#define _PWM4INTF_OFIF_SIZE                                 0x1
#define _PWM4INTF_OFIF_LENGTH                               0x1
#define _PWM4INTF_OFIF_MASK                                 0x8
#define _PWM4INTF_PWM4PRIF_POSN                             0x0
#define _PWM4INTF_PWM4PRIF_POSITION                         0x0
#define _PWM4INTF_PWM4PRIF_SIZE                             0x1
#define _PWM4INTF_PWM4PRIF_LENGTH                           0x1
#define _PWM4INTF_PWM4PRIF_MASK                             0x1
#define _PWM4INTF_PWM4DCIF_POSN                             0x1
#define _PWM4INTF_PWM4DCIF_POSITION                         0x1
#define _PWM4INTF_PWM4DCIF_SIZE                             0x1
#define _PWM4INTF_PWM4DCIF_LENGTH                           0x1
#define _PWM4INTF_PWM4DCIF_MASK                             0x2
#define _PWM4INTF_PWM4PHIF_POSN                             0x2
#define _PWM4INTF_PWM4PHIF_POSITION                         0x2
#define _PWM4INTF_PWM4PHIF_SIZE                             0x1
#define _PWM4INTF_PWM4PHIF_LENGTH                           0x1
#define _PWM4INTF_PWM4PHIF_MASK                             0x4
#define _PWM4INTF_PWM4OFIF_POSN                             0x3
#define _PWM4INTF_PWM4OFIF_POSITION                         0x3
#define _PWM4INTF_PWM4OFIF_SIZE                             0x1
#define _PWM4INTF_PWM4OFIF_LENGTH                           0x1
#define _PWM4INTF_PWM4OFIF_MASK                             0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM4PRIF               :1;
        unsigned PWM4DCIF               :1;
        unsigned PWM4PHIF               :1;
        unsigned PWM4OFIF               :1;
    };
} PWM4INTFLGbits_t;
