daviskung/PIC16F1579_HM.X_2019_0524/mcc_generated_files/pic16f1579_ref.h
extern volatile PWM4INTFLGbits_t PWM4INTFLGbits @ 0xDCD;
// bitfield macros
#define _PWM4INTFLG_PRIF_POSN                               0x0
#define _PWM4INTFLG_PRIF_POSITION                           0x0
#define _PWM4INTFLG_PRIF_SIZE                               0x1
#define _PWM4INTFLG_PRIF_LENGTH                             0x1
#define _PWM4INTFLG_PRIF_MASK                               0x1
#define _PWM4INTFLG_DCIF_POSN                               0x1
#define _PWM4INTFLG_DCIF_POSITION                           0x1
#define _PWM4INTFLG_DCIF_SIZE                               0x1
#define _PWM4INTFLG_DCIF_LENGTH                             0x1
#define _PWM4INTFLG_DCIF_MASK                               0x2
#define _PWM4INTFLG_PHIF_POSN                               0x2
#define _PWM4INTFLG_PHIF_POSITION                           0x2
#define _PWM4INTFLG_PHIF_SIZE                               0x1
#define _PWM4INTFLG_PHIF_LENGTH                             0x1
#define _PWM4INTFLG_PHIF_MASK                               0x4
#define _PWM4INTFLG_OFIF_POSN                               0x3
#define _PWM4INTFLG_OFIF_POSITION                           0x3
#define _PWM4INTFLG_OFIF_SIZE                               0x1
#define _PWM4INTFLG_OFIF_LENGTH                             0x1
#define _PWM4INTFLG_OFIF_MASK                               0x8
#define _PWM4INTFLG_PWM4PRIF_POSN                           0x0
#define _PWM4INTFLG_PWM4PRIF_POSITION                       0x0
#define _PWM4INTFLG_PWM4PRIF_SIZE                           0x1
#define _PWM4INTFLG_PWM4PRIF_LENGTH                         0x1
#define _PWM4INTFLG_PWM4PRIF_MASK                           0x1
#define _PWM4INTFLG_PWM4DCIF_POSN                           0x1
#define _PWM4INTFLG_PWM4DCIF_POSITION                       0x1
#define _PWM4INTFLG_PWM4DCIF_SIZE                           0x1
#define _PWM4INTFLG_PWM4DCIF_LENGTH                         0x1
#define _PWM4INTFLG_PWM4DCIF_MASK                           0x2
#define _PWM4INTFLG_PWM4PHIF_POSN                           0x2
#define _PWM4INTFLG_PWM4PHIF_POSITION                       0x2
#define _PWM4INTFLG_PWM4PHIF_SIZE                           0x1
#define _PWM4INTFLG_PWM4PHIF_LENGTH                         0x1
#define _PWM4INTFLG_PWM4PHIF_MASK                           0x4
#define _PWM4INTFLG_PWM4OFIF_POSN                           0x3
#define _PWM4INTFLG_PWM4OFIF_POSITION                       0x3
#define _PWM4INTFLG_PWM4OFIF_SIZE                           0x1
#define _PWM4INTFLG_PWM4OFIF_LENGTH                         0x1
#define _PWM4INTFLG_PWM4OFIF_MASK                           0x8

// Register: PWM4CLKCON
#define PWM4CLKCON PWM4CLKCON
extern volatile unsigned char           PWM4CLKCON          @ 0xDCE;
#ifndef _LIB_BUILD
asm("PWM4CLKCON equ 0DCEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :2;
        unsigned                        :2;
        unsigned PS                     :3;
    };
    struct {
        unsigned PWM4CS0                :1;
        unsigned PWM4CS1                :1;
        unsigned                        :2;
        unsigned PWM4PS0                :1;
        unsigned PWM4PS1                :1;
        unsigned PWM4PS2                :1;
    };
    struct {
        unsigned PWM4CS                 :3;
        unsigned                        :1;
        unsigned PWM4PS                 :3;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned                        :2;
        unsigned PS0                    :1;
        unsigned PS1                    :1;
        unsigned PS2                    :1;
    };
} PWM4CLKCONbits_t;
extern volatile PWM4CLKCONbits_t PWM4CLKCONbits @ 0xDCE;
// bitfield macros
#define _PWM4CLKCON_CS_POSN                                 0x0
#define _PWM4CLKCON_CS_POSITION                             0x0
#define _PWM4CLKCON_CS_SIZE                                 0x2
#define _PWM4CLKCON_CS_LENGTH                               0x2
#define _PWM4CLKCON_CS_MASK                                 0x3
#define _PWM4CLKCON_PS_POSN                                 0x4
#define _PWM4CLKCON_PS_POSITION                             0x4
#define _PWM4CLKCON_PS_SIZE                                 0x3
#define _PWM4CLKCON_PS_LENGTH                               0x3
#define _PWM4CLKCON_PS_MASK                                 0x70
#define _PWM4CLKCON_PWM4CS0_POSN                            0x0
#define _PWM4CLKCON_PWM4CS0_POSITION                        0x0
#define _PWM4CLKCON_PWM4CS0_SIZE                            0x1
#define _PWM4CLKCON_PWM4CS0_LENGTH                          0x1
#define _PWM4CLKCON_PWM4CS0_MASK                            0x1
#define _PWM4CLKCON_PWM4CS1_POSN                            0x1
#define _PWM4CLKCON_PWM4CS1_POSITION                        0x1
#define _PWM4CLKCON_PWM4CS1_SIZE                            0x1
#define _PWM4CLKCON_PWM4CS1_LENGTH                          0x1
#define _PWM4CLKCON_PWM4CS1_MASK                            0x2
#define _PWM4CLKCON_PWM4PS0_POSN                            0x4
#define _PWM4CLKCON_PWM4PS0_POSITION                        0x4
#define _PWM4CLKCON_PWM4PS0_SIZE                            0x1
#define _PWM4CLKCON_PWM4PS0_LENGTH                          0x1
#define _PWM4CLKCON_PWM4PS0_MASK                            0x10
#define _PWM4CLKCON_PWM4PS1_POSN                            0x5
#define _PWM4CLKCON_PWM4PS1_POSITION                        0x5
#define _PWM4CLKCON_PWM4PS1_SIZE                            0x1
#define _PWM4CLKCON_PWM4PS1_LENGTH                          0x1
#define _PWM4CLKCON_PWM4PS1_MASK                            0x20
#define _PWM4CLKCON_PWM4PS2_POSN                            0x6
#define _PWM4CLKCON_PWM4PS2_POSITION                        0x6
#define _PWM4CLKCON_PWM4PS2_SIZE                            0x1
#define _PWM4CLKCON_PWM4PS2_LENGTH                          0x1
#define _PWM4CLKCON_PWM4PS2_MASK                            0x40
#define _PWM4CLKCON_PWM4CS_POSN                             0x0
#define _PWM4CLKCON_PWM4CS_POSITION                         0x0
#define _PWM4CLKCON_PWM4CS_SIZE                             0x3
#define _PWM4CLKCON_PWM4CS_LENGTH                           0x3
#define _PWM4CLKCON_PWM4CS_MASK                             0x7
#define _PWM4CLKCON_PWM4PS_POSN                             0x4
#define _PWM4CLKCON_PWM4PS_POSITION                         0x4
#define _PWM4CLKCON_PWM4PS_SIZE                             0x3
#define _PWM4CLKCON_PWM4PS_LENGTH                           0x3
#define _PWM4CLKCON_PWM4PS_MASK                             0x70
#define _PWM4CLKCON_CS0_POSN                                0x0
#define _PWM4CLKCON_CS0_POSITION                            0x0
#define _PWM4CLKCON_CS0_SIZE                                0x1
#define _PWM4CLKCON_CS0_LENGTH                              0x1
#define _PWM4CLKCON_CS0_MASK                                0x1
#define _PWM4CLKCON_CS1_POSN                                0x1
#define _PWM4CLKCON_CS1_POSITION                            0x1
#define _PWM4CLKCON_CS1_SIZE                                0x1
#define _PWM4CLKCON_CS1_LENGTH                              0x1
#define _PWM4CLKCON_CS1_MASK                                0x2
#define _PWM4CLKCON_PS0_POSN                                0x4
#define _PWM4CLKCON_PS0_POSITION                            0x4
#define _PWM4CLKCON_PS0_SIZE                                0x1
#define _PWM4CLKCON_PS0_LENGTH                              0x1
#define _PWM4CLKCON_PS0_MASK                                0x10
#define _PWM4CLKCON_PS1_POSN                                0x5
#define _PWM4CLKCON_PS1_POSITION                            0x5
#define _PWM4CLKCON_PS1_SIZE                                0x1
#define _PWM4CLKCON_PS1_LENGTH                              0x1
#define _PWM4CLKCON_PS1_MASK                                0x20
#define _PWM4CLKCON_PS2_POSN                                0x6
#define _PWM4CLKCON_PS2_POSITION                            0x6
#define _PWM4CLKCON_PS2_SIZE                                0x1
#define _PWM4CLKCON_PS2_LENGTH                              0x1
#define _PWM4CLKCON_PS2_MASK                                0x40

// Register: PWM4LDCON
#define PWM4LDCON PWM4LDCON
extern volatile unsigned char           PWM4LDCON           @ 0xDCF;
#ifndef _LIB_BUILD
asm("PWM4LDCON equ 0DCFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :2;
        unsigned                        :4;
        unsigned LDT                    :1;
        unsigned LDA                    :1;
    };
    struct {
        unsigned PWM4LDS0               :1;
        unsigned PWM4LDS1               :1;
    };
    struct {
        unsigned PWM4LDS                :2;
        unsigned                        :4;
        unsigned PWM4LDM                :1;
        unsigned PWM4LD                 :1;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
    };
} PWM4LDCONbits_t;
