daviskung/PIC16F1579_HM.X_2019_0524/mcc_generated_files/pic16f1579_ref.h
extern volatile PWM4LDCONbits_t PWM4LDCONbits @ 0xDCF;
// bitfield macros
#define _PWM4LDCON_LDS_POSN                                 0x0
#define _PWM4LDCON_LDS_POSITION                             0x0
#define _PWM4LDCON_LDS_SIZE                                 0x2
#define _PWM4LDCON_LDS_LENGTH                               0x2
#define _PWM4LDCON_LDS_MASK                                 0x3
#define _PWM4LDCON_LDT_POSN                                 0x6
#define _PWM4LDCON_LDT_POSITION                             0x6
#define _PWM4LDCON_LDT_SIZE                                 0x1
#define _PWM4LDCON_LDT_LENGTH                               0x1
#define _PWM4LDCON_LDT_MASK                                 0x40
#define _PWM4LDCON_LDA_POSN                                 0x7
#define _PWM4LDCON_LDA_POSITION                             0x7
#define _PWM4LDCON_LDA_SIZE                                 0x1
#define _PWM4LDCON_LDA_LENGTH                               0x1
#define _PWM4LDCON_LDA_MASK                                 0x80
#define _PWM4LDCON_PWM4LDS0_POSN                            0x0
#define _PWM4LDCON_PWM4LDS0_POSITION                        0x0
#define _PWM4LDCON_PWM4LDS0_SIZE                            0x1
#define _PWM4LDCON_PWM4LDS0_LENGTH                          0x1
#define _PWM4LDCON_PWM4LDS0_MASK                            0x1
#define _PWM4LDCON_PWM4LDS1_POSN                            0x1
#define _PWM4LDCON_PWM4LDS1_POSITION                        0x1
#define _PWM4LDCON_PWM4LDS1_SIZE                            0x1
#define _PWM4LDCON_PWM4LDS1_LENGTH                          0x1
#define _PWM4LDCON_PWM4LDS1_MASK                            0x2
#define _PWM4LDCON_PWM4LDS_POSN                             0x0
#define _PWM4LDCON_PWM4LDS_POSITION                         0x0
#define _PWM4LDCON_PWM4LDS_SIZE                             0x2
#define _PWM4LDCON_PWM4LDS_LENGTH                           0x2
#define _PWM4LDCON_PWM4LDS_MASK                             0x3
#define _PWM4LDCON_PWM4LDM_POSN                             0x6
#define _PWM4LDCON_PWM4LDM_POSITION                         0x6
#define _PWM4LDCON_PWM4LDM_SIZE                             0x1
#define _PWM4LDCON_PWM4LDM_LENGTH                           0x1
#define _PWM4LDCON_PWM4LDM_MASK                             0x40
#define _PWM4LDCON_PWM4LD_POSN                              0x7
#define _PWM4LDCON_PWM4LD_POSITION                          0x7
#define _PWM4LDCON_PWM4LD_SIZE                              0x1
#define _PWM4LDCON_PWM4LD_LENGTH                            0x1
#define _PWM4LDCON_PWM4LD_MASK                              0x80
#define _PWM4LDCON_LDS0_POSN                                0x0
#define _PWM4LDCON_LDS0_POSITION                            0x0
#define _PWM4LDCON_LDS0_SIZE                                0x1
#define _PWM4LDCON_LDS0_LENGTH                              0x1
#define _PWM4LDCON_LDS0_MASK                                0x1
#define _PWM4LDCON_LDS1_POSN                                0x1
#define _PWM4LDCON_LDS1_POSITION                            0x1
#define _PWM4LDCON_LDS1_SIZE                                0x1
#define _PWM4LDCON_LDS1_LENGTH                              0x1
#define _PWM4LDCON_LDS1_MASK                                0x2

// Register: PWM4OFCON
#define PWM4OFCON PWM4OFCON
extern volatile unsigned char           PWM4OFCON           @ 0xDD0;
#ifndef _LIB_BUILD
asm("PWM4OFCON equ 0DD0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OFS                    :2;
        unsigned                        :2;
        unsigned OFO                    :1;
        unsigned OFM                    :2;
    };
    struct {
        unsigned PWM4OFS0               :1;
        unsigned PWM4OFS1               :1;
        unsigned                        :3;
        unsigned PWM4OFM0               :1;
        unsigned PWM4OFM1               :1;
    };
    struct {
        unsigned PWM4OFS                :2;
        unsigned                        :2;
        unsigned PWM4OFMC               :1;
        unsigned PWM4OFM                :2;
    };
    struct {
        unsigned OFS0                   :1;
        unsigned OFS1                   :1;
        unsigned                        :3;
        unsigned OFM0                   :1;
        unsigned OFM1                   :1;
    };
} PWM4OFCONbits_t;
extern volatile PWM4OFCONbits_t PWM4OFCONbits @ 0xDD0;
// bitfield macros
#define _PWM4OFCON_OFS_POSN                                 0x0
#define _PWM4OFCON_OFS_POSITION                             0x0
#define _PWM4OFCON_OFS_SIZE                                 0x2
#define _PWM4OFCON_OFS_LENGTH                               0x2
#define _PWM4OFCON_OFS_MASK                                 0x3
#define _PWM4OFCON_OFO_POSN                                 0x4
#define _PWM4OFCON_OFO_POSITION                             0x4
#define _PWM4OFCON_OFO_SIZE                                 0x1
#define _PWM4OFCON_OFO_LENGTH                               0x1
#define _PWM4OFCON_OFO_MASK                                 0x10
#define _PWM4OFCON_OFM_POSN                                 0x5
#define _PWM4OFCON_OFM_POSITION                             0x5
#define _PWM4OFCON_OFM_SIZE                                 0x2
#define _PWM4OFCON_OFM_LENGTH                               0x2
#define _PWM4OFCON_OFM_MASK                                 0x60
#define _PWM4OFCON_PWM4OFS0_POSN                            0x0
#define _PWM4OFCON_PWM4OFS0_POSITION                        0x0
#define _PWM4OFCON_PWM4OFS0_SIZE                            0x1
#define _PWM4OFCON_PWM4OFS0_LENGTH                          0x1
#define _PWM4OFCON_PWM4OFS0_MASK                            0x1
#define _PWM4OFCON_PWM4OFS1_POSN                            0x1
#define _PWM4OFCON_PWM4OFS1_POSITION                        0x1
#define _PWM4OFCON_PWM4OFS1_SIZE                            0x1
#define _PWM4OFCON_PWM4OFS1_LENGTH                          0x1
#define _PWM4OFCON_PWM4OFS1_MASK                            0x2
#define _PWM4OFCON_PWM4OFM0_POSN                            0x5
#define _PWM4OFCON_PWM4OFM0_POSITION                        0x5
#define _PWM4OFCON_PWM4OFM0_SIZE                            0x1
#define _PWM4OFCON_PWM4OFM0_LENGTH                          0x1
#define _PWM4OFCON_PWM4OFM0_MASK                            0x20
#define _PWM4OFCON_PWM4OFM1_POSN                            0x6
#define _PWM4OFCON_PWM4OFM1_POSITION                        0x6
#define _PWM4OFCON_PWM4OFM1_SIZE                            0x1
#define _PWM4OFCON_PWM4OFM1_LENGTH                          0x1
#define _PWM4OFCON_PWM4OFM1_MASK                            0x40
#define _PWM4OFCON_PWM4OFS_POSN                             0x0
#define _PWM4OFCON_PWM4OFS_POSITION                         0x0
#define _PWM4OFCON_PWM4OFS_SIZE                             0x2
#define _PWM4OFCON_PWM4OFS_LENGTH                           0x2
#define _PWM4OFCON_PWM4OFS_MASK                             0x3
#define _PWM4OFCON_PWM4OFMC_POSN                            0x4
#define _PWM4OFCON_PWM4OFMC_POSITION                        0x4
#define _PWM4OFCON_PWM4OFMC_SIZE                            0x1
#define _PWM4OFCON_PWM4OFMC_LENGTH                          0x1
#define _PWM4OFCON_PWM4OFMC_MASK                            0x10
#define _PWM4OFCON_PWM4OFM_POSN                             0x5
#define _PWM4OFCON_PWM4OFM_POSITION                         0x5
#define _PWM4OFCON_PWM4OFM_SIZE                             0x2
#define _PWM4OFCON_PWM4OFM_LENGTH                           0x2
#define _PWM4OFCON_PWM4OFM_MASK                             0x60
#define _PWM4OFCON_OFS0_POSN                                0x0
#define _PWM4OFCON_OFS0_POSITION                            0x0
#define _PWM4OFCON_OFS0_SIZE                                0x1
#define _PWM4OFCON_OFS0_LENGTH                              0x1
#define _PWM4OFCON_OFS0_MASK                                0x1
#define _PWM4OFCON_OFS1_POSN                                0x1
#define _PWM4OFCON_OFS1_POSITION                            0x1
#define _PWM4OFCON_OFS1_SIZE                                0x1
#define _PWM4OFCON_OFS1_LENGTH                              0x1
#define _PWM4OFCON_OFS1_MASK                                0x2
#define _PWM4OFCON_OFM0_POSN                                0x5
#define _PWM4OFCON_OFM0_POSITION                            0x5
#define _PWM4OFCON_OFM0_SIZE                                0x1
#define _PWM4OFCON_OFM0_LENGTH                              0x1
#define _PWM4OFCON_OFM0_MASK                                0x20
#define _PWM4OFCON_OFM1_POSN                                0x6
#define _PWM4OFCON_OFM1_POSITION                            0x6
#define _PWM4OFCON_OFM1_SIZE                                0x1
#define _PWM4OFCON_OFM1_LENGTH                              0x1
#define _PWM4OFCON_OFM1_MASK                                0x40

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
extern volatile unsigned char           PPSLOCK             @ 0xE0F;
#ifndef _LIB_BUILD
asm("PPSLOCK equ 0E0Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PPSLOCKED              :1;
    };
} PPSLOCKbits_t;
extern volatile PPSLOCKbits_t PPSLOCKbits @ 0xE0F;
// bitfield macros
#define _PPSLOCK_PPSLOCKED_POSN                             0x0
#define _PPSLOCK_PPSLOCKED_POSITION                         0x0
#define _PPSLOCK_PPSLOCKED_SIZE                             0x1
#define _PPSLOCK_PPSLOCKED_LENGTH                           0x1
#define _PPSLOCK_PPSLOCKED_MASK                             0x1

// Register: INTPPS
#define INTPPS INTPPS
extern volatile unsigned char           INTPPS              @ 0xE10;
#ifndef _LIB_BUILD
asm("INTPPS equ 0E10h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTPPS                 :5;
    };
    struct {
        unsigned INTPPS0                :1;
        unsigned INTPPS1                :1;
        unsigned INTPPS2                :1;
        unsigned INTPPS3                :1;
        unsigned INTPPS4                :1;
    };
} INTPPSbits_t;
extern volatile INTPPSbits_t INTPPSbits @ 0xE10;
// bitfield macros
#define _INTPPS_INTPPS_POSN                                 0x0
#define _INTPPS_INTPPS_POSITION                             0x0
#define _INTPPS_INTPPS_SIZE                                 0x5
#define _INTPPS_INTPPS_LENGTH                               0x5
#define _INTPPS_INTPPS_MASK                                 0x1F
#define _INTPPS_INTPPS0_POSN                                0x0
#define _INTPPS_INTPPS0_POSITION                            0x0
#define _INTPPS_INTPPS0_SIZE                                0x1
#define _INTPPS_INTPPS0_LENGTH                              0x1
#define _INTPPS_INTPPS0_MASK                                0x1
#define _INTPPS_INTPPS1_POSN                                0x1
#define _INTPPS_INTPPS1_POSITION                            0x1
#define _INTPPS_INTPPS1_SIZE                                0x1
#define _INTPPS_INTPPS1_LENGTH                              0x1
#define _INTPPS_INTPPS1_MASK                                0x2
#define _INTPPS_INTPPS2_POSN                                0x2
#define _INTPPS_INTPPS2_POSITION                            0x2
#define _INTPPS_INTPPS2_SIZE                                0x1
#define _INTPPS_INTPPS2_LENGTH                              0x1
#define _INTPPS_INTPPS2_MASK                                0x4
#define _INTPPS_INTPPS3_POSN                                0x3
#define _INTPPS_INTPPS3_POSITION                            0x3
#define _INTPPS_INTPPS3_SIZE                                0x1
#define _INTPPS_INTPPS3_LENGTH                              0x1
#define _INTPPS_INTPPS3_MASK                                0x8
#define _INTPPS_INTPPS4_POSN                                0x4
#define _INTPPS_INTPPS4_POSITION                            0x4
#define _INTPPS_INTPPS4_SIZE                                0x1
#define _INTPPS_INTPPS4_LENGTH                              0x1
#define _INTPPS_INTPPS4_MASK                                0x10

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
extern volatile unsigned char           T0CKIPPS            @ 0xE11;
#ifndef _LIB_BUILD
asm("T0CKIPPS equ 0E11h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T0CKIPPS               :5;
    };
    struct {
        unsigned T0CKIPPS0              :1;
        unsigned T0CKIPPS1              :1;
        unsigned T0CKIPPS2              :1;
        unsigned T0CKIPPS3              :1;
        unsigned T0CKIPPS4              :1;
    };
} T0CKIPPSbits_t;
extern volatile T0CKIPPSbits_t T0CKIPPSbits @ 0xE11;
// bitfield macros
#define _T0CKIPPS_T0CKIPPS_POSN                             0x0
#define _T0CKIPPS_T0CKIPPS_POSITION                         0x0
#define _T0CKIPPS_T0CKIPPS_SIZE                             0x5
#define _T0CKIPPS_T0CKIPPS_LENGTH                           0x5
#define _T0CKIPPS_T0CKIPPS_MASK                             0x1F
#define _T0CKIPPS_T0CKIPPS0_POSN                            0x0
#define _T0CKIPPS_T0CKIPPS0_POSITION                        0x0
#define _T0CKIPPS_T0CKIPPS0_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS0_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS0_MASK                            0x1
#define _T0CKIPPS_T0CKIPPS1_POSN                            0x1
#define _T0CKIPPS_T0CKIPPS1_POSITION                        0x1
#define _T0CKIPPS_T0CKIPPS1_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS1_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS1_MASK                            0x2
#define _T0CKIPPS_T0CKIPPS2_POSN                            0x2
#define _T0CKIPPS_T0CKIPPS2_POSITION                        0x2
#define _T0CKIPPS_T0CKIPPS2_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS2_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS2_MASK                            0x4
#define _T0CKIPPS_T0CKIPPS3_POSN                            0x3
#define _T0CKIPPS_T0CKIPPS3_POSITION                        0x3
#define _T0CKIPPS_T0CKIPPS3_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS3_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS3_MASK                            0x8
#define _T0CKIPPS_T0CKIPPS4_POSN                            0x4
#define _T0CKIPPS_T0CKIPPS4_POSITION                        0x4
#define _T0CKIPPS_T0CKIPPS4_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS4_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS4_MASK                            0x10

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
extern volatile unsigned char           T1CKIPPS            @ 0xE12;
#ifndef _LIB_BUILD
asm("T1CKIPPS equ 0E12h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T1CKIPPS               :5;
    };
    struct {
        unsigned T1CKIPPS0              :1;
        unsigned T1CKIPPS1              :1;
        unsigned T1CKIPPS2              :1;
        unsigned T1CKIPPS3              :1;
        unsigned T1CKIPPS4              :1;
    };
} T1CKIPPSbits_t;
extern volatile T1CKIPPSbits_t T1CKIPPSbits @ 0xE12;
// bitfield macros
#define _T1CKIPPS_T1CKIPPS_POSN                             0x0
#define _T1CKIPPS_T1CKIPPS_POSITION                         0x0
#define _T1CKIPPS_T1CKIPPS_SIZE                             0x5
#define _T1CKIPPS_T1CKIPPS_LENGTH                           0x5
#define _T1CKIPPS_T1CKIPPS_MASK                             0x1F
#define _T1CKIPPS_T1CKIPPS0_POSN                            0x0
#define _T1CKIPPS_T1CKIPPS0_POSITION                        0x0
#define _T1CKIPPS_T1CKIPPS0_SIZE                            0x1
#define _T1CKIPPS_T1CKIPPS0_LENGTH                          0x1
#define _T1CKIPPS_T1CKIPPS0_MASK                            0x1
#define _T1CKIPPS_T1CKIPPS1_POSN                            0x1
#define _T1CKIPPS_T1CKIPPS1_POSITION                        0x1
#define _T1CKIPPS_T1CKIPPS1_SIZE                            0x1
#define _T1CKIPPS_T1CKIPPS1_LENGTH                          0x1
#define _T1CKIPPS_T1CKIPPS1_MASK                            0x2
#define _T1CKIPPS_T1CKIPPS2_POSN                            0x2
#define _T1CKIPPS_T1CKIPPS2_POSITION                        0x2
#define _T1CKIPPS_T1CKIPPS2_SIZE                            0x1
#define _T1CKIPPS_T1CKIPPS2_LENGTH                          0x1
#define _T1CKIPPS_T1CKIPPS2_MASK                            0x4
#define _T1CKIPPS_T1CKIPPS3_POSN                            0x3
#define _T1CKIPPS_T1CKIPPS3_POSITION                        0x3
#define _T1CKIPPS_T1CKIPPS3_SIZE                            0x1
#define _T1CKIPPS_T1CKIPPS3_LENGTH                          0x1
#define _T1CKIPPS_T1CKIPPS3_MASK                            0x8
#define _T1CKIPPS_T1CKIPPS4_POSN                            0x4
#define _T1CKIPPS_T1CKIPPS4_POSITION                        0x4
#define _T1CKIPPS_T1CKIPPS4_SIZE                            0x1
#define _T1CKIPPS_T1CKIPPS4_LENGTH                          0x1
#define _T1CKIPPS_T1CKIPPS4_MASK                            0x10

// Register: T1GPPS
#define T1GPPS T1GPPS
extern volatile unsigned char           T1GPPS              @ 0xE13;
#ifndef _LIB_BUILD
asm("T1GPPS equ 0E13h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T1GPPS                 :5;
    };
    struct {
        unsigned T1GPPS0                :1;
        unsigned T1GPPS1                :1;
        unsigned T1GPPS2                :1;
        unsigned T1GPPS3                :1;
        unsigned T1GPPS4                :1;
    };
} T1GPPSbits_t;
extern volatile T1GPPSbits_t T1GPPSbits @ 0xE13;
// bitfield macros
#define _T1GPPS_T1GPPS_POSN                                 0x0
#define _T1GPPS_T1GPPS_POSITION                             0x0
#define _T1GPPS_T1GPPS_SIZE                                 0x5
#define _T1GPPS_T1GPPS_LENGTH                               0x5
#define _T1GPPS_T1GPPS_MASK                                 0x1F
#define _T1GPPS_T1GPPS0_POSN                                0x0
#define _T1GPPS_T1GPPS0_POSITION                            0x0
#define _T1GPPS_T1GPPS0_SIZE                                0x1
#define _T1GPPS_T1GPPS0_LENGTH                              0x1
#define _T1GPPS_T1GPPS0_MASK                                0x1
#define _T1GPPS_T1GPPS1_POSN                                0x1
#define _T1GPPS_T1GPPS1_POSITION                            0x1
#define _T1GPPS_T1GPPS1_SIZE                                0x1
#define _T1GPPS_T1GPPS1_LENGTH                              0x1
#define _T1GPPS_T1GPPS1_MASK                                0x2
#define _T1GPPS_T1GPPS2_POSN                                0x2
#define _T1GPPS_T1GPPS2_POSITION                            0x2
#define _T1GPPS_T1GPPS2_SIZE                                0x1
#define _T1GPPS_T1GPPS2_LENGTH                              0x1
#define _T1GPPS_T1GPPS2_MASK                                0x4
#define _T1GPPS_T1GPPS3_POSN                                0x3
#define _T1GPPS_T1GPPS3_POSITION                            0x3
#define _T1GPPS_T1GPPS3_SIZE                                0x1
#define _T1GPPS_T1GPPS3_LENGTH                              0x1
#define _T1GPPS_T1GPPS3_MASK                                0x8
#define _T1GPPS_T1GPPS4_POSN                                0x4
#define _T1GPPS_T1GPPS4_POSITION                            0x4
#define _T1GPPS_T1GPPS4_SIZE                                0x1
#define _T1GPPS_T1GPPS4_LENGTH                              0x1
#define _T1GPPS_T1GPPS4_MASK                                0x10

// Register: CWG1INPPS
#define CWG1INPPS CWG1INPPS
extern volatile unsigned char           CWG1INPPS           @ 0xE14;
#ifndef _LIB_BUILD
asm("CWG1INPPS equ 0E14h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWG1INPPS              :5;
    };
    struct {
        unsigned CWG1INPPS0             :1;
        unsigned CWG1INPPS1             :1;
        unsigned CWG1INPPS2             :1;
        unsigned CWG1INPPS3             :1;
        unsigned CWG1INPPS4             :1;
    };
} CWG1INPPSbits_t;
extern volatile CWG1INPPSbits_t CWG1INPPSbits @ 0xE14;
// bitfield macros
#define _CWG1INPPS_CWG1INPPS_POSN                           0x0
#define _CWG1INPPS_CWG1INPPS_POSITION                       0x0
#define _CWG1INPPS_CWG1INPPS_SIZE                           0x5
#define _CWG1INPPS_CWG1INPPS_LENGTH                         0x5
#define _CWG1INPPS_CWG1INPPS_MASK                           0x1F
#define _CWG1INPPS_CWG1INPPS0_POSN                          0x0
#define _CWG1INPPS_CWG1INPPS0_POSITION                      0x0
#define _CWG1INPPS_CWG1INPPS0_SIZE                          0x1
#define _CWG1INPPS_CWG1INPPS0_LENGTH                        0x1
#define _CWG1INPPS_CWG1INPPS0_MASK                          0x1
#define _CWG1INPPS_CWG1INPPS1_POSN                          0x1
#define _CWG1INPPS_CWG1INPPS1_POSITION                      0x1
#define _CWG1INPPS_CWG1INPPS1_SIZE                          0x1
#define _CWG1INPPS_CWG1INPPS1_LENGTH                        0x1
#define _CWG1INPPS_CWG1INPPS1_MASK                          0x2
#define _CWG1INPPS_CWG1INPPS2_POSN                          0x2
#define _CWG1INPPS_CWG1INPPS2_POSITION                      0x2
#define _CWG1INPPS_CWG1INPPS2_SIZE                          0x1
#define _CWG1INPPS_CWG1INPPS2_LENGTH                        0x1
#define _CWG1INPPS_CWG1INPPS2_MASK                          0x4
#define _CWG1INPPS_CWG1INPPS3_POSN                          0x3
#define _CWG1INPPS_CWG1INPPS3_POSITION                      0x3
#define _CWG1INPPS_CWG1INPPS3_SIZE                          0x1
#define _CWG1INPPS_CWG1INPPS3_LENGTH                        0x1
#define _CWG1INPPS_CWG1INPPS3_MASK                          0x8
#define _CWG1INPPS_CWG1INPPS4_POSN                          0x4
#define _CWG1INPPS_CWG1INPPS4_POSITION                      0x4
#define _CWG1INPPS_CWG1INPPS4_SIZE                          0x1
#define _CWG1INPPS_CWG1INPPS4_LENGTH                        0x1
#define _CWG1INPPS_CWG1INPPS4_MASK                          0x10

// Register: RXPPS
#define RXPPS RXPPS
extern volatile unsigned char           RXPPS               @ 0xE15;
#ifndef _LIB_BUILD
asm("RXPPS equ 0E15h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXPPS                  :5;
    };
    struct {
        unsigned RXPPS0                 :1;
        unsigned RXPPS1                 :1;
        unsigned RXPPS2                 :1;
        unsigned RXPPS3                 :1;
        unsigned RXPPS4                 :1;
    };
} RXPPSbits_t;
