daviskung/PIC16F1579_HM.X_2019_0524/mcc_generated_files/pic16f1579_ref.h
#define                                 LATC2_bit           BANKMASK(LATC), 2
extern volatile __bit                   LATC3               @ (((unsigned) &LATC)*8) + 3;
#define                                 LATC3_bit           BANKMASK(LATC), 3
extern volatile __bit                   LATC4               @ (((unsigned) &LATC)*8) + 4;
#define                                 LATC4_bit           BANKMASK(LATC), 4
extern volatile __bit                   LATC5               @ (((unsigned) &LATC)*8) + 5;
#define                                 LATC5_bit           BANKMASK(LATC), 5
extern volatile __bit                   LATC6               @ (((unsigned) &LATC)*8) + 6;
#define                                 LATC6_bit           BANKMASK(LATC), 6
extern volatile __bit                   LATC7               @ (((unsigned) &LATC)*8) + 7;
#define                                 LATC7_bit           BANKMASK(LATC), 7
extern volatile __bit                   LFIOFR              @ (((unsigned) &OSCSTAT)*8) + 1;
#define                                 LFIOFR_bit          BANKMASK(OSCSTAT), 1
extern volatile __bit                   LWLO                @ (((unsigned) &PMCON1)*8) + 5;
#define                                 LWLO_bit            BANKMASK(PMCON1), 5
extern volatile __bit                   MC1OUT              @ (((unsigned) &CMOUT)*8) + 0;
#define                                 MC1OUT_bit          BANKMASK(CMOUT), 0
extern volatile __bit                   MC2OUT              @ (((unsigned) &CMOUT)*8) + 1;
#define                                 MC2OUT_bit          BANKMASK(CMOUT), 1
extern volatile __bit                   MFIOFR              @ (((unsigned) &OSCSTAT)*8) + 2;
#define                                 MFIOFR_bit          BANKMASK(OSCSTAT), 2
extern volatile __bit                   MPWM1EN             @ (((unsigned) &PWMEN)*8) + 0;
#define                                 MPWM1EN_bit         BANKMASK(PWMEN), 0
extern volatile __bit                   MPWM1LD             @ (((unsigned) &PWMLD)*8) + 0;
#define                                 MPWM1LD_bit         BANKMASK(PWMLD), 0
extern volatile __bit                   MPWM1OUT            @ (((unsigned) &PWMOUT)*8) + 0;
#define                                 MPWM1OUT_bit        BANKMASK(PWMOUT), 0
extern volatile __bit                   MPWM2EN             @ (((unsigned) &PWMEN)*8) + 1;
#define                                 MPWM2EN_bit         BANKMASK(PWMEN), 1
extern volatile __bit                   MPWM2LD             @ (((unsigned) &PWMLD)*8) + 1;
#define                                 MPWM2LD_bit         BANKMASK(PWMLD), 1
extern volatile __bit                   MPWM2OUT            @ (((unsigned) &PWMOUT)*8) + 1;
#define                                 MPWM2OUT_bit        BANKMASK(PWMOUT), 1
extern volatile __bit                   MPWM3EN             @ (((unsigned) &PWMEN)*8) + 2;
#define                                 MPWM3EN_bit         BANKMASK(PWMEN), 2
extern volatile __bit                   MPWM3LD             @ (((unsigned) &PWMLD)*8) + 2;
#define                                 MPWM3LD_bit         BANKMASK(PWMLD), 2
extern volatile __bit                   MPWM3OUT            @ (((unsigned) &PWMOUT)*8) + 2;
#define                                 MPWM3OUT_bit        BANKMASK(PWMOUT), 2
extern volatile __bit                   ODA0                @ (((unsigned) &ODCONA)*8) + 0;
#define                                 ODA0_bit            BANKMASK(ODCONA), 0
extern volatile __bit                   ODA1                @ (((unsigned) &ODCONA)*8) + 1;
#define                                 ODA1_bit            BANKMASK(ODCONA), 1
extern volatile __bit                   ODA2                @ (((unsigned) &ODCONA)*8) + 2;
#define                                 ODA2_bit            BANKMASK(ODCONA), 2
extern volatile __bit                   ODA4                @ (((unsigned) &ODCONA)*8) + 4;
#define                                 ODA4_bit            BANKMASK(ODCONA), 4
extern volatile __bit                   ODA5                @ (((unsigned) &ODCONA)*8) + 5;
#define                                 ODA5_bit            BANKMASK(ODCONA), 5
extern volatile __bit                   ODB4                @ (((unsigned) &ODCONB)*8) + 4;
#define                                 ODB4_bit            BANKMASK(ODCONB), 4
extern volatile __bit                   ODB5                @ (((unsigned) &ODCONB)*8) + 5;
#define                                 ODB5_bit            BANKMASK(ODCONB), 5
extern volatile __bit                   ODB6                @ (((unsigned) &ODCONB)*8) + 6;
#define                                 ODB6_bit            BANKMASK(ODCONB), 6
extern volatile __bit                   ODB7                @ (((unsigned) &ODCONB)*8) + 7;
#define                                 ODB7_bit            BANKMASK(ODCONB), 7
extern volatile __bit                   ODC0                @ (((unsigned) &ODCONC)*8) + 0;
#define                                 ODC0_bit            BANKMASK(ODCONC), 0
extern volatile __bit                   ODC1                @ (((unsigned) &ODCONC)*8) + 1;
#define                                 ODC1_bit            BANKMASK(ODCONC), 1
extern volatile __bit                   ODC2                @ (((unsigned) &ODCONC)*8) + 2;
#define                                 ODC2_bit            BANKMASK(ODCONC), 2
extern volatile __bit                   ODC3                @ (((unsigned) &ODCONC)*8) + 3;
#define                                 ODC3_bit            BANKMASK(ODCONC), 3
extern volatile __bit                   ODC4                @ (((unsigned) &ODCONC)*8) + 4;
#define                                 ODC4_bit            BANKMASK(ODCONC), 4
extern volatile __bit                   ODC5                @ (((unsigned) &ODCONC)*8) + 5;
#define                                 ODC5_bit            BANKMASK(ODCONC), 5
extern volatile __bit                   ODC6                @ (((unsigned) &ODCONC)*8) + 6;
#define                                 ODC6_bit            BANKMASK(ODCONC), 6
extern volatile __bit                   ODC7                @ (((unsigned) &ODCONC)*8) + 7;
#define                                 ODC7_bit            BANKMASK(ODCONC), 7
extern volatile __bit                   OERR                @ (((unsigned) &RCSTA)*8) + 1;
#define                                 OERR_bit            BANKMASK(RCSTA), 1
extern volatile __bit                   OSTS                @ (((unsigned) &OSCSTAT)*8) + 5;
#define                                 OSTS_bit            BANKMASK(OSCSTAT), 5
extern volatile __bit                   PEIE                @ (((unsigned) &INTCON)*8) + 6;
#define                                 PEIE_bit            BANKMASK(INTCON), 6
extern volatile __bit                   PLLR                @ (((unsigned) &OSCSTAT)*8) + 6;
#define                                 PLLR_bit            BANKMASK(OSCSTAT), 6
extern volatile __bit                   PPSLOCKED           @ (((unsigned) &PPSLOCK)*8) + 0;
#define                                 PPSLOCKED_bit       BANKMASK(PPSLOCK), 0
extern volatile __bit                   PSA                 @ (((unsigned) &OPTION_REG)*8) + 3;
#define                                 PSA_bit             BANKMASK(OPTION_REG), 3
extern volatile __bit                   PWM1CS0             @ (((unsigned) &PWM1CLKCON)*8) + 0;
#define                                 PWM1CS0_bit         BANKMASK(PWM1CLKCON), 0
extern volatile __bit                   PWM1CS1             @ (((unsigned) &PWM1CLKCON)*8) + 1;
#define                                 PWM1CS1_bit         BANKMASK(PWM1CLKCON), 1
extern volatile __bit                   PWM1DCH0            @ (((unsigned) &PWM1DCH)*8) + 0;
#define                                 PWM1DCH0_bit        BANKMASK(PWM1DCH), 0
extern volatile __bit                   PWM1DCH1            @ (((unsigned) &PWM1DCH)*8) + 1;
#define                                 PWM1DCH1_bit        BANKMASK(PWM1DCH), 1
extern volatile __bit                   PWM1DCH2            @ (((unsigned) &PWM1DCH)*8) + 2;
#define                                 PWM1DCH2_bit        BANKMASK(PWM1DCH), 2
extern volatile __bit                   PWM1DCH3            @ (((unsigned) &PWM1DCH)*8) + 3;
#define                                 PWM1DCH3_bit        BANKMASK(PWM1DCH), 3
extern volatile __bit                   PWM1DCH4            @ (((unsigned) &PWM1DCH)*8) + 4;
#define                                 PWM1DCH4_bit        BANKMASK(PWM1DCH), 4
extern volatile __bit                   PWM1DCH5            @ (((unsigned) &PWM1DCH)*8) + 5;
#define                                 PWM1DCH5_bit        BANKMASK(PWM1DCH), 5
extern volatile __bit                   PWM1DCH6            @ (((unsigned) &PWM1DCH)*8) + 6;
#define                                 PWM1DCH6_bit        BANKMASK(PWM1DCH), 6
extern volatile __bit                   PWM1DCH7            @ (((unsigned) &PWM1DCH)*8) + 7;
#define                                 PWM1DCH7_bit        BANKMASK(PWM1DCH), 7
extern volatile __bit                   PWM1DCIE            @ (((unsigned) &PWM1INTE)*8) + 1;
#define                                 PWM1DCIE_bit        BANKMASK(PWM1INTE), 1
extern volatile __bit                   PWM1DCIF            @ (((unsigned) &PWM1INTF)*8) + 1;
#define                                 PWM1DCIF_bit        BANKMASK(PWM1INTF), 1
extern volatile __bit                   PWM1DCL0            @ (((unsigned) &PWM1DCL)*8) + 0;
#define                                 PWM1DCL0_bit        BANKMASK(PWM1DCL), 0
extern volatile __bit                   PWM1DCL1            @ (((unsigned) &PWM1DCL)*8) + 1;
#define                                 PWM1DCL1_bit        BANKMASK(PWM1DCL), 1
extern volatile __bit                   PWM1DCL2            @ (((unsigned) &PWM1DCL)*8) + 2;
#define                                 PWM1DCL2_bit        BANKMASK(PWM1DCL), 2
extern volatile __bit                   PWM1DCL3            @ (((unsigned) &PWM1DCL)*8) + 3;
#define                                 PWM1DCL3_bit        BANKMASK(PWM1DCL), 3
extern volatile __bit                   PWM1DCL4            @ (((unsigned) &PWM1DCL)*8) + 4;
#define                                 PWM1DCL4_bit        BANKMASK(PWM1DCL), 4
extern volatile __bit                   PWM1DCL5            @ (((unsigned) &PWM1DCL)*8) + 5;
#define                                 PWM1DCL5_bit        BANKMASK(PWM1DCL), 5
extern volatile __bit                   PWM1DCL6            @ (((unsigned) &PWM1DCL)*8) + 6;
#define                                 PWM1DCL6_bit        BANKMASK(PWM1DCL), 6
extern volatile __bit                   PWM1DCL7            @ (((unsigned) &PWM1DCL)*8) + 7;
#define                                 PWM1DCL7_bit        BANKMASK(PWM1DCL), 7
extern volatile __bit                   PWM1EN              @ (((unsigned) &PWM1CON)*8) + 7;
#define                                 PWM1EN_bit          BANKMASK(PWM1CON), 7
extern volatile __bit                   PWM1EN_A            @ (((unsigned) &PWMEN)*8) + 0;
#define                                 PWM1EN_A_bit        BANKMASK(PWMEN), 0
extern volatile __bit                   PWM1IE              @ (((unsigned) &PIE3)*8) + 4;
#define                                 PWM1IE_bit          BANKMASK(PIE3), 4
extern volatile __bit                   PWM1IF              @ (((unsigned) &PIR3)*8) + 4;
#define                                 PWM1IF_bit          BANKMASK(PIR3), 4
extern volatile __bit                   PWM1LD              @ (((unsigned) &PWM1LDCON)*8) + 7;
#define                                 PWM1LD_bit          BANKMASK(PWM1LDCON), 7
extern volatile __bit                   PWM1LDA_A           @ (((unsigned) &PWMLD)*8) + 0;
#define                                 PWM1LDA_A_bit       BANKMASK(PWMLD), 0
extern volatile __bit                   PWM1LDM             @ (((unsigned) &PWM1LDCON)*8) + 6;
#define                                 PWM1LDM_bit         BANKMASK(PWM1LDCON), 6
extern volatile __bit                   PWM1LDS0            @ (((unsigned) &PWM1LDCON)*8) + 0;
#define                                 PWM1LDS0_bit        BANKMASK(PWM1LDCON), 0
extern volatile __bit                   PWM1LDS1            @ (((unsigned) &PWM1LDCON)*8) + 1;
#define                                 PWM1LDS1_bit        BANKMASK(PWM1LDCON), 1
extern volatile __bit                   PWM1MODE0           @ (((unsigned) &PWM1CON)*8) + 2;
#define                                 PWM1MODE0_bit       BANKMASK(PWM1CON), 2
extern volatile __bit                   PWM1MODE1           @ (((unsigned) &PWM1CON)*8) + 3;
#define                                 PWM1MODE1_bit       BANKMASK(PWM1CON), 3
extern volatile __bit                   PWM1OE              @ (((unsigned) &PWM1CON)*8) + 6;
#define                                 PWM1OE_bit          BANKMASK(PWM1CON), 6
extern volatile __bit                   PWM1OFH0            @ (((unsigned) &PWM1OFH)*8) + 0;
#define                                 PWM1OFH0_bit        BANKMASK(PWM1OFH), 0
extern volatile __bit                   PWM1OFH1            @ (((unsigned) &PWM1OFH)*8) + 1;
#define                                 PWM1OFH1_bit        BANKMASK(PWM1OFH), 1
extern volatile __bit                   PWM1OFH2            @ (((unsigned) &PWM1OFH)*8) + 2;
#define                                 PWM1OFH2_bit        BANKMASK(PWM1OFH), 2
extern volatile __bit                   PWM1OFH3            @ (((unsigned) &PWM1OFH)*8) + 3;
#define                                 PWM1OFH3_bit        BANKMASK(PWM1OFH), 3
extern volatile __bit                   PWM1OFH4            @ (((unsigned) &PWM1OFH)*8) + 4;
#define                                 PWM1OFH4_bit        BANKMASK(PWM1OFH), 4
extern volatile __bit                   PWM1OFH5            @ (((unsigned) &PWM1OFH)*8) + 5;
#define                                 PWM1OFH5_bit        BANKMASK(PWM1OFH), 5
extern volatile __bit                   PWM1OFH6            @ (((unsigned) &PWM1OFH)*8) + 6;
#define                                 PWM1OFH6_bit        BANKMASK(PWM1OFH), 6
extern volatile __bit                   PWM1OFH7            @ (((unsigned) &PWM1OFH)*8) + 7;
#define                                 PWM1OFH7_bit        BANKMASK(PWM1OFH), 7
extern volatile __bit                   PWM1OFIE            @ (((unsigned) &PWM1INTE)*8) + 3;
#define                                 PWM1OFIE_bit        BANKMASK(PWM1INTE), 3
extern volatile __bit                   PWM1OFIF            @ (((unsigned) &PWM1INTF)*8) + 3;
#define                                 PWM1OFIF_bit        BANKMASK(PWM1INTF), 3
extern volatile __bit                   PWM1OFL0            @ (((unsigned) &PWM1OFL)*8) + 0;
#define                                 PWM1OFL0_bit        BANKMASK(PWM1OFL), 0
extern volatile __bit                   PWM1OFL1            @ (((unsigned) &PWM1OFL)*8) + 1;
#define                                 PWM1OFL1_bit        BANKMASK(PWM1OFL), 1
extern volatile __bit                   PWM1OFL2            @ (((unsigned) &PWM1OFL)*8) + 2;
#define                                 PWM1OFL2_bit        BANKMASK(PWM1OFL), 2
extern volatile __bit                   PWM1OFL3            @ (((unsigned) &PWM1OFL)*8) + 3;
#define                                 PWM1OFL3_bit        BANKMASK(PWM1OFL), 3
extern volatile __bit                   PWM1OFL4            @ (((unsigned) &PWM1OFL)*8) + 4;
#define                                 PWM1OFL4_bit        BANKMASK(PWM1OFL), 4
extern volatile __bit                   PWM1OFL5            @ (((unsigned) &PWM1OFL)*8) + 5;
#define                                 PWM1OFL5_bit        BANKMASK(PWM1OFL), 5
extern volatile __bit                   PWM1OFL6            @ (((unsigned) &PWM1OFL)*8) + 6;
#define                                 PWM1OFL6_bit        BANKMASK(PWM1OFL), 6
extern volatile __bit                   PWM1OFL7            @ (((unsigned) &PWM1OFL)*8) + 7;
#define                                 PWM1OFL7_bit        BANKMASK(PWM1OFL), 7
extern volatile __bit                   PWM1OFM0            @ (((unsigned) &PWM1OFCON)*8) + 5;
#define                                 PWM1OFM0_bit        BANKMASK(PWM1OFCON), 5
extern volatile __bit                   PWM1OFM1            @ (((unsigned) &PWM1OFCON)*8) + 6;
#define                                 PWM1OFM1_bit        BANKMASK(PWM1OFCON), 6
extern volatile __bit                   PWM1OFMC            @ (((unsigned) &PWM1OFCON)*8) + 4;
#define                                 PWM1OFMC_bit        BANKMASK(PWM1OFCON), 4
extern volatile __bit                   PWM1OFS0            @ (((unsigned) &PWM1OFCON)*8) + 0;
#define                                 PWM1OFS0_bit        BANKMASK(PWM1OFCON), 0
extern volatile __bit                   PWM1OFS1            @ (((unsigned) &PWM1OFCON)*8) + 1;
#define                                 PWM1OFS1_bit        BANKMASK(PWM1OFCON), 1
extern volatile __bit                   PWM1OUT             @ (((unsigned) &PWM1CON)*8) + 5;
#define                                 PWM1OUT_bit         BANKMASK(PWM1CON), 5
extern volatile __bit                   PWM1OUT_A           @ (((unsigned) &PWMOUT)*8) + 0;
#define                                 PWM1OUT_A_bit       BANKMASK(PWMOUT), 0
extern volatile __bit                   PWM1PHH0            @ (((unsigned) &PWM1PHH)*8) + 0;
#define                                 PWM1PHH0_bit        BANKMASK(PWM1PHH), 0
extern volatile __bit                   PWM1PHH1            @ (((unsigned) &PWM1PHH)*8) + 1;
#define                                 PWM1PHH1_bit        BANKMASK(PWM1PHH), 1
extern volatile __bit                   PWM1PHH2            @ (((unsigned) &PWM1PHH)*8) + 2;
#define                                 PWM1PHH2_bit        BANKMASK(PWM1PHH), 2
extern volatile __bit                   PWM1PHH3            @ (((unsigned) &PWM1PHH)*8) + 3;
#define                                 PWM1PHH3_bit        BANKMASK(PWM1PHH), 3
extern volatile __bit                   PWM1PHH4            @ (((unsigned) &PWM1PHH)*8) + 4;
#define                                 PWM1PHH4_bit        BANKMASK(PWM1PHH), 4
extern volatile __bit                   PWM1PHH5            @ (((unsigned) &PWM1PHH)*8) + 5;
#define                                 PWM1PHH5_bit        BANKMASK(PWM1PHH), 5
extern volatile __bit                   PWM1PHH6            @ (((unsigned) &PWM1PHH)*8) + 6;
#define                                 PWM1PHH6_bit        BANKMASK(PWM1PHH), 6
extern volatile __bit                   PWM1PHH7            @ (((unsigned) &PWM1PHH)*8) + 7;
#define                                 PWM1PHH7_bit        BANKMASK(PWM1PHH), 7
extern volatile __bit                   PWM1PHIE            @ (((unsigned) &PWM1INTE)*8) + 2;
#define                                 PWM1PHIE_bit        BANKMASK(PWM1INTE), 2
extern volatile __bit                   PWM1PHIF            @ (((unsigned) &PWM1INTF)*8) + 2;
#define                                 PWM1PHIF_bit        BANKMASK(PWM1INTF), 2
extern volatile __bit                   PWM1PHL0            @ (((unsigned) &PWM1PHL)*8) + 0;
#define                                 PWM1PHL0_bit        BANKMASK(PWM1PHL), 0
extern volatile __bit                   PWM1PHL1            @ (((unsigned) &PWM1PHL)*8) + 1;
#define                                 PWM1PHL1_bit        BANKMASK(PWM1PHL), 1
extern volatile __bit                   PWM1PHL2            @ (((unsigned) &PWM1PHL)*8) + 2;
#define                                 PWM1PHL2_bit        BANKMASK(PWM1PHL), 2
extern volatile __bit                   PWM1PHL3            @ (((unsigned) &PWM1PHL)*8) + 3;
#define                                 PWM1PHL3_bit        BANKMASK(PWM1PHL), 3
extern volatile __bit                   PWM1PHL4            @ (((unsigned) &PWM1PHL)*8) + 4;
#define                                 PWM1PHL4_bit        BANKMASK(PWM1PHL), 4
extern volatile __bit                   PWM1PHL5            @ (((unsigned) &PWM1PHL)*8) + 5;
#define                                 PWM1PHL5_bit        BANKMASK(PWM1PHL), 5
extern volatile __bit                   PWM1PHL6            @ (((unsigned) &PWM1PHL)*8) + 6;
#define                                 PWM1PHL6_bit        BANKMASK(PWM1PHL), 6
extern volatile __bit                   PWM1PHL7            @ (((unsigned) &PWM1PHL)*8) + 7;
#define                                 PWM1PHL7_bit        BANKMASK(PWM1PHL), 7
extern volatile __bit                   PWM1POL             @ (((unsigned) &PWM1CON)*8) + 4;
#define                                 PWM1POL_bit         BANKMASK(PWM1CON), 4
extern volatile __bit                   PWM1PRH0            @ (((unsigned) &PWM1PRH)*8) + 0;
#define                                 PWM1PRH0_bit        BANKMASK(PWM1PRH), 0
extern volatile __bit                   PWM1PRH1            @ (((unsigned) &PWM1PRH)*8) + 1;
#define                                 PWM1PRH1_bit        BANKMASK(PWM1PRH), 1
extern volatile __bit                   PWM1PRH2            @ (((unsigned) &PWM1PRH)*8) + 2;
#define                                 PWM1PRH2_bit        BANKMASK(PWM1PRH), 2
extern volatile __bit                   PWM1PRH3            @ (((unsigned) &PWM1PRH)*8) + 3;
#define                                 PWM1PRH3_bit        BANKMASK(PWM1PRH), 3
extern volatile __bit                   PWM1PRH4            @ (((unsigned) &PWM1PRH)*8) + 4;
#define                                 PWM1PRH4_bit        BANKMASK(PWM1PRH), 4
extern volatile __bit                   PWM1PRH5            @ (((unsigned) &PWM1PRH)*8) + 5;
#define                                 PWM1PRH5_bit        BANKMASK(PWM1PRH), 5
extern volatile __bit                   PWM1PRH6            @ (((unsigned) &PWM1PRH)*8) + 6;
#define                                 PWM1PRH6_bit        BANKMASK(PWM1PRH), 6
extern volatile __bit                   PWM1PRH7            @ (((unsigned) &PWM1PRH)*8) + 7;
#define                                 PWM1PRH7_bit        BANKMASK(PWM1PRH), 7
extern volatile __bit                   PWM1PRIE            @ (((unsigned) &PWM1INTE)*8) + 0;
#define                                 PWM1PRIE_bit        BANKMASK(PWM1INTE), 0
extern volatile __bit                   PWM1PRIF            @ (((unsigned) &PWM1INTF)*8) + 0;
#define                                 PWM1PRIF_bit        BANKMASK(PWM1INTF), 0
extern volatile __bit                   PWM1PRL0            @ (((unsigned) &PWM1PRL)*8) + 0;
#define                                 PWM1PRL0_bit        BANKMASK(PWM1PRL), 0
extern volatile __bit                   PWM1PRL1            @ (((unsigned) &PWM1PRL)*8) + 1;
#define                                 PWM1PRL1_bit        BANKMASK(PWM1PRL), 1
extern volatile __bit                   PWM1PRL2            @ (((unsigned) &PWM1PRL)*8) + 2;
#define                                 PWM1PRL2_bit        BANKMASK(PWM1PRL), 2
extern volatile __bit                   PWM1PRL3            @ (((unsigned) &PWM1PRL)*8) + 3;
#define                                 PWM1PRL3_bit        BANKMASK(PWM1PRL), 3
extern volatile __bit                   PWM1PRL4            @ (((unsigned) &PWM1PRL)*8) + 4;
#define                                 PWM1PRL4_bit        BANKMASK(PWM1PRL), 4
extern volatile __bit                   PWM1PRL5            @ (((unsigned) &PWM1PRL)*8) + 5;
#define                                 PWM1PRL5_bit        BANKMASK(PWM1PRL), 5
extern volatile __bit                   PWM1PRL6            @ (((unsigned) &PWM1PRL)*8) + 6;
#define                                 PWM1PRL6_bit        BANKMASK(PWM1PRL), 6
extern volatile __bit                   PWM1PRL7            @ (((unsigned) &PWM1PRL)*8) + 7;
#define                                 PWM1PRL7_bit        BANKMASK(PWM1PRL), 7
extern volatile __bit                   PWM1PS0             @ (((unsigned) &PWM1CLKCON)*8) + 4;
#define                                 PWM1PS0_bit         BANKMASK(PWM1CLKCON), 4
extern volatile __bit                   PWM1PS1             @ (((unsigned) &PWM1CLKCON)*8) + 5;
