daviskung/PIC16F1579_HM.X_2019_0524/mcc_generated_files/pic16f1579_ref.h
#define                                 PWM1PS1_bit         BANKMASK(PWM1CLKCON), 5
extern volatile __bit                   PWM1PS2             @ (((unsigned) &PWM1CLKCON)*8) + 6;
#define                                 PWM1PS2_bit         BANKMASK(PWM1CLKCON), 6
extern volatile __bit                   PWM1TMRH0           @ (((unsigned) &PWM1TMRH)*8) + 0;
#define                                 PWM1TMRH0_bit       BANKMASK(PWM1TMRH), 0
extern volatile __bit                   PWM1TMRH1           @ (((unsigned) &PWM1TMRH)*8) + 1;
#define                                 PWM1TMRH1_bit       BANKMASK(PWM1TMRH), 1
extern volatile __bit                   PWM1TMRH2           @ (((unsigned) &PWM1TMRH)*8) + 2;
#define                                 PWM1TMRH2_bit       BANKMASK(PWM1TMRH), 2
extern volatile __bit                   PWM1TMRH3           @ (((unsigned) &PWM1TMRH)*8) + 3;
#define                                 PWM1TMRH3_bit       BANKMASK(PWM1TMRH), 3
extern volatile __bit                   PWM1TMRH4           @ (((unsigned) &PWM1TMRH)*8) + 4;
#define                                 PWM1TMRH4_bit       BANKMASK(PWM1TMRH), 4
extern volatile __bit                   PWM1TMRH5           @ (((unsigned) &PWM1TMRH)*8) + 5;
#define                                 PWM1TMRH5_bit       BANKMASK(PWM1TMRH), 5
extern volatile __bit                   PWM1TMRH6           @ (((unsigned) &PWM1TMRH)*8) + 6;
#define                                 PWM1TMRH6_bit       BANKMASK(PWM1TMRH), 6
extern volatile __bit                   PWM1TMRH7           @ (((unsigned) &PWM1TMRH)*8) + 7;
#define                                 PWM1TMRH7_bit       BANKMASK(PWM1TMRH), 7
extern volatile __bit                   PWM1TMRL0           @ (((unsigned) &PWM1TMRL)*8) + 0;
#define                                 PWM1TMRL0_bit       BANKMASK(PWM1TMRL), 0
extern volatile __bit                   PWM1TMRL1           @ (((unsigned) &PWM1TMRL)*8) + 1;
#define                                 PWM1TMRL1_bit       BANKMASK(PWM1TMRL), 1
extern volatile __bit                   PWM1TMRL2           @ (((unsigned) &PWM1TMRL)*8) + 2;
#define                                 PWM1TMRL2_bit       BANKMASK(PWM1TMRL), 2
extern volatile __bit                   PWM1TMRL3           @ (((unsigned) &PWM1TMRL)*8) + 3;
#define                                 PWM1TMRL3_bit       BANKMASK(PWM1TMRL), 3
extern volatile __bit                   PWM1TMRL4           @ (((unsigned) &PWM1TMRL)*8) + 4;
#define                                 PWM1TMRL4_bit       BANKMASK(PWM1TMRL), 4
extern volatile __bit                   PWM1TMRL5           @ (((unsigned) &PWM1TMRL)*8) + 5;
#define                                 PWM1TMRL5_bit       BANKMASK(PWM1TMRL), 5
extern volatile __bit                   PWM1TMRL6           @ (((unsigned) &PWM1TMRL)*8) + 6;
#define                                 PWM1TMRL6_bit       BANKMASK(PWM1TMRL), 6
extern volatile __bit                   PWM1TMRL7           @ (((unsigned) &PWM1TMRL)*8) + 7;
#define                                 PWM1TMRL7_bit       BANKMASK(PWM1TMRL), 7
extern volatile __bit                   PWM2CS0             @ (((unsigned) &PWM2CLKCON)*8) + 0;
#define                                 PWM2CS0_bit         BANKMASK(PWM2CLKCON), 0
extern volatile __bit                   PWM2CS1             @ (((unsigned) &PWM2CLKCON)*8) + 1;
#define                                 PWM2CS1_bit         BANKMASK(PWM2CLKCON), 1
extern volatile __bit                   PWM2DCH0            @ (((unsigned) &PWM2DCH)*8) + 0;
#define                                 PWM2DCH0_bit        BANKMASK(PWM2DCH), 0
extern volatile __bit                   PWM2DCH1            @ (((unsigned) &PWM2DCH)*8) + 1;
#define                                 PWM2DCH1_bit        BANKMASK(PWM2DCH), 1
extern volatile __bit                   PWM2DCH2            @ (((unsigned) &PWM2DCH)*8) + 2;
#define                                 PWM2DCH2_bit        BANKMASK(PWM2DCH), 2
extern volatile __bit                   PWM2DCH3            @ (((unsigned) &PWM2DCH)*8) + 3;
#define                                 PWM2DCH3_bit        BANKMASK(PWM2DCH), 3
extern volatile __bit                   PWM2DCH4            @ (((unsigned) &PWM2DCH)*8) + 4;
#define                                 PWM2DCH4_bit        BANKMASK(PWM2DCH), 4
extern volatile __bit                   PWM2DCH5            @ (((unsigned) &PWM2DCH)*8) + 5;
#define                                 PWM2DCH5_bit        BANKMASK(PWM2DCH), 5
extern volatile __bit                   PWM2DCH6            @ (((unsigned) &PWM2DCH)*8) + 6;
#define                                 PWM2DCH6_bit        BANKMASK(PWM2DCH), 6
extern volatile __bit                   PWM2DCH7            @ (((unsigned) &PWM2DCH)*8) + 7;
#define                                 PWM2DCH7_bit        BANKMASK(PWM2DCH), 7
extern volatile __bit                   PWM2DCIE            @ (((unsigned) &PWM2INTE)*8) + 1;
#define                                 PWM2DCIE_bit        BANKMASK(PWM2INTE), 1
extern volatile __bit                   PWM2DCIF            @ (((unsigned) &PWM2INTF)*8) + 1;
#define                                 PWM2DCIF_bit        BANKMASK(PWM2INTF), 1
extern volatile __bit                   PWM2DCL0            @ (((unsigned) &PWM2DCL)*8) + 0;
#define                                 PWM2DCL0_bit        BANKMASK(PWM2DCL), 0
extern volatile __bit                   PWM2DCL1            @ (((unsigned) &PWM2DCL)*8) + 1;
#define                                 PWM2DCL1_bit        BANKMASK(PWM2DCL), 1
extern volatile __bit                   PWM2DCL2            @ (((unsigned) &PWM2DCL)*8) + 2;
#define                                 PWM2DCL2_bit        BANKMASK(PWM2DCL), 2
extern volatile __bit                   PWM2DCL3            @ (((unsigned) &PWM2DCL)*8) + 3;
#define                                 PWM2DCL3_bit        BANKMASK(PWM2DCL), 3
extern volatile __bit                   PWM2DCL4            @ (((unsigned) &PWM2DCL)*8) + 4;
#define                                 PWM2DCL4_bit        BANKMASK(PWM2DCL), 4
extern volatile __bit                   PWM2DCL5            @ (((unsigned) &PWM2DCL)*8) + 5;
#define                                 PWM2DCL5_bit        BANKMASK(PWM2DCL), 5
extern volatile __bit                   PWM2DCL6            @ (((unsigned) &PWM2DCL)*8) + 6;
#define                                 PWM2DCL6_bit        BANKMASK(PWM2DCL), 6
extern volatile __bit                   PWM2DCL7            @ (((unsigned) &PWM2DCL)*8) + 7;
#define                                 PWM2DCL7_bit        BANKMASK(PWM2DCL), 7
extern volatile __bit                   PWM2EN              @ (((unsigned) &PWM2CON)*8) + 7;
#define                                 PWM2EN_bit          BANKMASK(PWM2CON), 7
extern volatile __bit                   PWM2EN_A            @ (((unsigned) &PWMEN)*8) + 1;
#define                                 PWM2EN_A_bit        BANKMASK(PWMEN), 1
extern volatile __bit                   PWM2IE              @ (((unsigned) &PIE3)*8) + 5;
#define                                 PWM2IE_bit          BANKMASK(PIE3), 5
extern volatile __bit                   PWM2IF              @ (((unsigned) &PIR3)*8) + 5;
#define                                 PWM2IF_bit          BANKMASK(PIR3), 5
extern volatile __bit                   PWM2LD              @ (((unsigned) &PWM2LDCON)*8) + 7;
#define                                 PWM2LD_bit          BANKMASK(PWM2LDCON), 7
extern volatile __bit                   PWM2LDA_A           @ (((unsigned) &PWMLD)*8) + 1;
#define                                 PWM2LDA_A_bit       BANKMASK(PWMLD), 1
extern volatile __bit                   PWM2LDM             @ (((unsigned) &PWM2LDCON)*8) + 6;
#define                                 PWM2LDM_bit         BANKMASK(PWM2LDCON), 6
extern volatile __bit                   PWM2LDS0            @ (((unsigned) &PWM2LDCON)*8) + 0;
#define                                 PWM2LDS0_bit        BANKMASK(PWM2LDCON), 0
extern volatile __bit                   PWM2LDS1            @ (((unsigned) &PWM2LDCON)*8) + 1;
#define                                 PWM2LDS1_bit        BANKMASK(PWM2LDCON), 1
extern volatile __bit                   PWM2MODE0           @ (((unsigned) &PWM2CON)*8) + 2;
#define                                 PWM2MODE0_bit       BANKMASK(PWM2CON), 2
extern volatile __bit                   PWM2MODE1           @ (((unsigned) &PWM2CON)*8) + 3;
#define                                 PWM2MODE1_bit       BANKMASK(PWM2CON), 3
extern volatile __bit                   PWM2OE              @ (((unsigned) &PWM2CON)*8) + 6;
#define                                 PWM2OE_bit          BANKMASK(PWM2CON), 6
extern volatile __bit                   PWM2OFH0            @ (((unsigned) &PWM2OFH)*8) + 0;
#define                                 PWM2OFH0_bit        BANKMASK(PWM2OFH), 0
extern volatile __bit                   PWM2OFH1            @ (((unsigned) &PWM2OFH)*8) + 1;
#define                                 PWM2OFH1_bit        BANKMASK(PWM2OFH), 1
extern volatile __bit                   PWM2OFH2            @ (((unsigned) &PWM2OFH)*8) + 2;
#define                                 PWM2OFH2_bit        BANKMASK(PWM2OFH), 2
extern volatile __bit                   PWM2OFH3            @ (((unsigned) &PWM2OFH)*8) + 3;
#define                                 PWM2OFH3_bit        BANKMASK(PWM2OFH), 3
extern volatile __bit                   PWM2OFH4            @ (((unsigned) &PWM2OFH)*8) + 4;
#define                                 PWM2OFH4_bit        BANKMASK(PWM2OFH), 4
extern volatile __bit                   PWM2OFH5            @ (((unsigned) &PWM2OFH)*8) + 5;
#define                                 PWM2OFH5_bit        BANKMASK(PWM2OFH), 5
extern volatile __bit                   PWM2OFH6            @ (((unsigned) &PWM2OFH)*8) + 6;
#define                                 PWM2OFH6_bit        BANKMASK(PWM2OFH), 6
extern volatile __bit                   PWM2OFH7            @ (((unsigned) &PWM2OFH)*8) + 7;
#define                                 PWM2OFH7_bit        BANKMASK(PWM2OFH), 7
extern volatile __bit                   PWM2OFIE            @ (((unsigned) &PWM2INTE)*8) + 3;
#define                                 PWM2OFIE_bit        BANKMASK(PWM2INTE), 3
extern volatile __bit                   PWM2OFIF            @ (((unsigned) &PWM2INTF)*8) + 3;
#define                                 PWM2OFIF_bit        BANKMASK(PWM2INTF), 3
extern volatile __bit                   PWM2OFL0            @ (((unsigned) &PWM2OFL)*8) + 0;
#define                                 PWM2OFL0_bit        BANKMASK(PWM2OFL), 0
extern volatile __bit                   PWM2OFL1            @ (((unsigned) &PWM2OFL)*8) + 1;
#define                                 PWM2OFL1_bit        BANKMASK(PWM2OFL), 1
extern volatile __bit                   PWM2OFL2            @ (((unsigned) &PWM2OFL)*8) + 2;
#define                                 PWM2OFL2_bit        BANKMASK(PWM2OFL), 2
extern volatile __bit                   PWM2OFL3            @ (((unsigned) &PWM2OFL)*8) + 3;
#define                                 PWM2OFL3_bit        BANKMASK(PWM2OFL), 3
extern volatile __bit                   PWM2OFL4            @ (((unsigned) &PWM2OFL)*8) + 4;
#define                                 PWM2OFL4_bit        BANKMASK(PWM2OFL), 4
extern volatile __bit                   PWM2OFL5            @ (((unsigned) &PWM2OFL)*8) + 5;
#define                                 PWM2OFL5_bit        BANKMASK(PWM2OFL), 5
extern volatile __bit                   PWM2OFL6            @ (((unsigned) &PWM2OFL)*8) + 6;
#define                                 PWM2OFL6_bit        BANKMASK(PWM2OFL), 6
extern volatile __bit                   PWM2OFL7            @ (((unsigned) &PWM2OFL)*8) + 7;
#define                                 PWM2OFL7_bit        BANKMASK(PWM2OFL), 7
extern volatile __bit                   PWM2OFM0            @ (((unsigned) &PWM2OFCON)*8) + 5;
#define                                 PWM2OFM0_bit        BANKMASK(PWM2OFCON), 5
extern volatile __bit                   PWM2OFM1            @ (((unsigned) &PWM2OFCON)*8) + 6;
#define                                 PWM2OFM1_bit        BANKMASK(PWM2OFCON), 6
extern volatile __bit                   PWM2OFMC            @ (((unsigned) &PWM2OFCON)*8) + 4;
#define                                 PWM2OFMC_bit        BANKMASK(PWM2OFCON), 4
extern volatile __bit                   PWM2OFS0            @ (((unsigned) &PWM2OFCON)*8) + 0;
#define                                 PWM2OFS0_bit        BANKMASK(PWM2OFCON), 0
extern volatile __bit                   PWM2OFS1            @ (((unsigned) &PWM2OFCON)*8) + 1;
#define                                 PWM2OFS1_bit        BANKMASK(PWM2OFCON), 1
extern volatile __bit                   PWM2OUT             @ (((unsigned) &PWM2CON)*8) + 5;
#define                                 PWM2OUT_bit         BANKMASK(PWM2CON), 5
extern volatile __bit                   PWM2OUT_A           @ (((unsigned) &PWMOUT)*8) + 1;
#define                                 PWM2OUT_A_bit       BANKMASK(PWMOUT), 1
extern volatile __bit                   PWM2PHH0            @ (((unsigned) &PWM2PHH)*8) + 0;
#define                                 PWM2PHH0_bit        BANKMASK(PWM2PHH), 0
extern volatile __bit                   PWM2PHH1            @ (((unsigned) &PWM2PHH)*8) + 1;
#define                                 PWM2PHH1_bit        BANKMASK(PWM2PHH), 1
extern volatile __bit                   PWM2PHH2            @ (((unsigned) &PWM2PHH)*8) + 2;
#define                                 PWM2PHH2_bit        BANKMASK(PWM2PHH), 2
extern volatile __bit                   PWM2PHH3            @ (((unsigned) &PWM2PHH)*8) + 3;
#define                                 PWM2PHH3_bit        BANKMASK(PWM2PHH), 3
extern volatile __bit                   PWM2PHH4            @ (((unsigned) &PWM2PHH)*8) + 4;
#define                                 PWM2PHH4_bit        BANKMASK(PWM2PHH), 4
extern volatile __bit                   PWM2PHH5            @ (((unsigned) &PWM2PHH)*8) + 5;
#define                                 PWM2PHH5_bit        BANKMASK(PWM2PHH), 5
extern volatile __bit                   PWM2PHH6            @ (((unsigned) &PWM2PHH)*8) + 6;
#define                                 PWM2PHH6_bit        BANKMASK(PWM2PHH), 6
extern volatile __bit                   PWM2PHH7            @ (((unsigned) &PWM2PHH)*8) + 7;
#define                                 PWM2PHH7_bit        BANKMASK(PWM2PHH), 7
extern volatile __bit                   PWM2PHIE            @ (((unsigned) &PWM2INTE)*8) + 2;
#define                                 PWM2PHIE_bit        BANKMASK(PWM2INTE), 2
extern volatile __bit                   PWM2PHIF            @ (((unsigned) &PWM2INTF)*8) + 2;
#define                                 PWM2PHIF_bit        BANKMASK(PWM2INTF), 2
extern volatile __bit                   PWM2PHL0            @ (((unsigned) &PWM2PHL)*8) + 0;
#define                                 PWM2PHL0_bit        BANKMASK(PWM2PHL), 0
extern volatile __bit                   PWM2PHL1            @ (((unsigned) &PWM2PHL)*8) + 1;
#define                                 PWM2PHL1_bit        BANKMASK(PWM2PHL), 1
extern volatile __bit                   PWM2PHL2            @ (((unsigned) &PWM2PHL)*8) + 2;
#define                                 PWM2PHL2_bit        BANKMASK(PWM2PHL), 2
extern volatile __bit                   PWM2PHL3            @ (((unsigned) &PWM2PHL)*8) + 3;
#define                                 PWM2PHL3_bit        BANKMASK(PWM2PHL), 3
extern volatile __bit                   PWM2PHL4            @ (((unsigned) &PWM2PHL)*8) + 4;
#define                                 PWM2PHL4_bit        BANKMASK(PWM2PHL), 4
extern volatile __bit                   PWM2PHL5            @ (((unsigned) &PWM2PHL)*8) + 5;
#define                                 PWM2PHL5_bit        BANKMASK(PWM2PHL), 5
extern volatile __bit                   PWM2PHL6            @ (((unsigned) &PWM2PHL)*8) + 6;
#define                                 PWM2PHL6_bit        BANKMASK(PWM2PHL), 6
extern volatile __bit                   PWM2PHL7            @ (((unsigned) &PWM2PHL)*8) + 7;
#define                                 PWM2PHL7_bit        BANKMASK(PWM2PHL), 7
extern volatile __bit                   PWM2POL             @ (((unsigned) &PWM2CON)*8) + 4;
#define                                 PWM2POL_bit         BANKMASK(PWM2CON), 4
extern volatile __bit                   PWM2PRH0            @ (((unsigned) &PWM2PRH)*8) + 0;
#define                                 PWM2PRH0_bit        BANKMASK(PWM2PRH), 0
extern volatile __bit                   PWM2PRH1            @ (((unsigned) &PWM2PRH)*8) + 1;
#define                                 PWM2PRH1_bit        BANKMASK(PWM2PRH), 1
extern volatile __bit                   PWM2PRH2            @ (((unsigned) &PWM2PRH)*8) + 2;
#define                                 PWM2PRH2_bit        BANKMASK(PWM2PRH), 2
extern volatile __bit                   PWM2PRH3            @ (((unsigned) &PWM2PRH)*8) + 3;
#define                                 PWM2PRH3_bit        BANKMASK(PWM2PRH), 3
extern volatile __bit                   PWM2PRH4            @ (((unsigned) &PWM2PRH)*8) + 4;
#define                                 PWM2PRH4_bit        BANKMASK(PWM2PRH), 4
extern volatile __bit                   PWM2PRH5            @ (((unsigned) &PWM2PRH)*8) + 5;
#define                                 PWM2PRH5_bit        BANKMASK(PWM2PRH), 5
extern volatile __bit                   PWM2PRH6            @ (((unsigned) &PWM2PRH)*8) + 6;
#define                                 PWM2PRH6_bit        BANKMASK(PWM2PRH), 6
extern volatile __bit                   PWM2PRH7            @ (((unsigned) &PWM2PRH)*8) + 7;
#define                                 PWM2PRH7_bit        BANKMASK(PWM2PRH), 7
extern volatile __bit                   PWM2PRIE            @ (((unsigned) &PWM2INTE)*8) + 0;
#define                                 PWM2PRIE_bit        BANKMASK(PWM2INTE), 0
extern volatile __bit                   PWM2PRIF            @ (((unsigned) &PWM2INTF)*8) + 0;
#define                                 PWM2PRIF_bit        BANKMASK(PWM2INTF), 0
extern volatile __bit                   PWM2PRL0            @ (((unsigned) &PWM2PRL)*8) + 0;
#define                                 PWM2PRL0_bit        BANKMASK(PWM2PRL), 0
extern volatile __bit                   PWM2PRL1            @ (((unsigned) &PWM2PRL)*8) + 1;
#define                                 PWM2PRL1_bit        BANKMASK(PWM2PRL), 1
extern volatile __bit                   PWM2PRL2            @ (((unsigned) &PWM2PRL)*8) + 2;
#define                                 PWM2PRL2_bit        BANKMASK(PWM2PRL), 2
extern volatile __bit                   PWM2PRL3            @ (((unsigned) &PWM2PRL)*8) + 3;
#define                                 PWM2PRL3_bit        BANKMASK(PWM2PRL), 3
extern volatile __bit                   PWM2PRL4            @ (((unsigned) &PWM2PRL)*8) + 4;
#define                                 PWM2PRL4_bit        BANKMASK(PWM2PRL), 4
extern volatile __bit                   PWM2PRL5            @ (((unsigned) &PWM2PRL)*8) + 5;
#define                                 PWM2PRL5_bit        BANKMASK(PWM2PRL), 5
extern volatile __bit                   PWM2PRL6            @ (((unsigned) &PWM2PRL)*8) + 6;
#define                                 PWM2PRL6_bit        BANKMASK(PWM2PRL), 6
extern volatile __bit                   PWM2PRL7            @ (((unsigned) &PWM2PRL)*8) + 7;
#define                                 PWM2PRL7_bit        BANKMASK(PWM2PRL), 7
extern volatile __bit                   PWM2PS0             @ (((unsigned) &PWM2CLKCON)*8) + 4;
#define                                 PWM2PS0_bit         BANKMASK(PWM2CLKCON), 4
extern volatile __bit                   PWM2PS1             @ (((unsigned) &PWM2CLKCON)*8) + 5;
#define                                 PWM2PS1_bit         BANKMASK(PWM2CLKCON), 5
extern volatile __bit                   PWM2PS2             @ (((unsigned) &PWM2CLKCON)*8) + 6;
#define                                 PWM2PS2_bit         BANKMASK(PWM2CLKCON), 6
extern volatile __bit                   PWM2TMRH0           @ (((unsigned) &PWM2TMRH)*8) + 0;
#define                                 PWM2TMRH0_bit       BANKMASK(PWM2TMRH), 0
extern volatile __bit                   PWM2TMRH1           @ (((unsigned) &PWM2TMRH)*8) + 1;
#define                                 PWM2TMRH1_bit       BANKMASK(PWM2TMRH), 1
extern volatile __bit                   PWM2TMRH2           @ (((unsigned) &PWM2TMRH)*8) + 2;
#define                                 PWM2TMRH2_bit       BANKMASK(PWM2TMRH), 2
extern volatile __bit                   PWM2TMRH3           @ (((unsigned) &PWM2TMRH)*8) + 3;
#define                                 PWM2TMRH3_bit       BANKMASK(PWM2TMRH), 3
extern volatile __bit                   PWM2TMRH4           @ (((unsigned) &PWM2TMRH)*8) + 4;
#define                                 PWM2TMRH4_bit       BANKMASK(PWM2TMRH), 4
extern volatile __bit                   PWM2TMRH5           @ (((unsigned) &PWM2TMRH)*8) + 5;
#define                                 PWM2TMRH5_bit       BANKMASK(PWM2TMRH), 5
extern volatile __bit                   PWM2TMRH6           @ (((unsigned) &PWM2TMRH)*8) + 6;
#define                                 PWM2TMRH6_bit       BANKMASK(PWM2TMRH), 6
extern volatile __bit                   PWM2TMRH7           @ (((unsigned) &PWM2TMRH)*8) + 7;
#define                                 PWM2TMRH7_bit       BANKMASK(PWM2TMRH), 7
extern volatile __bit                   PWM2TMRL0           @ (((unsigned) &PWM2TMRL)*8) + 0;
#define                                 PWM2TMRL0_bit       BANKMASK(PWM2TMRL), 0
extern volatile __bit                   PWM2TMRL1           @ (((unsigned) &PWM2TMRL)*8) + 1;
#define                                 PWM2TMRL1_bit       BANKMASK(PWM2TMRL), 1
extern volatile __bit                   PWM2TMRL2           @ (((unsigned) &PWM2TMRL)*8) + 2;
#define                                 PWM2TMRL2_bit       BANKMASK(PWM2TMRL), 2
extern volatile __bit                   PWM2TMRL3           @ (((unsigned) &PWM2TMRL)*8) + 3;
#define                                 PWM2TMRL3_bit       BANKMASK(PWM2TMRL), 3
extern volatile __bit                   PWM2TMRL4           @ (((unsigned) &PWM2TMRL)*8) + 4;
#define                                 PWM2TMRL4_bit       BANKMASK(PWM2TMRL), 4
extern volatile __bit                   PWM2TMRL5           @ (((unsigned) &PWM2TMRL)*8) + 5;
#define                                 PWM2TMRL5_bit       BANKMASK(PWM2TMRL), 5
extern volatile __bit                   PWM2TMRL6           @ (((unsigned) &PWM2TMRL)*8) + 6;
#define                                 PWM2TMRL6_bit       BANKMASK(PWM2TMRL), 6
extern volatile __bit                   PWM2TMRL7           @ (((unsigned) &PWM2TMRL)*8) + 7;
#define                                 PWM2TMRL7_bit       BANKMASK(PWM2TMRL), 7
extern volatile __bit                   PWM3CS0             @ (((unsigned) &PWM3CLKCON)*8) + 0;
#define                                 PWM3CS0_bit         BANKMASK(PWM3CLKCON), 0
extern volatile __bit                   PWM3CS1             @ (((unsigned) &PWM3CLKCON)*8) + 1;
#define                                 PWM3CS1_bit         BANKMASK(PWM3CLKCON), 1
extern volatile __bit                   PWM3DCH0            @ (((unsigned) &PWM3DCH)*8) + 0;
#define                                 PWM3DCH0_bit        BANKMASK(PWM3DCH), 0
extern volatile __bit                   PWM3DCH1            @ (((unsigned) &PWM3DCH)*8) + 1;
#define                                 PWM3DCH1_bit        BANKMASK(PWM3DCH), 1
extern volatile __bit                   PWM3DCH2            @ (((unsigned) &PWM3DCH)*8) + 2;
#define                                 PWM3DCH2_bit        BANKMASK(PWM3DCH), 2
extern volatile __bit                   PWM3DCH3            @ (((unsigned) &PWM3DCH)*8) + 3;
#define                                 PWM3DCH3_bit        BANKMASK(PWM3DCH), 3
extern volatile __bit                   PWM3DCH4            @ (((unsigned) &PWM3DCH)*8) + 4;
