daviskung/PIC16F1579_HM.X_2019_0524/mcc_generated_files/pic16f1579_ref.h
#define                                 PWM3DCH4_bit        BANKMASK(PWM3DCH), 4
extern volatile __bit                   PWM3DCH5            @ (((unsigned) &PWM3DCH)*8) + 5;
#define                                 PWM3DCH5_bit        BANKMASK(PWM3DCH), 5
extern volatile __bit                   PWM3DCH6            @ (((unsigned) &PWM3DCH)*8) + 6;
#define                                 PWM3DCH6_bit        BANKMASK(PWM3DCH), 6
extern volatile __bit                   PWM3DCH7            @ (((unsigned) &PWM3DCH)*8) + 7;
#define                                 PWM3DCH7_bit        BANKMASK(PWM3DCH), 7
extern volatile __bit                   PWM3DCIE            @ (((unsigned) &PWM3INTE)*8) + 1;
#define                                 PWM3DCIE_bit        BANKMASK(PWM3INTE), 1
extern volatile __bit                   PWM3DCIF            @ (((unsigned) &PWM3INTF)*8) + 1;
#define                                 PWM3DCIF_bit        BANKMASK(PWM3INTF), 1
extern volatile __bit                   PWM3DCL0            @ (((unsigned) &PWM3DCL)*8) + 0;
#define                                 PWM3DCL0_bit        BANKMASK(PWM3DCL), 0
extern volatile __bit                   PWM3DCL1            @ (((unsigned) &PWM3DCL)*8) + 1;
#define                                 PWM3DCL1_bit        BANKMASK(PWM3DCL), 1
extern volatile __bit                   PWM3DCL2            @ (((unsigned) &PWM3DCL)*8) + 2;
#define                                 PWM3DCL2_bit        BANKMASK(PWM3DCL), 2
extern volatile __bit                   PWM3DCL3            @ (((unsigned) &PWM3DCL)*8) + 3;
#define                                 PWM3DCL3_bit        BANKMASK(PWM3DCL), 3
extern volatile __bit                   PWM3DCL4            @ (((unsigned) &PWM3DCL)*8) + 4;
#define                                 PWM3DCL4_bit        BANKMASK(PWM3DCL), 4
extern volatile __bit                   PWM3DCL5            @ (((unsigned) &PWM3DCL)*8) + 5;
#define                                 PWM3DCL5_bit        BANKMASK(PWM3DCL), 5
extern volatile __bit                   PWM3DCL6            @ (((unsigned) &PWM3DCL)*8) + 6;
#define                                 PWM3DCL6_bit        BANKMASK(PWM3DCL), 6
extern volatile __bit                   PWM3DCL7            @ (((unsigned) &PWM3DCL)*8) + 7;
#define                                 PWM3DCL7_bit        BANKMASK(PWM3DCL), 7
extern volatile __bit                   PWM3EN              @ (((unsigned) &PWM3CON)*8) + 7;
#define                                 PWM3EN_bit          BANKMASK(PWM3CON), 7
extern volatile __bit                   PWM3EN_A            @ (((unsigned) &PWMEN)*8) + 2;
#define                                 PWM3EN_A_bit        BANKMASK(PWMEN), 2
extern volatile __bit                   PWM3IE              @ (((unsigned) &PIE3)*8) + 6;
#define                                 PWM3IE_bit          BANKMASK(PIE3), 6
extern volatile __bit                   PWM3IF              @ (((unsigned) &PIR3)*8) + 6;
#define                                 PWM3IF_bit          BANKMASK(PIR3), 6
extern volatile __bit                   PWM3LD              @ (((unsigned) &PWM3LDCON)*8) + 7;
#define                                 PWM3LD_bit          BANKMASK(PWM3LDCON), 7
extern volatile __bit                   PWM3LDA_A           @ (((unsigned) &PWMLD)*8) + 2;
#define                                 PWM3LDA_A_bit       BANKMASK(PWMLD), 2
extern volatile __bit                   PWM3LDM             @ (((unsigned) &PWM3LDCON)*8) + 6;
#define                                 PWM3LDM_bit         BANKMASK(PWM3LDCON), 6
extern volatile __bit                   PWM3LDS0            @ (((unsigned) &PWM3LDCON)*8) + 0;
#define                                 PWM3LDS0_bit        BANKMASK(PWM3LDCON), 0
extern volatile __bit                   PWM3LDS1            @ (((unsigned) &PWM3LDCON)*8) + 1;
#define                                 PWM3LDS1_bit        BANKMASK(PWM3LDCON), 1
extern volatile __bit                   PWM3MODE0           @ (((unsigned) &PWM3CON)*8) + 2;
#define                                 PWM3MODE0_bit       BANKMASK(PWM3CON), 2
extern volatile __bit                   PWM3MODE1           @ (((unsigned) &PWM3CON)*8) + 3;
#define                                 PWM3MODE1_bit       BANKMASK(PWM3CON), 3
extern volatile __bit                   PWM3OE              @ (((unsigned) &PWM3CON)*8) + 6;
#define                                 PWM3OE_bit          BANKMASK(PWM3CON), 6
extern volatile __bit                   PWM3OFH0            @ (((unsigned) &PWM3OFH)*8) + 0;
#define                                 PWM3OFH0_bit        BANKMASK(PWM3OFH), 0
extern volatile __bit                   PWM3OFH1            @ (((unsigned) &PWM3OFH)*8) + 1;
#define                                 PWM3OFH1_bit        BANKMASK(PWM3OFH), 1
extern volatile __bit                   PWM3OFH2            @ (((unsigned) &PWM3OFH)*8) + 2;
#define                                 PWM3OFH2_bit        BANKMASK(PWM3OFH), 2
extern volatile __bit                   PWM3OFH3            @ (((unsigned) &PWM3OFH)*8) + 3;
#define                                 PWM3OFH3_bit        BANKMASK(PWM3OFH), 3
extern volatile __bit                   PWM3OFH4            @ (((unsigned) &PWM3OFH)*8) + 4;
#define                                 PWM3OFH4_bit        BANKMASK(PWM3OFH), 4
extern volatile __bit                   PWM3OFH5            @ (((unsigned) &PWM3OFH)*8) + 5;
#define                                 PWM3OFH5_bit        BANKMASK(PWM3OFH), 5
extern volatile __bit                   PWM3OFH6            @ (((unsigned) &PWM3OFH)*8) + 6;
#define                                 PWM3OFH6_bit        BANKMASK(PWM3OFH), 6
extern volatile __bit                   PWM3OFH7            @ (((unsigned) &PWM3OFH)*8) + 7;
#define                                 PWM3OFH7_bit        BANKMASK(PWM3OFH), 7
extern volatile __bit                   PWM3OFIE            @ (((unsigned) &PWM3INTE)*8) + 3;
#define                                 PWM3OFIE_bit        BANKMASK(PWM3INTE), 3
extern volatile __bit                   PWM3OFIF            @ (((unsigned) &PWM3INTF)*8) + 3;
#define                                 PWM3OFIF_bit        BANKMASK(PWM3INTF), 3
extern volatile __bit                   PWM3OFL0            @ (((unsigned) &PWM3OFL)*8) + 0;
#define                                 PWM3OFL0_bit        BANKMASK(PWM3OFL), 0
extern volatile __bit                   PWM3OFL1            @ (((unsigned) &PWM3OFL)*8) + 1;
#define                                 PWM3OFL1_bit        BANKMASK(PWM3OFL), 1
extern volatile __bit                   PWM3OFL2            @ (((unsigned) &PWM3OFL)*8) + 2;
#define                                 PWM3OFL2_bit        BANKMASK(PWM3OFL), 2
extern volatile __bit                   PWM3OFL3            @ (((unsigned) &PWM3OFL)*8) + 3;
#define                                 PWM3OFL3_bit        BANKMASK(PWM3OFL), 3
extern volatile __bit                   PWM3OFL4            @ (((unsigned) &PWM3OFL)*8) + 4;
#define                                 PWM3OFL4_bit        BANKMASK(PWM3OFL), 4
extern volatile __bit                   PWM3OFL5            @ (((unsigned) &PWM3OFL)*8) + 5;
#define                                 PWM3OFL5_bit        BANKMASK(PWM3OFL), 5
extern volatile __bit                   PWM3OFL6            @ (((unsigned) &PWM3OFL)*8) + 6;
#define                                 PWM3OFL6_bit        BANKMASK(PWM3OFL), 6
extern volatile __bit                   PWM3OFL7            @ (((unsigned) &PWM3OFL)*8) + 7;
#define                                 PWM3OFL7_bit        BANKMASK(PWM3OFL), 7
extern volatile __bit                   PWM3OFM0            @ (((unsigned) &PWM3OFCON)*8) + 5;
#define                                 PWM3OFM0_bit        BANKMASK(PWM3OFCON), 5
extern volatile __bit                   PWM3OFM1            @ (((unsigned) &PWM3OFCON)*8) + 6;
#define                                 PWM3OFM1_bit        BANKMASK(PWM3OFCON), 6
extern volatile __bit                   PWM3OFMC            @ (((unsigned) &PWM3OFCON)*8) + 4;
#define                                 PWM3OFMC_bit        BANKMASK(PWM3OFCON), 4
extern volatile __bit                   PWM3OFS0            @ (((unsigned) &PWM3OFCON)*8) + 0;
#define                                 PWM3OFS0_bit        BANKMASK(PWM3OFCON), 0
extern volatile __bit                   PWM3OFS1            @ (((unsigned) &PWM3OFCON)*8) + 1;
#define                                 PWM3OFS1_bit        BANKMASK(PWM3OFCON), 1
extern volatile __bit                   PWM3OUT             @ (((unsigned) &PWM3CON)*8) + 5;
#define                                 PWM3OUT_bit         BANKMASK(PWM3CON), 5
extern volatile __bit                   PWM3OUT_A           @ (((unsigned) &PWMOUT)*8) + 2;
#define                                 PWM3OUT_A_bit       BANKMASK(PWMOUT), 2
extern volatile __bit                   PWM3PHH0            @ (((unsigned) &PWM3PHH)*8) + 0;
#define                                 PWM3PHH0_bit        BANKMASK(PWM3PHH), 0
extern volatile __bit                   PWM3PHH1            @ (((unsigned) &PWM3PHH)*8) + 1;
#define                                 PWM3PHH1_bit        BANKMASK(PWM3PHH), 1
extern volatile __bit                   PWM3PHH2            @ (((unsigned) &PWM3PHH)*8) + 2;
#define                                 PWM3PHH2_bit        BANKMASK(PWM3PHH), 2
extern volatile __bit                   PWM3PHH3            @ (((unsigned) &PWM3PHH)*8) + 3;
#define                                 PWM3PHH3_bit        BANKMASK(PWM3PHH), 3
extern volatile __bit                   PWM3PHH4            @ (((unsigned) &PWM3PHH)*8) + 4;
#define                                 PWM3PHH4_bit        BANKMASK(PWM3PHH), 4
extern volatile __bit                   PWM3PHH5            @ (((unsigned) &PWM3PHH)*8) + 5;
#define                                 PWM3PHH5_bit        BANKMASK(PWM3PHH), 5
extern volatile __bit                   PWM3PHH6            @ (((unsigned) &PWM3PHH)*8) + 6;
#define                                 PWM3PHH6_bit        BANKMASK(PWM3PHH), 6
extern volatile __bit                   PWM3PHH7            @ (((unsigned) &PWM3PHH)*8) + 7;
#define                                 PWM3PHH7_bit        BANKMASK(PWM3PHH), 7
extern volatile __bit                   PWM3PHIE            @ (((unsigned) &PWM3INTE)*8) + 2;
#define                                 PWM3PHIE_bit        BANKMASK(PWM3INTE), 2
extern volatile __bit                   PWM3PHIF            @ (((unsigned) &PWM3INTF)*8) + 2;
#define                                 PWM3PHIF_bit        BANKMASK(PWM3INTF), 2
extern volatile __bit                   PWM3PHL0            @ (((unsigned) &PWM3PHL)*8) + 0;
#define                                 PWM3PHL0_bit        BANKMASK(PWM3PHL), 0
extern volatile __bit                   PWM3PHL1            @ (((unsigned) &PWM3PHL)*8) + 1;
#define                                 PWM3PHL1_bit        BANKMASK(PWM3PHL), 1
extern volatile __bit                   PWM3PHL2            @ (((unsigned) &PWM3PHL)*8) + 2;
#define                                 PWM3PHL2_bit        BANKMASK(PWM3PHL), 2
extern volatile __bit                   PWM3PHL3            @ (((unsigned) &PWM3PHL)*8) + 3;
#define                                 PWM3PHL3_bit        BANKMASK(PWM3PHL), 3
extern volatile __bit                   PWM3PHL4            @ (((unsigned) &PWM3PHL)*8) + 4;
#define                                 PWM3PHL4_bit        BANKMASK(PWM3PHL), 4
extern volatile __bit                   PWM3PHL5            @ (((unsigned) &PWM3PHL)*8) + 5;
#define                                 PWM3PHL5_bit        BANKMASK(PWM3PHL), 5
extern volatile __bit                   PWM3PHL6            @ (((unsigned) &PWM3PHL)*8) + 6;
#define                                 PWM3PHL6_bit        BANKMASK(PWM3PHL), 6
extern volatile __bit                   PWM3PHL7            @ (((unsigned) &PWM3PHL)*8) + 7;
#define                                 PWM3PHL7_bit        BANKMASK(PWM3PHL), 7
extern volatile __bit                   PWM3POL             @ (((unsigned) &PWM3CON)*8) + 4;
#define                                 PWM3POL_bit         BANKMASK(PWM3CON), 4
extern volatile __bit                   PWM3PRH0            @ (((unsigned) &PWM3PRH)*8) + 0;
#define                                 PWM3PRH0_bit        BANKMASK(PWM3PRH), 0
extern volatile __bit                   PWM3PRH1            @ (((unsigned) &PWM3PRH)*8) + 1;
#define                                 PWM3PRH1_bit        BANKMASK(PWM3PRH), 1
extern volatile __bit                   PWM3PRH2            @ (((unsigned) &PWM3PRH)*8) + 2;
#define                                 PWM3PRH2_bit        BANKMASK(PWM3PRH), 2
extern volatile __bit                   PWM3PRH3            @ (((unsigned) &PWM3PRH)*8) + 3;
#define                                 PWM3PRH3_bit        BANKMASK(PWM3PRH), 3
extern volatile __bit                   PWM3PRH4            @ (((unsigned) &PWM3PRH)*8) + 4;
#define                                 PWM3PRH4_bit        BANKMASK(PWM3PRH), 4
extern volatile __bit                   PWM3PRH5            @ (((unsigned) &PWM3PRH)*8) + 5;
#define                                 PWM3PRH5_bit        BANKMASK(PWM3PRH), 5
extern volatile __bit                   PWM3PRH6            @ (((unsigned) &PWM3PRH)*8) + 6;
#define                                 PWM3PRH6_bit        BANKMASK(PWM3PRH), 6
extern volatile __bit                   PWM3PRH7            @ (((unsigned) &PWM3PRH)*8) + 7;
#define                                 PWM3PRH7_bit        BANKMASK(PWM3PRH), 7
extern volatile __bit                   PWM3PRIE            @ (((unsigned) &PWM3INTE)*8) + 0;
#define                                 PWM3PRIE_bit        BANKMASK(PWM3INTE), 0
extern volatile __bit                   PWM3PRIF            @ (((unsigned) &PWM3INTF)*8) + 0;
#define                                 PWM3PRIF_bit        BANKMASK(PWM3INTF), 0
extern volatile __bit                   PWM3PRL0            @ (((unsigned) &PWM3PRL)*8) + 0;
#define                                 PWM3PRL0_bit        BANKMASK(PWM3PRL), 0
extern volatile __bit                   PWM3PRL1            @ (((unsigned) &PWM3PRL)*8) + 1;
#define                                 PWM3PRL1_bit        BANKMASK(PWM3PRL), 1
extern volatile __bit                   PWM3PRL2            @ (((unsigned) &PWM3PRL)*8) + 2;
#define                                 PWM3PRL2_bit        BANKMASK(PWM3PRL), 2
extern volatile __bit                   PWM3PRL3            @ (((unsigned) &PWM3PRL)*8) + 3;
#define                                 PWM3PRL3_bit        BANKMASK(PWM3PRL), 3
extern volatile __bit                   PWM3PRL4            @ (((unsigned) &PWM3PRL)*8) + 4;
#define                                 PWM3PRL4_bit        BANKMASK(PWM3PRL), 4
extern volatile __bit                   PWM3PRL5            @ (((unsigned) &PWM3PRL)*8) + 5;
#define                                 PWM3PRL5_bit        BANKMASK(PWM3PRL), 5
extern volatile __bit                   PWM3PRL6            @ (((unsigned) &PWM3PRL)*8) + 6;
#define                                 PWM3PRL6_bit        BANKMASK(PWM3PRL), 6
extern volatile __bit                   PWM3PRL7            @ (((unsigned) &PWM3PRL)*8) + 7;
#define                                 PWM3PRL7_bit        BANKMASK(PWM3PRL), 7
extern volatile __bit                   PWM3PS0             @ (((unsigned) &PWM3CLKCON)*8) + 4;
#define                                 PWM3PS0_bit         BANKMASK(PWM3CLKCON), 4
extern volatile __bit                   PWM3PS1             @ (((unsigned) &PWM3CLKCON)*8) + 5;
#define                                 PWM3PS1_bit         BANKMASK(PWM3CLKCON), 5
extern volatile __bit                   PWM3PS2             @ (((unsigned) &PWM3CLKCON)*8) + 6;
#define                                 PWM3PS2_bit         BANKMASK(PWM3CLKCON), 6
extern volatile __bit                   PWM3TMRH0           @ (((unsigned) &PWM3TMRH)*8) + 0;
#define                                 PWM3TMRH0_bit       BANKMASK(PWM3TMRH), 0
extern volatile __bit                   PWM3TMRH1           @ (((unsigned) &PWM3TMRH)*8) + 1;
#define                                 PWM3TMRH1_bit       BANKMASK(PWM3TMRH), 1
extern volatile __bit                   PWM3TMRH2           @ (((unsigned) &PWM3TMRH)*8) + 2;
#define                                 PWM3TMRH2_bit       BANKMASK(PWM3TMRH), 2
extern volatile __bit                   PWM3TMRH3           @ (((unsigned) &PWM3TMRH)*8) + 3;
#define                                 PWM3TMRH3_bit       BANKMASK(PWM3TMRH), 3
extern volatile __bit                   PWM3TMRH4           @ (((unsigned) &PWM3TMRH)*8) + 4;
#define                                 PWM3TMRH4_bit       BANKMASK(PWM3TMRH), 4
extern volatile __bit                   PWM3TMRH5           @ (((unsigned) &PWM3TMRH)*8) + 5;
#define                                 PWM3TMRH5_bit       BANKMASK(PWM3TMRH), 5
extern volatile __bit                   PWM3TMRH6           @ (((unsigned) &PWM3TMRH)*8) + 6;
#define                                 PWM3TMRH6_bit       BANKMASK(PWM3TMRH), 6
extern volatile __bit                   PWM3TMRH7           @ (((unsigned) &PWM3TMRH)*8) + 7;
#define                                 PWM3TMRH7_bit       BANKMASK(PWM3TMRH), 7
extern volatile __bit                   PWM3TMRL0           @ (((unsigned) &PWM3TMRL)*8) + 0;
#define                                 PWM3TMRL0_bit       BANKMASK(PWM3TMRL), 0
extern volatile __bit                   PWM3TMRL1           @ (((unsigned) &PWM3TMRL)*8) + 1;
#define                                 PWM3TMRL1_bit       BANKMASK(PWM3TMRL), 1
extern volatile __bit                   PWM3TMRL2           @ (((unsigned) &PWM3TMRL)*8) + 2;
#define                                 PWM3TMRL2_bit       BANKMASK(PWM3TMRL), 2
extern volatile __bit                   PWM3TMRL3           @ (((unsigned) &PWM3TMRL)*8) + 3;
#define                                 PWM3TMRL3_bit       BANKMASK(PWM3TMRL), 3
extern volatile __bit                   PWM3TMRL4           @ (((unsigned) &PWM3TMRL)*8) + 4;
#define                                 PWM3TMRL4_bit       BANKMASK(PWM3TMRL), 4
extern volatile __bit                   PWM3TMRL5           @ (((unsigned) &PWM3TMRL)*8) + 5;
#define                                 PWM3TMRL5_bit       BANKMASK(PWM3TMRL), 5
extern volatile __bit                   PWM3TMRL6           @ (((unsigned) &PWM3TMRL)*8) + 6;
#define                                 PWM3TMRL6_bit       BANKMASK(PWM3TMRL), 6
extern volatile __bit                   PWM3TMRL7           @ (((unsigned) &PWM3TMRL)*8) + 7;
#define                                 PWM3TMRL7_bit       BANKMASK(PWM3TMRL), 7
extern volatile __bit                   PWM4CS0             @ (((unsigned) &PWM4CLKCON)*8) + 0;
#define                                 PWM4CS0_bit         BANKMASK(PWM4CLKCON), 0
extern volatile __bit                   PWM4CS1             @ (((unsigned) &PWM4CLKCON)*8) + 1;
#define                                 PWM4CS1_bit         BANKMASK(PWM4CLKCON), 1
extern volatile __bit                   PWM4DCH0            @ (((unsigned) &PWM4DCH)*8) + 0;
#define                                 PWM4DCH0_bit        BANKMASK(PWM4DCH), 0
extern volatile __bit                   PWM4DCH1            @ (((unsigned) &PWM4DCH)*8) + 1;
#define                                 PWM4DCH1_bit        BANKMASK(PWM4DCH), 1
extern volatile __bit                   PWM4DCH2            @ (((unsigned) &PWM4DCH)*8) + 2;
#define                                 PWM4DCH2_bit        BANKMASK(PWM4DCH), 2
extern volatile __bit                   PWM4DCH3            @ (((unsigned) &PWM4DCH)*8) + 3;
#define                                 PWM4DCH3_bit        BANKMASK(PWM4DCH), 3
extern volatile __bit                   PWM4DCH4            @ (((unsigned) &PWM4DCH)*8) + 4;
#define                                 PWM4DCH4_bit        BANKMASK(PWM4DCH), 4
extern volatile __bit                   PWM4DCH5            @ (((unsigned) &PWM4DCH)*8) + 5;
#define                                 PWM4DCH5_bit        BANKMASK(PWM4DCH), 5
extern volatile __bit                   PWM4DCH6            @ (((unsigned) &PWM4DCH)*8) + 6;
#define                                 PWM4DCH6_bit        BANKMASK(PWM4DCH), 6
extern volatile __bit                   PWM4DCH7            @ (((unsigned) &PWM4DCH)*8) + 7;
#define                                 PWM4DCH7_bit        BANKMASK(PWM4DCH), 7
extern volatile __bit                   PWM4DCIE            @ (((unsigned) &PWM4INTE)*8) + 1;
#define                                 PWM4DCIE_bit        BANKMASK(PWM4INTE), 1
extern volatile __bit                   PWM4DCIF            @ (((unsigned) &PWM4INTF)*8) + 1;
#define                                 PWM4DCIF_bit        BANKMASK(PWM4INTF), 1
extern volatile __bit                   PWM4DCL0            @ (((unsigned) &PWM4DCL)*8) + 0;
#define                                 PWM4DCL0_bit        BANKMASK(PWM4DCL), 0
extern volatile __bit                   PWM4DCL1            @ (((unsigned) &PWM4DCL)*8) + 1;
#define                                 PWM4DCL1_bit        BANKMASK(PWM4DCL), 1
extern volatile __bit                   PWM4DCL2            @ (((unsigned) &PWM4DCL)*8) + 2;
#define                                 PWM4DCL2_bit        BANKMASK(PWM4DCL), 2
extern volatile __bit                   PWM4DCL3            @ (((unsigned) &PWM4DCL)*8) + 3;
#define                                 PWM4DCL3_bit        BANKMASK(PWM4DCL), 3
extern volatile __bit                   PWM4DCL4            @ (((unsigned) &PWM4DCL)*8) + 4;
#define                                 PWM4DCL4_bit        BANKMASK(PWM4DCL), 4
extern volatile __bit                   PWM4DCL5            @ (((unsigned) &PWM4DCL)*8) + 5;
#define                                 PWM4DCL5_bit        BANKMASK(PWM4DCL), 5
extern volatile __bit                   PWM4DCL6            @ (((unsigned) &PWM4DCL)*8) + 6;
#define                                 PWM4DCL6_bit        BANKMASK(PWM4DCL), 6
extern volatile __bit                   PWM4DCL7            @ (((unsigned) &PWM4DCL)*8) + 7;
#define                                 PWM4DCL7_bit        BANKMASK(PWM4DCL), 7
extern volatile __bit                   PWM4EN              @ (((unsigned) &PWM4CON)*8) + 7;
#define                                 PWM4EN_bit          BANKMASK(PWM4CON), 7
extern volatile __bit                   PWM4EN_A            @ (((unsigned) &PWMEN)*8) + 3;
#define                                 PWM4EN_A_bit        BANKMASK(PWMEN), 3
extern volatile __bit                   PWM4IE              @ (((unsigned) &PIE3)*8) + 7;
#define                                 PWM4IE_bit          BANKMASK(PIE3), 7
extern volatile __bit                   PWM4IF              @ (((unsigned) &PIR3)*8) + 7;
#define                                 PWM4IF_bit          BANKMASK(PIR3), 7
extern volatile __bit                   PWM4LD              @ (((unsigned) &PWM4LDCON)*8) + 7;
#define                                 PWM4LD_bit          BANKMASK(PWM4LDCON), 7
extern volatile __bit                   PWM4LDA_A           @ (((unsigned) &PWMLD)*8) + 3;
#define                                 PWM4LDA_A_bit       BANKMASK(PWMLD), 3
extern volatile __bit                   PWM4LDM             @ (((unsigned) &PWM4LDCON)*8) + 6;
#define                                 PWM4LDM_bit         BANKMASK(PWM4LDCON), 6
extern volatile __bit                   PWM4LDS0            @ (((unsigned) &PWM4LDCON)*8) + 0;
#define                                 PWM4LDS0_bit        BANKMASK(PWM4LDCON), 0
extern volatile __bit                   PWM4LDS1            @ (((unsigned) &PWM4LDCON)*8) + 1;
#define                                 PWM4LDS1_bit        BANKMASK(PWM4LDCON), 1
extern volatile __bit                   PWM4MODE0           @ (((unsigned) &PWM4CON)*8) + 2;
#define                                 PWM4MODE0_bit       BANKMASK(PWM4CON), 2
extern volatile __bit                   PWM4MODE1           @ (((unsigned) &PWM4CON)*8) + 3;
