daviskung/PIC16F1579_HM.X_2019_0524/mcc_generated_files/pic16f1579_ref.h
#define                                 PWM4MODE1_bit       BANKMASK(PWM4CON), 3
extern volatile __bit                   PWM4OE              @ (((unsigned) &PWM4CON)*8) + 6;
#define                                 PWM4OE_bit          BANKMASK(PWM4CON), 6
extern volatile __bit                   PWM4OFH0            @ (((unsigned) &PWM4OFH)*8) + 0;
#define                                 PWM4OFH0_bit        BANKMASK(PWM4OFH), 0
extern volatile __bit                   PWM4OFH1            @ (((unsigned) &PWM4OFH)*8) + 1;
#define                                 PWM4OFH1_bit        BANKMASK(PWM4OFH), 1
extern volatile __bit                   PWM4OFH2            @ (((unsigned) &PWM4OFH)*8) + 2;
#define                                 PWM4OFH2_bit        BANKMASK(PWM4OFH), 2
extern volatile __bit                   PWM4OFH3            @ (((unsigned) &PWM4OFH)*8) + 3;
#define                                 PWM4OFH3_bit        BANKMASK(PWM4OFH), 3
extern volatile __bit                   PWM4OFH4            @ (((unsigned) &PWM4OFH)*8) + 4;
#define                                 PWM4OFH4_bit        BANKMASK(PWM4OFH), 4
extern volatile __bit                   PWM4OFH5            @ (((unsigned) &PWM4OFH)*8) + 5;
#define                                 PWM4OFH5_bit        BANKMASK(PWM4OFH), 5
extern volatile __bit                   PWM4OFH6            @ (((unsigned) &PWM4OFH)*8) + 6;
#define                                 PWM4OFH6_bit        BANKMASK(PWM4OFH), 6
extern volatile __bit                   PWM4OFH7            @ (((unsigned) &PWM4OFH)*8) + 7;
#define                                 PWM4OFH7_bit        BANKMASK(PWM4OFH), 7
extern volatile __bit                   PWM4OFIE            @ (((unsigned) &PWM4INTE)*8) + 3;
#define                                 PWM4OFIE_bit        BANKMASK(PWM4INTE), 3
extern volatile __bit                   PWM4OFIF            @ (((unsigned) &PWM4INTF)*8) + 3;
#define                                 PWM4OFIF_bit        BANKMASK(PWM4INTF), 3
extern volatile __bit                   PWM4OFL0            @ (((unsigned) &PWM4OFL)*8) + 0;
#define                                 PWM4OFL0_bit        BANKMASK(PWM4OFL), 0
extern volatile __bit                   PWM4OFL1            @ (((unsigned) &PWM4OFL)*8) + 1;
#define                                 PWM4OFL1_bit        BANKMASK(PWM4OFL), 1
extern volatile __bit                   PWM4OFL2            @ (((unsigned) &PWM4OFL)*8) + 2;
#define                                 PWM4OFL2_bit        BANKMASK(PWM4OFL), 2
extern volatile __bit                   PWM4OFL3            @ (((unsigned) &PWM4OFL)*8) + 3;
#define                                 PWM4OFL3_bit        BANKMASK(PWM4OFL), 3
extern volatile __bit                   PWM4OFL4            @ (((unsigned) &PWM4OFL)*8) + 4;
#define                                 PWM4OFL4_bit        BANKMASK(PWM4OFL), 4
extern volatile __bit                   PWM4OFL5            @ (((unsigned) &PWM4OFL)*8) + 5;
#define                                 PWM4OFL5_bit        BANKMASK(PWM4OFL), 5
extern volatile __bit                   PWM4OFL6            @ (((unsigned) &PWM4OFL)*8) + 6;
#define                                 PWM4OFL6_bit        BANKMASK(PWM4OFL), 6
extern volatile __bit                   PWM4OFL7            @ (((unsigned) &PWM4OFL)*8) + 7;
#define                                 PWM4OFL7_bit        BANKMASK(PWM4OFL), 7
extern volatile __bit                   PWM4OFM0            @ (((unsigned) &PWM4OFCON)*8) + 5;
#define                                 PWM4OFM0_bit        BANKMASK(PWM4OFCON), 5
extern volatile __bit                   PWM4OFM1            @ (((unsigned) &PWM4OFCON)*8) + 6;
#define                                 PWM4OFM1_bit        BANKMASK(PWM4OFCON), 6
extern volatile __bit                   PWM4OFMC            @ (((unsigned) &PWM4OFCON)*8) + 4;
#define                                 PWM4OFMC_bit        BANKMASK(PWM4OFCON), 4
extern volatile __bit                   PWM4OFS0            @ (((unsigned) &PWM4OFCON)*8) + 0;
#define                                 PWM4OFS0_bit        BANKMASK(PWM4OFCON), 0
extern volatile __bit                   PWM4OFS1            @ (((unsigned) &PWM4OFCON)*8) + 1;
#define                                 PWM4OFS1_bit        BANKMASK(PWM4OFCON), 1
extern volatile __bit                   PWM4OUT             @ (((unsigned) &PWM4CON)*8) + 5;
#define                                 PWM4OUT_bit         BANKMASK(PWM4CON), 5
extern volatile __bit                   PWM4OUT_A           @ (((unsigned) &PWMOUT)*8) + 3;
#define                                 PWM4OUT_A_bit       BANKMASK(PWMOUT), 3
extern volatile __bit                   PWM4PHH0            @ (((unsigned) &PWM4PHH)*8) + 0;
#define                                 PWM4PHH0_bit        BANKMASK(PWM4PHH), 0
extern volatile __bit                   PWM4PHH1            @ (((unsigned) &PWM4PHH)*8) + 1;
#define                                 PWM4PHH1_bit        BANKMASK(PWM4PHH), 1
extern volatile __bit                   PWM4PHH2            @ (((unsigned) &PWM4PHH)*8) + 2;
#define                                 PWM4PHH2_bit        BANKMASK(PWM4PHH), 2
extern volatile __bit                   PWM4PHH3            @ (((unsigned) &PWM4PHH)*8) + 3;
#define                                 PWM4PHH3_bit        BANKMASK(PWM4PHH), 3
extern volatile __bit                   PWM4PHH4            @ (((unsigned) &PWM4PHH)*8) + 4;
#define                                 PWM4PHH4_bit        BANKMASK(PWM4PHH), 4
extern volatile __bit                   PWM4PHH5            @ (((unsigned) &PWM4PHH)*8) + 5;
#define                                 PWM4PHH5_bit        BANKMASK(PWM4PHH), 5
extern volatile __bit                   PWM4PHH6            @ (((unsigned) &PWM4PHH)*8) + 6;
#define                                 PWM4PHH6_bit        BANKMASK(PWM4PHH), 6
extern volatile __bit                   PWM4PHH7            @ (((unsigned) &PWM4PHH)*8) + 7;
#define                                 PWM4PHH7_bit        BANKMASK(PWM4PHH), 7
extern volatile __bit                   PWM4PHIE            @ (((unsigned) &PWM4INTE)*8) + 2;
#define                                 PWM4PHIE_bit        BANKMASK(PWM4INTE), 2
extern volatile __bit                   PWM4PHIF            @ (((unsigned) &PWM4INTF)*8) + 2;
#define                                 PWM4PHIF_bit        BANKMASK(PWM4INTF), 2
extern volatile __bit                   PWM4PHL0            @ (((unsigned) &PWM4PHL)*8) + 0;
#define                                 PWM4PHL0_bit        BANKMASK(PWM4PHL), 0
extern volatile __bit                   PWM4PHL1            @ (((unsigned) &PWM4PHL)*8) + 1;
#define                                 PWM4PHL1_bit        BANKMASK(PWM4PHL), 1
extern volatile __bit                   PWM4PHL2            @ (((unsigned) &PWM4PHL)*8) + 2;
#define                                 PWM4PHL2_bit        BANKMASK(PWM4PHL), 2
extern volatile __bit                   PWM4PHL3            @ (((unsigned) &PWM4PHL)*8) + 3;
#define                                 PWM4PHL3_bit        BANKMASK(PWM4PHL), 3
extern volatile __bit                   PWM4PHL4            @ (((unsigned) &PWM4PHL)*8) + 4;
#define                                 PWM4PHL4_bit        BANKMASK(PWM4PHL), 4
extern volatile __bit                   PWM4PHL5            @ (((unsigned) &PWM4PHL)*8) + 5;
#define                                 PWM4PHL5_bit        BANKMASK(PWM4PHL), 5
extern volatile __bit                   PWM4PHL6            @ (((unsigned) &PWM4PHL)*8) + 6;
#define                                 PWM4PHL6_bit        BANKMASK(PWM4PHL), 6
extern volatile __bit                   PWM4PHL7            @ (((unsigned) &PWM4PHL)*8) + 7;
#define                                 PWM4PHL7_bit        BANKMASK(PWM4PHL), 7
extern volatile __bit                   PWM4POL             @ (((unsigned) &PWM4CON)*8) + 4;
#define                                 PWM4POL_bit         BANKMASK(PWM4CON), 4
extern volatile __bit                   PWM4PRH0            @ (((unsigned) &PWM4PRH)*8) + 0;
#define                                 PWM4PRH0_bit        BANKMASK(PWM4PRH), 0
extern volatile __bit                   PWM4PRH1            @ (((unsigned) &PWM4PRH)*8) + 1;
#define                                 PWM4PRH1_bit        BANKMASK(PWM4PRH), 1
extern volatile __bit                   PWM4PRH2            @ (((unsigned) &PWM4PRH)*8) + 2;
#define                                 PWM4PRH2_bit        BANKMASK(PWM4PRH), 2
extern volatile __bit                   PWM4PRH3            @ (((unsigned) &PWM4PRH)*8) + 3;
#define                                 PWM4PRH3_bit        BANKMASK(PWM4PRH), 3
extern volatile __bit                   PWM4PRH4            @ (((unsigned) &PWM4PRH)*8) + 4;
#define                                 PWM4PRH4_bit        BANKMASK(PWM4PRH), 4
extern volatile __bit                   PWM4PRH5            @ (((unsigned) &PWM4PRH)*8) + 5;
#define                                 PWM4PRH5_bit        BANKMASK(PWM4PRH), 5
extern volatile __bit                   PWM4PRH6            @ (((unsigned) &PWM4PRH)*8) + 6;
#define                                 PWM4PRH6_bit        BANKMASK(PWM4PRH), 6
extern volatile __bit                   PWM4PRH7            @ (((unsigned) &PWM4PRH)*8) + 7;
#define                                 PWM4PRH7_bit        BANKMASK(PWM4PRH), 7
extern volatile __bit                   PWM4PRIE            @ (((unsigned) &PWM4INTE)*8) + 0;
#define                                 PWM4PRIE_bit        BANKMASK(PWM4INTE), 0
extern volatile __bit                   PWM4PRIF            @ (((unsigned) &PWM4INTF)*8) + 0;
#define                                 PWM4PRIF_bit        BANKMASK(PWM4INTF), 0
extern volatile __bit                   PWM4PRL0            @ (((unsigned) &PWM4PRL)*8) + 0;
#define                                 PWM4PRL0_bit        BANKMASK(PWM4PRL), 0
extern volatile __bit                   PWM4PRL1            @ (((unsigned) &PWM4PRL)*8) + 1;
#define                                 PWM4PRL1_bit        BANKMASK(PWM4PRL), 1
extern volatile __bit                   PWM4PRL2            @ (((unsigned) &PWM4PRL)*8) + 2;
#define                                 PWM4PRL2_bit        BANKMASK(PWM4PRL), 2
extern volatile __bit                   PWM4PRL3            @ (((unsigned) &PWM4PRL)*8) + 3;
#define                                 PWM4PRL3_bit        BANKMASK(PWM4PRL), 3
extern volatile __bit                   PWM4PRL4            @ (((unsigned) &PWM4PRL)*8) + 4;
#define                                 PWM4PRL4_bit        BANKMASK(PWM4PRL), 4
extern volatile __bit                   PWM4PRL5            @ (((unsigned) &PWM4PRL)*8) + 5;
#define                                 PWM4PRL5_bit        BANKMASK(PWM4PRL), 5
extern volatile __bit                   PWM4PRL6            @ (((unsigned) &PWM4PRL)*8) + 6;
#define                                 PWM4PRL6_bit        BANKMASK(PWM4PRL), 6
extern volatile __bit                   PWM4PRL7            @ (((unsigned) &PWM4PRL)*8) + 7;
#define                                 PWM4PRL7_bit        BANKMASK(PWM4PRL), 7
extern volatile __bit                   PWM4PS0             @ (((unsigned) &PWM4CLKCON)*8) + 4;
#define                                 PWM4PS0_bit         BANKMASK(PWM4CLKCON), 4
extern volatile __bit                   PWM4PS1             @ (((unsigned) &PWM4CLKCON)*8) + 5;
#define                                 PWM4PS1_bit         BANKMASK(PWM4CLKCON), 5
extern volatile __bit                   PWM4PS2             @ (((unsigned) &PWM4CLKCON)*8) + 6;
#define                                 PWM4PS2_bit         BANKMASK(PWM4CLKCON), 6
extern volatile __bit                   PWM4TMRH0           @ (((unsigned) &PWM4TMRH)*8) + 0;
#define                                 PWM4TMRH0_bit       BANKMASK(PWM4TMRH), 0
extern volatile __bit                   PWM4TMRH1           @ (((unsigned) &PWM4TMRH)*8) + 1;
#define                                 PWM4TMRH1_bit       BANKMASK(PWM4TMRH), 1
extern volatile __bit                   PWM4TMRH2           @ (((unsigned) &PWM4TMRH)*8) + 2;
#define                                 PWM4TMRH2_bit       BANKMASK(PWM4TMRH), 2
extern volatile __bit                   PWM4TMRH3           @ (((unsigned) &PWM4TMRH)*8) + 3;
#define                                 PWM4TMRH3_bit       BANKMASK(PWM4TMRH), 3
extern volatile __bit                   PWM4TMRH4           @ (((unsigned) &PWM4TMRH)*8) + 4;
#define                                 PWM4TMRH4_bit       BANKMASK(PWM4TMRH), 4
extern volatile __bit                   PWM4TMRH5           @ (((unsigned) &PWM4TMRH)*8) + 5;
#define                                 PWM4TMRH5_bit       BANKMASK(PWM4TMRH), 5
extern volatile __bit                   PWM4TMRH6           @ (((unsigned) &PWM4TMRH)*8) + 6;
#define                                 PWM4TMRH6_bit       BANKMASK(PWM4TMRH), 6
extern volatile __bit                   PWM4TMRH7           @ (((unsigned) &PWM4TMRH)*8) + 7;
#define                                 PWM4TMRH7_bit       BANKMASK(PWM4TMRH), 7
extern volatile __bit                   PWM4TMRL0           @ (((unsigned) &PWM4TMRL)*8) + 0;
#define                                 PWM4TMRL0_bit       BANKMASK(PWM4TMRL), 0
extern volatile __bit                   PWM4TMRL1           @ (((unsigned) &PWM4TMRL)*8) + 1;
#define                                 PWM4TMRL1_bit       BANKMASK(PWM4TMRL), 1
extern volatile __bit                   PWM4TMRL2           @ (((unsigned) &PWM4TMRL)*8) + 2;
#define                                 PWM4TMRL2_bit       BANKMASK(PWM4TMRL), 2
extern volatile __bit                   PWM4TMRL3           @ (((unsigned) &PWM4TMRL)*8) + 3;
#define                                 PWM4TMRL3_bit       BANKMASK(PWM4TMRL), 3
extern volatile __bit                   PWM4TMRL4           @ (((unsigned) &PWM4TMRL)*8) + 4;
#define                                 PWM4TMRL4_bit       BANKMASK(PWM4TMRL), 4
extern volatile __bit                   PWM4TMRL5           @ (((unsigned) &PWM4TMRL)*8) + 5;
#define                                 PWM4TMRL5_bit       BANKMASK(PWM4TMRL), 5
extern volatile __bit                   PWM4TMRL6           @ (((unsigned) &PWM4TMRL)*8) + 6;
#define                                 PWM4TMRL6_bit       BANKMASK(PWM4TMRL), 6
extern volatile __bit                   PWM4TMRL7           @ (((unsigned) &PWM4TMRL)*8) + 7;
#define                                 PWM4TMRL7_bit       BANKMASK(PWM4TMRL), 7
extern volatile __bit                   RA0                 @ (((unsigned) &PORTA)*8) + 0;
#define                                 RA0_bit             BANKMASK(PORTA), 0
extern volatile __bit                   RA0PPS0             @ (((unsigned) &RA0PPS)*8) + 0;
#define                                 RA0PPS0_bit         BANKMASK(RA0PPS), 0
extern volatile __bit                   RA0PPS1             @ (((unsigned) &RA0PPS)*8) + 1;
#define                                 RA0PPS1_bit         BANKMASK(RA0PPS), 1
extern volatile __bit                   RA0PPS2             @ (((unsigned) &RA0PPS)*8) + 2;
#define                                 RA0PPS2_bit         BANKMASK(RA0PPS), 2
extern volatile __bit                   RA0PPS3             @ (((unsigned) &RA0PPS)*8) + 3;
#define                                 RA0PPS3_bit         BANKMASK(RA0PPS), 3
extern volatile __bit                   RA1                 @ (((unsigned) &PORTA)*8) + 1;
#define                                 RA1_bit             BANKMASK(PORTA), 1
extern volatile __bit                   RA1PPS0             @ (((unsigned) &RA1PPS)*8) + 0;
#define                                 RA1PPS0_bit         BANKMASK(RA1PPS), 0
extern volatile __bit                   RA1PPS1             @ (((unsigned) &RA1PPS)*8) + 1;
#define                                 RA1PPS1_bit         BANKMASK(RA1PPS), 1
extern volatile __bit                   RA1PPS2             @ (((unsigned) &RA1PPS)*8) + 2;
#define                                 RA1PPS2_bit         BANKMASK(RA1PPS), 2
extern volatile __bit                   RA1PPS3             @ (((unsigned) &RA1PPS)*8) + 3;
#define                                 RA1PPS3_bit         BANKMASK(RA1PPS), 3
extern volatile __bit                   RA2                 @ (((unsigned) &PORTA)*8) + 2;
#define                                 RA2_bit             BANKMASK(PORTA), 2
extern volatile __bit                   RA2PPS0             @ (((unsigned) &RA2PPS)*8) + 0;
#define                                 RA2PPS0_bit         BANKMASK(RA2PPS), 0
extern volatile __bit                   RA2PPS1             @ (((unsigned) &RA2PPS)*8) + 1;
#define                                 RA2PPS1_bit         BANKMASK(RA2PPS), 1
extern volatile __bit                   RA2PPS2             @ (((unsigned) &RA2PPS)*8) + 2;
#define                                 RA2PPS2_bit         BANKMASK(RA2PPS), 2
extern volatile __bit                   RA2PPS3             @ (((unsigned) &RA2PPS)*8) + 3;
#define                                 RA2PPS3_bit         BANKMASK(RA2PPS), 3
extern volatile __bit                   RA3                 @ (((unsigned) &PORTA)*8) + 3;
#define                                 RA3_bit             BANKMASK(PORTA), 3
extern volatile __bit                   RA4                 @ (((unsigned) &PORTA)*8) + 4;
#define                                 RA4_bit             BANKMASK(PORTA), 4
extern volatile __bit                   RA4PPS0             @ (((unsigned) &RA4PPS)*8) + 0;
#define                                 RA4PPS0_bit         BANKMASK(RA4PPS), 0
extern volatile __bit                   RA4PPS1             @ (((unsigned) &RA4PPS)*8) + 1;
#define                                 RA4PPS1_bit         BANKMASK(RA4PPS), 1
extern volatile __bit                   RA4PPS2             @ (((unsigned) &RA4PPS)*8) + 2;
#define                                 RA4PPS2_bit         BANKMASK(RA4PPS), 2
extern volatile __bit                   RA4PPS3             @ (((unsigned) &RA4PPS)*8) + 3;
#define                                 RA4PPS3_bit         BANKMASK(RA4PPS), 3
extern volatile __bit                   RA5                 @ (((unsigned) &PORTA)*8) + 5;
#define                                 RA5_bit             BANKMASK(PORTA), 5
extern volatile __bit                   RA5PPS0             @ (((unsigned) &RA5PPS)*8) + 0;
#define                                 RA5PPS0_bit         BANKMASK(RA5PPS), 0
extern volatile __bit                   RA5PPS1             @ (((unsigned) &RA5PPS)*8) + 1;
#define                                 RA5PPS1_bit         BANKMASK(RA5PPS), 1
extern volatile __bit                   RA5PPS2             @ (((unsigned) &RA5PPS)*8) + 2;
#define                                 RA5PPS2_bit         BANKMASK(RA5PPS), 2
extern volatile __bit                   RA5PPS3             @ (((unsigned) &RA5PPS)*8) + 3;
#define                                 RA5PPS3_bit         BANKMASK(RA5PPS), 3
extern volatile __bit                   RB4                 @ (((unsigned) &PORTB)*8) + 4;
#define                                 RB4_bit             BANKMASK(PORTB), 4
extern volatile __bit                   RB4PPS0             @ (((unsigned) &RB4PPS)*8) + 0;
#define                                 RB4PPS0_bit         BANKMASK(RB4PPS), 0
extern volatile __bit                   RB4PPS1             @ (((unsigned) &RB4PPS)*8) + 1;
#define                                 RB4PPS1_bit         BANKMASK(RB4PPS), 1
extern volatile __bit                   RB4PPS2             @ (((unsigned) &RB4PPS)*8) + 2;
#define                                 RB4PPS2_bit         BANKMASK(RB4PPS), 2
extern volatile __bit                   RB4PPS3             @ (((unsigned) &RB4PPS)*8) + 3;
#define                                 RB4PPS3_bit         BANKMASK(RB4PPS), 3
extern volatile __bit                   RB5                 @ (((unsigned) &PORTB)*8) + 5;
#define                                 RB5_bit             BANKMASK(PORTB), 5
extern volatile __bit                   RB5PPS0             @ (((unsigned) &RB5PPS)*8) + 0;
#define                                 RB5PPS0_bit         BANKMASK(RB5PPS), 0
extern volatile __bit                   RB5PPS1             @ (((unsigned) &RB5PPS)*8) + 1;
#define                                 RB5PPS1_bit         BANKMASK(RB5PPS), 1
extern volatile __bit                   RB5PPS2             @ (((unsigned) &RB5PPS)*8) + 2;
#define                                 RB5PPS2_bit         BANKMASK(RB5PPS), 2
extern volatile __bit                   RB5PPS3             @ (((unsigned) &RB5PPS)*8) + 3;
#define                                 RB5PPS3_bit         BANKMASK(RB5PPS), 3
extern volatile __bit                   RB6                 @ (((unsigned) &PORTB)*8) + 6;
#define                                 RB6_bit             BANKMASK(PORTB), 6
extern volatile __bit                   RB6PPS0             @ (((unsigned) &RB6PPS)*8) + 0;
#define                                 RB6PPS0_bit         BANKMASK(RB6PPS), 0
extern volatile __bit                   RB6PPS1             @ (((unsigned) &RB6PPS)*8) + 1;
#define                                 RB6PPS1_bit         BANKMASK(RB6PPS), 1
extern volatile __bit                   RB6PPS2             @ (((unsigned) &RB6PPS)*8) + 2;
#define                                 RB6PPS2_bit         BANKMASK(RB6PPS), 2
extern volatile __bit                   RB6PPS3             @ (((unsigned) &RB6PPS)*8) + 3;
#define                                 RB6PPS3_bit         BANKMASK(RB6PPS), 3
extern volatile __bit                   RB7                 @ (((unsigned) &PORTB)*8) + 7;
#define                                 RB7_bit             BANKMASK(PORTB), 7
extern volatile __bit                   RB7PPS0             @ (((unsigned) &RB7PPS)*8) + 0;
#define                                 RB7PPS0_bit         BANKMASK(RB7PPS), 0
extern volatile __bit                   RB7PPS1             @ (((unsigned) &RB7PPS)*8) + 1;
#define                                 RB7PPS1_bit         BANKMASK(RB7PPS), 1
extern volatile __bit                   RB7PPS2             @ (((unsigned) &RB7PPS)*8) + 2;
#define                                 RB7PPS2_bit         BANKMASK(RB7PPS), 2
extern volatile __bit                   RB7PPS3             @ (((unsigned) &RB7PPS)*8) + 3;
#define                                 RB7PPS3_bit         BANKMASK(RB7PPS), 3
extern volatile __bit                   RC0                 @ (((unsigned) &PORTC)*8) + 0;
#define                                 RC0_bit             BANKMASK(PORTC), 0
extern volatile __bit                   RC0PPS0             @ (((unsigned) &RC0PPS)*8) + 0;
#define                                 RC0PPS0_bit         BANKMASK(RC0PPS), 0
extern volatile __bit                   RC0PPS1             @ (((unsigned) &RC0PPS)*8) + 1;
#define                                 RC0PPS1_bit         BANKMASK(RC0PPS), 1
extern volatile __bit                   RC0PPS2             @ (((unsigned) &RC0PPS)*8) + 2;
#define                                 RC0PPS2_bit         BANKMASK(RC0PPS), 2
extern volatile __bit                   RC0PPS3             @ (((unsigned) &RC0PPS)*8) + 3;
#define                                 RC0PPS3_bit         BANKMASK(RC0PPS), 3
extern volatile __bit                   RC1                 @ (((unsigned) &PORTC)*8) + 1;
#define                                 RC1_bit             BANKMASK(PORTC), 1
extern volatile __bit                   RC1PPS0             @ (((unsigned) &RC1PPS)*8) + 0;
#define                                 RC1PPS0_bit         BANKMASK(RC1PPS), 0
extern volatile __bit                   RC1PPS1             @ (((unsigned) &RC1PPS)*8) + 1;
#define                                 RC1PPS1_bit         BANKMASK(RC1PPS), 1
extern volatile __bit                   RC1PPS2             @ (((unsigned) &RC1PPS)*8) + 2;
#define                                 RC1PPS2_bit         BANKMASK(RC1PPS), 2
extern volatile __bit                   RC1PPS3             @ (((unsigned) &RC1PPS)*8) + 3;
