daviskung/PIC16F1579_HM.X_2019_0524/mcc_generated_files/pic16f1579_ref.h
#define                                 RC1PPS3_bit         BANKMASK(RC1PPS), 3
extern volatile __bit                   RC2                 @ (((unsigned) &PORTC)*8) + 2;
#define                                 RC2_bit             BANKMASK(PORTC), 2
extern volatile __bit                   RC2PPS0             @ (((unsigned) &RC2PPS)*8) + 0;
#define                                 RC2PPS0_bit         BANKMASK(RC2PPS), 0
extern volatile __bit                   RC2PPS1             @ (((unsigned) &RC2PPS)*8) + 1;
#define                                 RC2PPS1_bit         BANKMASK(RC2PPS), 1
extern volatile __bit                   RC2PPS2             @ (((unsigned) &RC2PPS)*8) + 2;
#define                                 RC2PPS2_bit         BANKMASK(RC2PPS), 2
extern volatile __bit                   RC2PPS3             @ (((unsigned) &RC2PPS)*8) + 3;
#define                                 RC2PPS3_bit         BANKMASK(RC2PPS), 3
extern volatile __bit                   RC3                 @ (((unsigned) &PORTC)*8) + 3;
#define                                 RC3_bit             BANKMASK(PORTC), 3
extern volatile __bit                   RC3PPS0             @ (((unsigned) &RC3PPS)*8) + 0;
#define                                 RC3PPS0_bit         BANKMASK(RC3PPS), 0
extern volatile __bit                   RC3PPS1             @ (((unsigned) &RC3PPS)*8) + 1;
#define                                 RC3PPS1_bit         BANKMASK(RC3PPS), 1
extern volatile __bit                   RC3PPS2             @ (((unsigned) &RC3PPS)*8) + 2;
#define                                 RC3PPS2_bit         BANKMASK(RC3PPS), 2
extern volatile __bit                   RC3PPS3             @ (((unsigned) &RC3PPS)*8) + 3;
#define                                 RC3PPS3_bit         BANKMASK(RC3PPS), 3
extern volatile __bit                   RC4                 @ (((unsigned) &PORTC)*8) + 4;
#define                                 RC4_bit             BANKMASK(PORTC), 4
extern volatile __bit                   RC4PPS0             @ (((unsigned) &RC4PPS)*8) + 0;
#define                                 RC4PPS0_bit         BANKMASK(RC4PPS), 0
extern volatile __bit                   RC4PPS1             @ (((unsigned) &RC4PPS)*8) + 1;
#define                                 RC4PPS1_bit         BANKMASK(RC4PPS), 1
extern volatile __bit                   RC4PPS2             @ (((unsigned) &RC4PPS)*8) + 2;
#define                                 RC4PPS2_bit         BANKMASK(RC4PPS), 2
extern volatile __bit                   RC4PPS3             @ (((unsigned) &RC4PPS)*8) + 3;
#define                                 RC4PPS3_bit         BANKMASK(RC4PPS), 3
extern volatile __bit                   RC5                 @ (((unsigned) &PORTC)*8) + 5;
#define                                 RC5_bit             BANKMASK(PORTC), 5
extern volatile __bit                   RC5PPS0             @ (((unsigned) &RC5PPS)*8) + 0;
#define                                 RC5PPS0_bit         BANKMASK(RC5PPS), 0
extern volatile __bit                   RC5PPS1             @ (((unsigned) &RC5PPS)*8) + 1;
#define                                 RC5PPS1_bit         BANKMASK(RC5PPS), 1
extern volatile __bit                   RC5PPS2             @ (((unsigned) &RC5PPS)*8) + 2;
#define                                 RC5PPS2_bit         BANKMASK(RC5PPS), 2
extern volatile __bit                   RC5PPS3             @ (((unsigned) &RC5PPS)*8) + 3;
#define                                 RC5PPS3_bit         BANKMASK(RC5PPS), 3
extern volatile __bit                   RC6                 @ (((unsigned) &PORTC)*8) + 6;
#define                                 RC6_bit             BANKMASK(PORTC), 6
extern volatile __bit                   RC6PPS0             @ (((unsigned) &RC6PPS)*8) + 0;
#define                                 RC6PPS0_bit         BANKMASK(RC6PPS), 0
extern volatile __bit                   RC6PPS1             @ (((unsigned) &RC6PPS)*8) + 1;
#define                                 RC6PPS1_bit         BANKMASK(RC6PPS), 1
extern volatile __bit                   RC6PPS2             @ (((unsigned) &RC6PPS)*8) + 2;
#define                                 RC6PPS2_bit         BANKMASK(RC6PPS), 2
extern volatile __bit                   RC6PPS3             @ (((unsigned) &RC6PPS)*8) + 3;
#define                                 RC6PPS3_bit         BANKMASK(RC6PPS), 3
extern volatile __bit                   RC7                 @ (((unsigned) &PORTC)*8) + 7;
#define                                 RC7_bit             BANKMASK(PORTC), 7
extern volatile __bit                   RC7PPS0             @ (((unsigned) &RC7PPS)*8) + 0;
#define                                 RC7PPS0_bit         BANKMASK(RC7PPS), 0
extern volatile __bit                   RC7PPS1             @ (((unsigned) &RC7PPS)*8) + 1;
#define                                 RC7PPS1_bit         BANKMASK(RC7PPS), 1
extern volatile __bit                   RC7PPS2             @ (((unsigned) &RC7PPS)*8) + 2;
#define                                 RC7PPS2_bit         BANKMASK(RC7PPS), 2
extern volatile __bit                   RC7PPS3             @ (((unsigned) &RC7PPS)*8) + 3;
#define                                 RC7PPS3_bit         BANKMASK(RC7PPS), 3
extern volatile __bit                   RCIDL               @ (((unsigned) &BAUDCON)*8) + 6;
#define                                 RCIDL_bit           BANKMASK(BAUDCON), 6
extern volatile __bit                   RCIE                @ (((unsigned) &PIE1)*8) + 5;
#define                                 RCIE_bit            BANKMASK(PIE1), 5
extern volatile __bit                   RCIF                @ (((unsigned) &PIR1)*8) + 5;
#define                                 RCIF_bit            BANKMASK(PIR1), 5
extern volatile __bit                   RD                  @ (((unsigned) &PMCON1)*8) + 0;
#define                                 RD_bit              BANKMASK(PMCON1), 0
extern volatile __bit                   RX9                 @ (((unsigned) &RCSTA)*8) + 6;
#define                                 RX9_bit             BANKMASK(RCSTA), 6
extern volatile __bit                   RX9D                @ (((unsigned) &RCSTA)*8) + 0;
#define                                 RX9D_bit            BANKMASK(RCSTA), 0
extern volatile __bit                   RXPPS0              @ (((unsigned) &RXPPS)*8) + 0;
#define                                 RXPPS0_bit          BANKMASK(RXPPS), 0
extern volatile __bit                   RXPPS1              @ (((unsigned) &RXPPS)*8) + 1;
#define                                 RXPPS1_bit          BANKMASK(RXPPS), 1
extern volatile __bit                   RXPPS2              @ (((unsigned) &RXPPS)*8) + 2;
#define                                 RXPPS2_bit          BANKMASK(RXPPS), 2
extern volatile __bit                   RXPPS3              @ (((unsigned) &RXPPS)*8) + 3;
#define                                 RXPPS3_bit          BANKMASK(RXPPS), 3
extern volatile __bit                   RXPPS4              @ (((unsigned) &RXPPS)*8) + 4;
#define                                 RXPPS4_bit          BANKMASK(RXPPS), 4
extern volatile __bit                   SBOREN              @ (((unsigned) &BORCON)*8) + 7;
#define                                 SBOREN_bit          BANKMASK(BORCON), 7
extern volatile __bit                   SCKP                @ (((unsigned) &BAUDCON)*8) + 4;
#define                                 SCKP_bit            BANKMASK(BAUDCON), 4
extern volatile __bit                   SCS0                @ (((unsigned) &OSCCON)*8) + 0;
#define                                 SCS0_bit            BANKMASK(OSCCON), 0
extern volatile __bit                   SCS1                @ (((unsigned) &OSCCON)*8) + 1;
#define                                 SCS1_bit            BANKMASK(OSCCON), 1
extern volatile __bit                   SENDB               @ (((unsigned) &TXSTA)*8) + 3;
#define                                 SENDB_bit           BANKMASK(TXSTA), 3
extern volatile __bit                   SLRA0               @ (((unsigned) &SLRCONA)*8) + 0;
#define                                 SLRA0_bit           BANKMASK(SLRCONA), 0
extern volatile __bit                   SLRA1               @ (((unsigned) &SLRCONA)*8) + 1;
#define                                 SLRA1_bit           BANKMASK(SLRCONA), 1
extern volatile __bit                   SLRA2               @ (((unsigned) &SLRCONA)*8) + 2;
#define                                 SLRA2_bit           BANKMASK(SLRCONA), 2
extern volatile __bit                   SLRA4               @ (((unsigned) &SLRCONA)*8) + 4;
#define                                 SLRA4_bit           BANKMASK(SLRCONA), 4
extern volatile __bit                   SLRA5               @ (((unsigned) &SLRCONA)*8) + 5;
#define                                 SLRA5_bit           BANKMASK(SLRCONA), 5
extern volatile __bit                   SLRB4               @ (((unsigned) &SLRCONB)*8) + 4;
#define                                 SLRB4_bit           BANKMASK(SLRCONB), 4
extern volatile __bit                   SLRB5               @ (((unsigned) &SLRCONB)*8) + 5;
#define                                 SLRB5_bit           BANKMASK(SLRCONB), 5
extern volatile __bit                   SLRB6               @ (((unsigned) &SLRCONB)*8) + 6;
#define                                 SLRB6_bit           BANKMASK(SLRCONB), 6
extern volatile __bit                   SLRB7               @ (((unsigned) &SLRCONB)*8) + 7;
#define                                 SLRB7_bit           BANKMASK(SLRCONB), 7
extern volatile __bit                   SLRC0               @ (((unsigned) &SLRCONC)*8) + 0;
#define                                 SLRC0_bit           BANKMASK(SLRCONC), 0
extern volatile __bit                   SLRC1               @ (((unsigned) &SLRCONC)*8) + 1;
#define                                 SLRC1_bit           BANKMASK(SLRCONC), 1
extern volatile __bit                   SLRC2               @ (((unsigned) &SLRCONC)*8) + 2;
#define                                 SLRC2_bit           BANKMASK(SLRCONC), 2
extern volatile __bit                   SLRC3               @ (((unsigned) &SLRCONC)*8) + 3;
#define                                 SLRC3_bit           BANKMASK(SLRCONC), 3
extern volatile __bit                   SLRC4               @ (((unsigned) &SLRCONC)*8) + 4;
#define                                 SLRC4_bit           BANKMASK(SLRCONC), 4
extern volatile __bit                   SLRC5               @ (((unsigned) &SLRCONC)*8) + 5;
#define                                 SLRC5_bit           BANKMASK(SLRCONC), 5
extern volatile __bit                   SLRC6               @ (((unsigned) &SLRCONC)*8) + 6;
#define                                 SLRC6_bit           BANKMASK(SLRCONC), 6
extern volatile __bit                   SLRC7               @ (((unsigned) &SLRCONC)*8) + 7;
#define                                 SLRC7_bit           BANKMASK(SLRCONC), 7
extern volatile __bit                   SPEN                @ (((unsigned) &RCSTA)*8) + 7;
#define                                 SPEN_bit            BANKMASK(RCSTA), 7
extern volatile __bit                   SPLLEN              @ (((unsigned) &OSCCON)*8) + 7;
#define                                 SPLLEN_bit          BANKMASK(OSCCON), 7
extern volatile __bit                   SREN                @ (((unsigned) &RCSTA)*8) + 5;
#define                                 SREN_bit            BANKMASK(RCSTA), 5
extern volatile __bit                   STKOVF              @ (((unsigned) &PCON)*8) + 7;
#define                                 STKOVF_bit          BANKMASK(PCON), 7
extern volatile __bit                   STKUNF              @ (((unsigned) &PCON)*8) + 6;
#define                                 STKUNF_bit          BANKMASK(PCON), 6
extern volatile __bit                   SWDTEN              @ (((unsigned) &WDTCON)*8) + 0;
#define                                 SWDTEN_bit          BANKMASK(WDTCON), 0
extern volatile __bit                   SYNC                @ (((unsigned) &TXSTA)*8) + 4;
#define                                 SYNC_bit            BANKMASK(TXSTA), 4
extern volatile __bit                   T0CKIPPS0           @ (((unsigned) &T0CKIPPS)*8) + 0;
#define                                 T0CKIPPS0_bit       BANKMASK(T0CKIPPS), 0
extern volatile __bit                   T0CKIPPS1           @ (((unsigned) &T0CKIPPS)*8) + 1;
#define                                 T0CKIPPS1_bit       BANKMASK(T0CKIPPS), 1
extern volatile __bit                   T0CKIPPS2           @ (((unsigned) &T0CKIPPS)*8) + 2;
#define                                 T0CKIPPS2_bit       BANKMASK(T0CKIPPS), 2
extern volatile __bit                   T0CKIPPS3           @ (((unsigned) &T0CKIPPS)*8) + 3;
#define                                 T0CKIPPS3_bit       BANKMASK(T0CKIPPS), 3
extern volatile __bit                   T0CKIPPS4           @ (((unsigned) &T0CKIPPS)*8) + 4;
#define                                 T0CKIPPS4_bit       BANKMASK(T0CKIPPS), 4
extern volatile __bit                   T0CS                @ (((unsigned) &OPTION_REG)*8) + 5;
#define                                 T0CS_bit            BANKMASK(OPTION_REG), 5
extern volatile __bit                   T0IE                @ (((unsigned) &INTCON)*8) + 5;
#define                                 T0IE_bit            BANKMASK(INTCON), 5
extern volatile __bit                   T0IF                @ (((unsigned) &INTCON)*8) + 2;
#define                                 T0IF_bit            BANKMASK(INTCON), 2
extern volatile __bit                   T0SE                @ (((unsigned) &OPTION_REG)*8) + 4;
#define                                 T0SE_bit            BANKMASK(OPTION_REG), 4
extern volatile __bit                   T1CKIPPS0           @ (((unsigned) &T1CKIPPS)*8) + 0;
#define                                 T1CKIPPS0_bit       BANKMASK(T1CKIPPS), 0
extern volatile __bit                   T1CKIPPS1           @ (((unsigned) &T1CKIPPS)*8) + 1;
#define                                 T1CKIPPS1_bit       BANKMASK(T1CKIPPS), 1
extern volatile __bit                   T1CKIPPS2           @ (((unsigned) &T1CKIPPS)*8) + 2;
#define                                 T1CKIPPS2_bit       BANKMASK(T1CKIPPS), 2
extern volatile __bit                   T1CKIPPS3           @ (((unsigned) &T1CKIPPS)*8) + 3;
#define                                 T1CKIPPS3_bit       BANKMASK(T1CKIPPS), 3
extern volatile __bit                   T1CKIPPS4           @ (((unsigned) &T1CKIPPS)*8) + 4;
#define                                 T1CKIPPS4_bit       BANKMASK(T1CKIPPS), 4
extern volatile __bit                   T1CKPS0             @ (((unsigned) &T1CON)*8) + 4;
#define                                 T1CKPS0_bit         BANKMASK(T1CON), 4
extern volatile __bit                   T1CKPS1             @ (((unsigned) &T1CON)*8) + 5;
#define                                 T1CKPS1_bit         BANKMASK(T1CON), 5
extern volatile __bit                   T1GGO               @ (((unsigned) &T1GCON)*8) + 3;
#define                                 T1GGO_bit           BANKMASK(T1GCON), 3
extern volatile __bit                   T1GGO_nDONE         @ (((unsigned) &T1GCON)*8) + 3;
#define                                 T1GGO_nDONE_bit     BANKMASK(T1GCON), 3
extern volatile __bit                   T1GPOL              @ (((unsigned) &T1GCON)*8) + 6;
#define                                 T1GPOL_bit          BANKMASK(T1GCON), 6
extern volatile __bit                   T1GPPS0             @ (((unsigned) &T1GPPS)*8) + 0;
#define                                 T1GPPS0_bit         BANKMASK(T1GPPS), 0
extern volatile __bit                   T1GPPS1             @ (((unsigned) &T1GPPS)*8) + 1;
#define                                 T1GPPS1_bit         BANKMASK(T1GPPS), 1
extern volatile __bit                   T1GPPS2             @ (((unsigned) &T1GPPS)*8) + 2;
#define                                 T1GPPS2_bit         BANKMASK(T1GPPS), 2
extern volatile __bit                   T1GPPS3             @ (((unsigned) &T1GPPS)*8) + 3;
#define                                 T1GPPS3_bit         BANKMASK(T1GPPS), 3
extern volatile __bit                   T1GPPS4             @ (((unsigned) &T1GPPS)*8) + 4;
#define                                 T1GPPS4_bit         BANKMASK(T1GPPS), 4
extern volatile __bit                   T1GSPM              @ (((unsigned) &T1GCON)*8) + 4;
#define                                 T1GSPM_bit          BANKMASK(T1GCON), 4
extern volatile __bit                   T1GSS0              @ (((unsigned) &T1GCON)*8) + 0;
#define                                 T1GSS0_bit          BANKMASK(T1GCON), 0
extern volatile __bit                   T1GSS1              @ (((unsigned) &T1GCON)*8) + 1;
#define                                 T1GSS1_bit          BANKMASK(T1GCON), 1
extern volatile __bit                   T1GTM               @ (((unsigned) &T1GCON)*8) + 5;
#define                                 T1GTM_bit           BANKMASK(T1GCON), 5
extern volatile __bit                   T1GVAL              @ (((unsigned) &T1GCON)*8) + 2;
#define                                 T1GVAL_bit          BANKMASK(T1GCON), 2
extern volatile __bit                   T1OSCEN             @ (((unsigned) &T1CON)*8) + 3;
#define                                 T1OSCEN_bit         BANKMASK(T1CON), 3
extern volatile __bit                   T2CKPS0             @ (((unsigned) &T2CON)*8) + 0;
#define                                 T2CKPS0_bit         BANKMASK(T2CON), 0
extern volatile __bit                   T2CKPS1             @ (((unsigned) &T2CON)*8) + 1;
#define                                 T2CKPS1_bit         BANKMASK(T2CON), 1
extern volatile __bit                   T2OUTPS0            @ (((unsigned) &T2CON)*8) + 3;
#define                                 T2OUTPS0_bit        BANKMASK(T2CON), 3
extern volatile __bit                   T2OUTPS1            @ (((unsigned) &T2CON)*8) + 4;
#define                                 T2OUTPS1_bit        BANKMASK(T2CON), 4
extern volatile __bit                   T2OUTPS2            @ (((unsigned) &T2CON)*8) + 5;
#define                                 T2OUTPS2_bit        BANKMASK(T2CON), 5
extern volatile __bit                   T2OUTPS3            @ (((unsigned) &T2CON)*8) + 6;
#define                                 T2OUTPS3_bit        BANKMASK(T2CON), 6
extern volatile __bit                   TMR0CS              @ (((unsigned) &OPTION_REG)*8) + 5;
#define                                 TMR0CS_bit          BANKMASK(OPTION_REG), 5
extern volatile __bit                   TMR0IE              @ (((unsigned) &INTCON)*8) + 5;
#define                                 TMR0IE_bit          BANKMASK(INTCON), 5
extern volatile __bit                   TMR0IF              @ (((unsigned) &INTCON)*8) + 2;
#define                                 TMR0IF_bit          BANKMASK(INTCON), 2
extern volatile __bit                   TMR0SE              @ (((unsigned) &OPTION_REG)*8) + 4;
#define                                 TMR0SE_bit          BANKMASK(OPTION_REG), 4
extern volatile __bit                   TMR1CS0             @ (((unsigned) &T1CON)*8) + 6;
#define                                 TMR1CS0_bit         BANKMASK(T1CON), 6
extern volatile __bit                   TMR1CS1             @ (((unsigned) &T1CON)*8) + 7;
#define                                 TMR1CS1_bit         BANKMASK(T1CON), 7
extern volatile __bit                   TMR1GE              @ (((unsigned) &T1GCON)*8) + 7;
#define                                 TMR1GE_bit          BANKMASK(T1GCON), 7
extern volatile __bit                   TMR1GIE             @ (((unsigned) &PIE1)*8) + 7;
#define                                 TMR1GIE_bit         BANKMASK(PIE1), 7
extern volatile __bit                   TMR1GIF             @ (((unsigned) &PIR1)*8) + 7;
#define                                 TMR1GIF_bit         BANKMASK(PIR1), 7
extern volatile __bit                   TMR1IE              @ (((unsigned) &PIE1)*8) + 0;
#define                                 TMR1IE_bit          BANKMASK(PIE1), 0
extern volatile __bit                   TMR1IF              @ (((unsigned) &PIR1)*8) + 0;
#define                                 TMR1IF_bit          BANKMASK(PIR1), 0
extern volatile __bit                   TMR1ON              @ (((unsigned) &T1CON)*8) + 0;
#define                                 TMR1ON_bit          BANKMASK(T1CON), 0
extern volatile __bit                   TMR2IE              @ (((unsigned) &PIE1)*8) + 1;
#define                                 TMR2IE_bit          BANKMASK(PIE1), 1
extern volatile __bit                   TMR2IF              @ (((unsigned) &PIR1)*8) + 1;
#define                                 TMR2IF_bit          BANKMASK(PIR1), 1
extern volatile __bit                   TMR2ON              @ (((unsigned) &T2CON)*8) + 2;
#define                                 TMR2ON_bit          BANKMASK(T2CON), 2
extern volatile __bit                   TRIGSEL0            @ (((unsigned) &ADCON2)*8) + 4;
#define                                 TRIGSEL0_bit        BANKMASK(ADCON2), 4
extern volatile __bit                   TRIGSEL1            @ (((unsigned) &ADCON2)*8) + 5;
#define                                 TRIGSEL1_bit        BANKMASK(ADCON2), 5
extern volatile __bit                   TRIGSEL2            @ (((unsigned) &ADCON2)*8) + 6;
#define                                 TRIGSEL2_bit        BANKMASK(ADCON2), 6
extern volatile __bit                   TRIGSEL3            @ (((unsigned) &ADCON2)*8) + 7;
#define                                 TRIGSEL3_bit        BANKMASK(ADCON2), 7
extern volatile __bit                   TRISA0              @ (((unsigned) &TRISA)*8) + 0;
#define                                 TRISA0_bit          BANKMASK(TRISA), 0
extern volatile __bit                   TRISA1              @ (((unsigned) &TRISA)*8) + 1;
#define                                 TRISA1_bit          BANKMASK(TRISA), 1
extern volatile __bit                   TRISA2              @ (((unsigned) &TRISA)*8) + 2;
#define                                 TRISA2_bit          BANKMASK(TRISA), 2
extern volatile __bit                   TRISA3              @ (((unsigned) &TRISA)*8) + 3;
#define                                 TRISA3_bit          BANKMASK(TRISA), 3
extern volatile __bit                   TRISA4              @ (((unsigned) &TRISA)*8) + 4;
#define                                 TRISA4_bit          BANKMASK(TRISA), 4
extern volatile __bit                   TRISA5              @ (((unsigned) &TRISA)*8) + 5;
#define                                 TRISA5_bit          BANKMASK(TRISA), 5
extern volatile __bit                   TRISB4              @ (((unsigned) &TRISB)*8) + 4;
#define                                 TRISB4_bit          BANKMASK(TRISB), 4
extern volatile __bit                   TRISB5              @ (((unsigned) &TRISB)*8) + 5;
#define                                 TRISB5_bit          BANKMASK(TRISB), 5
extern volatile __bit                   TRISB6              @ (((unsigned) &TRISB)*8) + 6;
#define                                 TRISB6_bit          BANKMASK(TRISB), 6
extern volatile __bit                   TRISB7              @ (((unsigned) &TRISB)*8) + 7;
#define                                 TRISB7_bit          BANKMASK(TRISB), 7
extern volatile __bit                   TRISC0              @ (((unsigned) &TRISC)*8) + 0;
#define                                 TRISC0_bit          BANKMASK(TRISC), 0
extern volatile __bit                   TRISC1              @ (((unsigned) &TRISC)*8) + 1;
#define                                 TRISC1_bit          BANKMASK(TRISC), 1
extern volatile __bit                   TRISC2              @ (((unsigned) &TRISC)*8) + 2;
#define                                 TRISC2_bit          BANKMASK(TRISC), 2
extern volatile __bit                   TRISC3              @ (((unsigned) &TRISC)*8) + 3;
#define                                 TRISC3_bit          BANKMASK(TRISC), 3
